import { AbilityKeyword } from '@/enums/ability-keyword';
import { FactoryLogic } from '@/logic/factory-logic';
import { SubClass } from '@/models/subclass';

export const green: SubClass = {
	id: 'elementalist-sub-3',
	name: 'Зелень',
	description: 'Зелень — елемент творення та росту. Здібності зелені створюють і маніпулюють рослинами, грибами та іншими формами життя, щоб гальмувати ворогів і живити ваших союзників.',
	featuresByLevel: [
		{
			level: 1,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-1-1',
					name: 'Адепт зелені',
					description: 'Ви використовуєте залишкову магію своїх зелених заклять, щоб підсилити себе та своїх союзників. Коли ви завдаєте шкоди одній або кільком істотам здібністю з ключовими словами «Зелень» та «Магія», яка потребує есенції, ви або одна істота в межах 10 клітинок від вас отримує тимчасову Витривалість, рівну вашому показнику Розуму.'
				}),
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-1-2',
					name: 'Душа, що чує',
					description: `
Ви можете говорити й розуміти тварин, звірів і рослинних істот, навіть якщо вони не мають спільної з вами мови. Ваша здатність спілкуватися з цими істотами не робить їх суттєво розумнішими, але при перевірках для впливу на них ви можете використовувати Розум замість Присутності.

Крім того, ви можете торкнутися живої рослини, яка не є рослинною істотою, щоб спілкуватися з нею телепатично. Ви можете використовувати слова для спілкування з рослиною, але вона відповідає вам лише передачею відчуттів і вражень, які не можуть бути надто конкретними.`
				}),
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'elementalist-sub-3-1-3',
						name: 'Подих памʼятного світанку',
						description: 'Магія, яку ви каналізуєте, дає змогу повернутися в бій.',
						type: FactoryLogic.type.createTrigger('Ціль починає свій хід або отримує пошкодження.'),
						keywords: [AbilityKeyword.Green, AbilityKeyword.Magic, AbilityKeyword.Ranged],
						distance: [FactoryLogic.distance.createRanged(10)],
						target: 'На себе або одного союзника',
						sections: [
							FactoryLogic.createAbilitySectionText('Ціль може витратити Відновлення.'),
							FactoryLogic.createAbilitySectionSpend({
								repeatable: true,
								effect: 'Ціль може витратити додаткове Відновлення за кожну витрачену есенцію.'
							})
						]
					})
				})
			]
		},
		{
			level: 2,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-2-1',
					name: 'Учень зелені',
					description: `
Ви можете використовувати маневр, щоб перевтілитися у тип істоти з таблиці «Форми зелених тварин». Поки ви в тваринній формі, ви можете говорити, а для виконання ближніх безкоштовних ударів ви використовуєте свій показник Розуму. Ваші характеристики залишаються тими самими, окрім випадків, зазначених у таблиці.

Кожна форма має вимогу по рівню, яку ви повинні досягти перед тим, як її прийняти. Деякі тваринні форми надають вам тимчасову Витривалість. Ви втрачаєте цю тимчасову Витривалість, коли повертаєтесь до своєї справжньої форми.

Ви обираєте конкретну тварину та її зовнішній вигляд у тваринній формі. Наприклад, якщо ви стаєте гризуном, ви можете стати мишею, пацюком, землерийкою або будь-якою іншою істотою розміру 1T, що відповідає типу гризуна. Коли ви набуваєте тваринної форми, ваше спорядження або зливається з новою формою, або падає недоторканим на землю (на ваш вибір). Коли ви повертаєтесь до справжньої форми, будь-яке злитe спорядження зʼявляється знову на вашому тілі.

Ви можете повернутись до справжньої форми як маневр. Ви не можете увійти в тваринну форму, поки не перебуваєте в справжній формі. Коли ви вмираєте, ви повертаєтесь до справжньої форми і не можете знову перетворитися на тварину, доки не перестанете вмирати.

| Тип істоти         | Рівень  | Тимчасова Витривалість  | Швидкість         | Розмір | Бонус стабільності | Бонус до ближньої шкоди | Особливість                                                                                                                                                                                                                                                                |
|:--------------------|:-------|:-------------------|:--------------|:-----|:----------------|:-------------------|:-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Собакоподібний      | 2-й    | 5                  | 7             | 1M   | +0              | +1/+1/+1           | Ви отримуєте перевагу в перевірках, повʼязаних із запахом.                                                                                                                                                                                                                          |
| Риба                | 2-й    | 0                  | 5 (тільки плавання) | 1T   | +0              | +0/+0/+0           | Ви можете дихати під водою, але не можете дихати поза нею.                                                                                                                                                                                                              |
| Гризун              | 2-й    | 0                  | 5 (лазіння)   | 1T   | +0              | +0/+0/+0           | Ви отримуєте перевагу в перевірках, повʼязаних із запахом.                                                                                                                                                                                                                          |
| Птах                | 3-й    | 0                  | 5 (польот)     | 1T   | +0              | +0/+0/+0           |  -                                                                                                                                                                                                                                                                     |
| Велика кішка        | 3-й    | 5                  | 6 (лазіння)   | 2    | +0              | +1/+1/+1           | Як маневр, стрибніть до 3 клітинок у будь-якому напрямку. Якщо ви приземлитесь на ворога вашого розміру або меншого, той ворог падає на землю, і ви можете зробити по ньому ближній безкоштовний удар у рамках маневру.                                                           |
| Гігантська жаба      | 4-й    | 5                  | 5 (плавання)   | 2    | +0              | +0/+0/+0           | Ваш ближній безкоштовний удар має дистанцію ближнього бою 3. Коли ви використовуєте дію «Рух уперед», ви можете виконати високий або довгий стрибок до половини вашої швидкості. Цей стрибок може дозволити вам переміститися більше клітинок, ніж ваша швидкість.                                                           |
| Кінь                | 4-й    | 5                  | 8             | 2    | +1              | +0/+0/+0           | Ви можете використовувати основну дію «Розгін» як маневр. Ви не можете використовувати дві основні дії «Розгін» в один хід.                                                                                                                                                              |
| Молер               | 4-й    | 0                  | 7 (копання)    | 1S   | +1              | +0/+0/+0           | Ваша дистанція ближнього бою отримує бонус +1.                                                                                                                                                                                                                                  |
| Ведмідь             | 5-й    | 10                 | 5 (лазіння)   | 2    | +1              | +2/+2/+2           | Ваша дистанція ближнього бою отримує бонус +1.                                                                                                                                                                                                                                  |
| Гігантський птах    | 5-й    | 0                  | 7 (польот)     | 2    | +0              | +1/+1/+1           | Після виконання ближнього безкоштовного удару ви можете зміститися до 3 клітинок як безкоштовну тригерну дію.                                                                                                                                                                            |
| Гігантська саламандра | 6-й    | 5                  | 5             | 1L   | +3              | +2/+2/+2           | Ваш ближній безкоштовний удар завдає вогняної шкоди. Крім того, у вас є імунітет до вогню 3.                                                                                                                                                                                       |
| Гігантський павук    | 6-й    | 0                  | 5 (лазіння)   | 2    | +0              | +0/+1/+2           | Ви маєте подвійну перевагу на ближні безкоштовні удари проти істот, від яких ви ховаєтесь.                                                                                                                                                                                    |
| Гігантська змія      | 7-й    | 5                  | 5             | 3    | +0              | +0/+1/+2           | Коли ви отримуєте результат рівня 2 або рівня 3 на ближньому безкоштовному ударі, ви можете автоматично схопити ціль. Коли ціль схоплена таким чином, вона отримує 2 шкоди на початку кожного свого ходу.                                                                   |
| Кенгуру             | 7-й    | 0                  | 7             | 1L   | +1              | +0/+0/+4           | Коли ви завдаєте критичного удару ближнім безкоштовним ударом, ціль оглушається (рят. кидок скасовує). Коли ви використовуєте дію «Рух уперед», ви можете виконати високий або довгий стрибок до половини вашої швидкості. Цей стрибок може дозволити вам переміститися більше клітинок, ніж ваша швидкість.                    |
| Колючий броненосець  | 7-й    | 10                 | 5             | 1M   | +2              | +0/+0/+0           | Коли ви отримуєте шкоду від ближньої здібності сусідньої істоти, ця істота отримує 3 шкоди.                                                                                                                                                                      |
| Страус              | 8-й    | 0                  | 10            | 2    | +0              | +1/+1/+1           | Ваш рух не провокує атак у відповідь.                                                                                                                                                                                                                    |
| Акула               | 8-й    | 0                  | 8 (тільки плавання) | 2    | +0              | +2/+2/+2           | Ви можете дихати під водою, але не можете дихати поза нею. Крім того, ви отримуєте перевагу при ударах по цілях, що кровоточать або захекані.                                                                                                                        |
| Гігантський восьминіг | 9-й    | 5                  | 5 (плавання)      | 3    | +2              | +0/+0/+0           | Ви можете дихати під водою. Крім того, ви можете цілити дві істоти або обʼєкти своїм ближнім безкоштовним ударом. Коли ви отримуєте результат рівня 2 або рівня 3 на ближньому безкоштовному ударі, ви можете автоматично схопити ціль. Ви можете мати до восьми схоплених істот. |
| Носоріг             | 9-й    | 10                 | 8             | 2    | +5              | +2/+2/+2           | Коли ви робите ближній безкоштовний удар у складі дії «Розгін», той удар отримує перевагу.                                                                                                                                                                         |
| Король-страшний ящір | 10-й   | 20                 | 5             | 4    | +3              | +2/+2/+2           | Ваш ближній безкоштовний удар є вибухом 1 з ключовими словами «Зона» та «Удар».`
				})
			]
		},
		{
			level: 3,
			features: [
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'elementalist-sub-3-3-1',
						name: 'Памʼятай ріст, сонце й дощ',
						description: 'Ви пробуджуєте памʼять будь-якого дерева і дізнаєтесь, що воно бачило.',
						type: FactoryLogic.type.createMain(),
						keywords: [AbilityKeyword.Green, AbilityKeyword.Magic, AbilityKeyword.Melee],
						distance: [FactoryLogic.distance.createMelee()],
						target: 'Один звичайний деревʼяний предмет',
						sections: [
							FactoryLogic.createAbilitySectionText('Ви бачите й чуєте всі події, що відбулися в межах 10 клітинок від обʼєкта за останні 12 годин, сприймаючи їх з місця розташування обʼєкта, ніби ви були там.')
						]
					})
				})
			]
		},
		{
			level: 4,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-4-1',
					name: 'Мантія Есенції: Квітуче ложе',
					description: `
	Поки у вас 3 або більше есенції та ви не вмираєте, ви випромінюєте ауру магії на відстань, рівну вашому показнику Розуму. Ви можете вмикати й вимикати ауру за бажанням (без витрати дії).

	Наприкінці кожного вашого ходу кожен союзник у зоні отримує тимчасову Витривалість, рівну вашому показнику Розуму.`
				})
			]
		},
		{
			level: 5,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-5-1',
					name: 'Шкіра десятикратних щитів',
					description: `
	Ваші тваринні форми стають витривалішими. Ви отримуєте тимчасову Витривалість, рівну вашому рівню, коли входите в тваринну форму в бою; вона додається до будь-якої тимчасової Витривалості, що надається тваринною формою.

	Крім того, сусідній союзник може використати маневр, щоб погладити вас. Якщо він це зробить, ви можете втратити тимчасову Витривалість до мінімуму 0. Союзник отримує тимчасову Витривалість, рівну кількості, яку ви втратили.`
				})
			]
		},
		{
			level: 6,
			features: []
		},
		{
			level: 7,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-6-1',
					name: 'Мантія Квінтесенції',
					description: `
	Властивість вашої Мантії Есенції більше не вимагає есенції.

	Крім того, ваша Мантія Есенції тепер випромінює магію, що створює заспокійливу атмосферу. Істоти в зоні аури мантії мають початкове терпіння збільшене на 1 (до максимуму 5) під час будь-яких переговорів. Поки в зоні, ви та будь-який союзник отримуєте перевагу в перевірках, що використовують навичку «Управління тваринами». Якщо у вас 5 або більше Перемог, бонус до терпіння збільшується до 2, а перевірки з «Управління тваринами» мають подвійну перевагу.`
				})
			]
		},
		{
			level: 8,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-7-1',
					name: 'Химерна маніфестація',
					description: `
	Природа не є статичною і незмінною, так само й ви. Ви можете увійти або вийти з тваринної форми як безкоштовний маневр перший раз, коли використовуєте функцію «Учень зелені» у своєму ході.

	Крім того, щоразу, коли ви використовуєте функцію «Учень зелені», ви можете вибрати додаткову тваринну форму і отримати позитивні ефекти обох форм. Ви можете вибрати розмір будь-якої з тварин, і якщо обидві форми надають однакову перевагу, ви можете обрати ту, яку віддаєте перевагу. Ви отримуєте найбільшу швидкість з двох форм і маєте всі види пересування обох форм.

	Ви можете комбінувати лише ті тваринні форми, сума рівнів яких не перевищує 12. Наприклад, ви можете комбінувати акулу (8-й рівень) з конем (4-й рівень), але не можете комбінувати акулу з ведмедем (5-й рівень).`
				})
			]
		},
		{
			level: 10,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-3-8-1',
					name: 'Один: Майстер зелені',
					description: `
	Ви стаєте втіленням елемента вашої обраної спеціалізації. Коли ви використовуєте магію, навколо вас літають елементальні іскорки, і ваша шкіра змінює вигляд відповідно до елементу: земля — ґрунтова або камʼяниста текстура, вогонь — ніби мерехтливе полумʼя, зелень — листковий візерунок, пустота — зоряне небо.

	Кількість ваших Відновлень (Recoveries) збільшується на 2, і щоразу, коли ви завершуєте відпочинок, ви можете надати кожному союзнику, який завершив відпочинок разом з вами, по 2 додаткові Відновлення. Додаткові Відновлення ваших союзників зникають, коли вони завершать свій наступний відпочинок.

	Крім того, як дія під час відпочинку, ви можете виконати ритуал, який викликає фруктове дерево, яке виростає, достигає й дає 1d6 чарівних плодів, званих «Плід життя». Ви можете використати дію відпочинку, щоб примусити існуюче дерево виробити ще 1d6 Плодів життя, але воно не вирощуватиме ці магічні споживні ресурси саме по собі.

	Як маневр, істота може зʼїсти Плід життя або нагодувати ним суміжного охочого союзника. Коли істота їсть Плід життя, вона відновлює всю свою Витривалість, може припинити всі стани або ефекти на собі та може вставати, якщо лежала. Крім того, якщо істота бажає, її старіння призупиняється на 1d10 років. Якщо істота зʼїсть додаткові Плоди життя і обере призупинити старіння, ефекти не сумуються. Натомість істота отримує вигоду від Плоду життя, який призупиняє її старіння на найдовший термін.`
				})
			]
		}
	],
	abilities: [],
	selected: false
};
