import { AbilityKeyword } from '@/enums/ability-keyword';
import { FactoryLogic } from '@/logic/factory-logic';
import { SubClass } from '@/models/subclass';

export const voidSubclass: SubClass = {
	id: 'elementalist-sub-4',
	name: 'Порожнеча',
	description: 'Порожнеча — стихія таємниці. Здібності Порожнечі деформують простір і реальність, дозволяючи телепортуватися, створювати ілюзії й робити предмети нематеріальними.',
	featuresByLevel: [
		{
			level: 1,
			features: [
				FactoryLogic.feature.createAbilityDistance({
					id: 'elementalist-sub-4-1-1',
					name: 'Адепт Порожнечі',
					keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged, AbilityKeyword.Void],
					value: 2
				}),
				FactoryLogic.feature.create({
					id: 'elementalist-sub-4-1-2',
					name: 'Видіння Поза',
					description: 'Ви миттєво розпізнаєте ілюзії, бачите невидимих істот, і надприродні ефекти не можуть приховати від вас істот та предметів. Крім того, ви завжди знаєте, чи є спостережувана область або предмет магічними або під дією магії, і знаєте, що саме робить ця магія.'
				}),
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'elementalist-sub-4-1-3',
						name: 'Спільне відчуття Порожнечі',
						description: 'Ви даруєте союзникам частинку свого позаземного зору.',
						type: FactoryLogic.type.createManeuver(),
						keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged, AbilityKeyword.Void],
						distance: [FactoryLogic.distance.createRanged(10)],
						target: 'Особлива',
						sections: [
							FactoryLogic.createAbilitySectionText('За кожну вашу Перемогу ви можете обрати одну істоту. Кожна обрана істота отримує ефект вашої здібності Видіння Поза до кінця вашого наступного ходу, але не отримує можливості використовувати Спільне відчуття Порожнечі.')
						]
					})
				}),
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'elementalist-sub-4-1-4',
						name: 'Непомітне переміщення',
						description: 'Ви звертаєтеся до Порожнечі, щоб вона поглинула й виплюнула союзника.',
						type: FactoryLogic.type.createTrigger('Ціль починає свій хід, рухається або її примусово переміщують.'),
						keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged, AbilityKeyword.Void],
						distance: [FactoryLogic.distance.createRanged(10)],
						target: 'На себе або одного союзника',
						sections: [
							FactoryLogic.createAbilitySectionText('Ви телепортуєте ціль на число клітинок, рівне вашому показнику Розуму. Якщо ціль рухається і це спричиняє активацію цієї здібності, ви можете телепортувати її в будь-який момент під час руху.'),
							FactoryLogic.createAbilitySectionSpend({
								effect: 'Натомість ви телепортуєте ціль на число клітинок, рівне подвоєному значенню вашого показника Розуму.'
							})
						]
					})
				})
			]
		},
		{
			level: 2,
			features: [
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'elementalist-sub-4-2-1',
						name: 'Між просторами немає відстані',
						description: 'Пізнання таємниці відкриває, що дві просторові точки можуть бути одним і тим же простором.',
						type: FactoryLogic.type.createManeuver(),
						keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged, AbilityKeyword.Void],
						distance: [FactoryLogic.distance.createRanged(10)],
						target: 'Особлива',
						sections: [
							FactoryLogic.createAbilitySectionText(`
Ви відкриваєте два портали розміром 1 у вільних клітинках у межах дистанції; вони діють доки ви не відійдете за межі дистанції від будь-якого порталу, не припините ефект як маневр або не опинитесь у стані вмирання. Кожен портал має бути розташований на висоті не більше 1 клітинки над землею. Коли ви або будь-який союзник торкаєтеся порталу, та істота може обрати негайно телепортуватися в будь-яку вільну клітинку поруч з іншим порталом. Якщо ворога примусово переміщують у портал, їхнє примусове переміщення припиняється, і вони зʼявляються з іншого порталу у вільній клітинці, обраній істотою, яка примусово їх перемістила.

На початку кожного вашого ходу, поки портали активні, ви можете відкрити новий портал, зʼєднаний з іншими. Якщо присутні три або більше порталів, ви та ваші союзники обираєте, з якого порталу виходити при вході в портал, а істота, яка примусово переміщує ворога в портал, обирає портал призначення для того ворога.`)
						]
					})
				})
			]
		},
		{
			level: 3,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-4-3-1',
					name: 'Відстань — лише спогад',
					description: 'Кожного разу, коли ви завершуєте перерву, ви можете відкрити двосторонній портал, який веде до будь-якого місця, де ви раніше були. Ви та ваші союзники можете проходити крізь портал; він залишається відкритим 1 годину або доки ви не закриєте його як головну дію.'
				})
			]
		},
		{
			level: 4,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-4-4-1',
					name: 'Мантія Есенції: Завіса',
					description: `
Поки у вас 3 або більше есенції й ви не перебуваєте в стані вмирання, ви випромінюєте ауру магії з радіусом, рівним вашому показнику Розуму. Ви можете вмикати та вимикати ауру за бажанням (дія не потрібна).

Область надає прикриття вам та вашим союзникам.`
				})
			]
		},
		{
			level: 5,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-4-5-1',
					name: 'Прорвати Завісу Матерії',
					description: `
Твердість для вас — лиш порада. Побутові перешкоди товщиною до 1 клітинки не блокують ваші відчуття або лінію ефекту. Ви можете відчувати або мати лінію ефекту через не більше ніж одну таку перешкоду одночасно.

Крім того, кожного разу, коли ви використовуєте здібність Порожнечі, ви або один союзник у межах дії цієї здібності можете телепортуватися на число клітинок, рівне вашому показнику Розуму.`
				})
			]
		},
		{
			level: 6,
			features: []
		},
		{
			level: 7,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-4-6-1',
					name: 'Мантія Квінтесенції',
					description: `
Ваша здібність Мантія Есенції більше не вимагає есенції.

    			Крім того, тепер ваша Мантія Есенції випромінює магію, що створює заспокійливу атмосферу. Істоти в межах аури мантії отримують +1 до початкової терпеливості (до максимуму 5) під час будь-яких переговорів. Поки ви в області, ви й будь-який союзник отримують перевагу в випробуваннях, що використовують навичку Управління тваринами. Якщо у вас 5 або більше Перемог, бонус до терпеливості збільшується до 2, а випробування з навичкою Управління тваринами мають подвійну перевагу.`
				})
			]
		},
		{
			level: 8,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-4-7-1',
					name: 'Зірка Чорної Діри',
					description: `
Ви деформуєте гравітацію навколо свого небесного тіла й можете притягнути навіть найстійкіших титанів до свого ядра. Наприкінці кожного вашого ходу ви обираєте одну істоту або предмет у межах дистанції вашої здібності Кидок стихії і вертикально притягаєте цю ціль до 5 клітинок. Якщо їхня стійкість зменшує це примусове переміщення, вони притягуються мінімум на 2 клітинки. Це примусове переміщення ігнорує стійкість для ваших союзників.

Крім того, ваша Мантія Есенції покращується. Поки ви в межах аури, вороги та предмети мають зменшену стійкість на величину, рівну вашому рівню.`
				})
			]
		},
		{
			level: 10,
			features: [
				FactoryLogic.feature.create({
					id: 'elementalist-sub-4-8-1',
					name: 'Один: Майстер Порожнечі',
					description: `
Ви стаєте втіленням стихії вашої обраної спеціалізації. Коли ви використовуєте магію, навколо вас кружляють елементарні іскорки, а шкіра змінює свій вигляд відповідно до стихії: земля набуває земляного або камʼяного вигляду, вогонь — наче мерехтливе полумʼя, зелень — листковий візерунок, а Порожнеча — вигляд зоряного простору.

Кожного разу, коли ви добровільно рухаєтесь, ви можете телепортуватися.

Крім того, ваш розум пов'язаний із Таємницею і допомагає знаходити відповіді, які ви шукаєте. Вам більше не потрібні джерела проєкту для дослідницьких проєктів. Кожного разу, коли ви використовуєте дію відпочинку для виконання кидка проєкту для дослідницького проєкту, ви автоматично завершуєте цей проєкт.`
				})
			]
		}
	],
	abilities: [],
	selected: false
};
