import { Career } from '@/models/career';
import { FactoryLogic } from '@/logic/factory-logic';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';

export const agent: Career = {
	id: 'career-agent',
	name: 'Агент',
	description: 'Ви працювали шпигуном на уряд або організацію.',
	features: [
		FactoryLogic.feature.createSkillChoice({
			id: 'career-agent-feature-1',
			selected: ['Крастись']
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'career-agent-feature-2',
			listOptions: [SkillList.Interpersonal]
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'career-agent-feature-3',
			listOptions: [SkillList.Intrigue]
		}),
		FactoryLogic.feature.createLanguageChoice({
			id: 'career-agent-feature-4',
			count: 2
		}),
		FactoryLogic.feature.createPerk({
			id: 'career-agent-feature-5',
			lists: [PerkList.Intrigue]
		})
	],
	incitingIncidents: {
		options: [
			{
				id: 'career-agent-ii-1',
				name: 'Відкинутий',
				description: 'Під час небезпечного шпигунського завдання все пішло не так. Хоча ви врятувалися, місія завершилася публічним провалом через хибну інформацію від вашої агенції. Вони відмовилися визнавати вас своїм агентом, і вам довелося тікати. Героїчна діяльність допоможе вам вижити й відновити своє імʼя.'
			},
			{
				id: 'career-agent-ii-2',
				name: 'Без обличчя',
				description: 'Ваша особистість завжди залишалася прихованою — це був спосіб захистити близьких, адже шпигунство за могутніми особами було небезпечним. Але одного дня ворожий агент розкрив вас, і ви втратили все: приватність, роботу, коханих — усе зникло в одну мить. Замість того, щоб сховатися, ви стали публічним героєм, щоб захищати невинних на честь тих, кого втратили.'
			},
			{
				id: 'career-agent-ii-3',
				name: 'Вільний агент',
				description: 'У певний період життя ви продавали інформацію тому, хто більше заплатить. Ваші дії не були санкціоновані жодною організацією, але ви мали достатньо звʼязків для торгівлі секретами. Політика вас не цікавила, поки продана інформація не спричинила ланцюгову реакцію, яка зруйнувала ваш дім. Ви стали героєм, щоб спокутувати минуле.'
			},
			{
				id: 'career-agent-ii-4',
				name: 'Поінформований',
				description: 'Після років роботи з інформаторами один із них ризикнув усім, щоб викрити жахливі плани впливових осіб. Ви пообіцяли захистити інформатора, але агенція залишила його напризволяще — буквально. Ви розірвали звʼязки з роботодавцем і поклялися завжди дотримуватися слова як герой.'
			},
			{
				id: 'career-agent-ii-5',
				name: 'Шпигуни й кохання',
				description: 'Працюючи під прикриттям, ви закохалися в когось із протилежного боку. Вони дізналися, що ви подвійний агент, і хоча ви запевняли у щирості почуттів, зрада була надто болючою. Вас викрили, відкинули або ж ця людина загинула через близькість до вас. Ви залишили шпигунську справу, щоб стати героєм без таємниць.'
			},
			{
				id: 'career-agent-ii-6',
				name: 'Перебіжчик',
				description: 'Ви присвятили життя службі країні чи організації, що поділяла ваші цінності. Під час роботи під прикриттям ви дізналися, що все, у що вірили, — брехня. Чи ви самі викрили керівників, чи вас викрили, вас позбавили всіх відзнак, і ви пішли, щоб стати справжнім героєм.'
			}
		],
		selected: null,
		selectedID: null
	}
};
