import { Career } from '@/models/career';
import { FactoryLogic } from '@/logic/factory-logic';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';

export const beggar: Career = {
	id: 'career-beggar',
	name: 'Жебрак',
	description: 'Ви виживали, ходячи до таверн, перехресть, міських вулиць чи інших людних місць і випрошуючи в перехожих гроші або їжу.',
	features: [
		FactoryLogic.feature.createSkillChoice({
			id: 'career-beggar-feature-1',
			selected: ['Rumors']
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'career-beggar-feature-2',
			listOptions: [SkillList.Exploration]
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'career-beggar-feature-3',
			listOptions: [SkillList.Interpersonal]
		}),
		FactoryLogic.feature.createLanguageChoice({
			id: 'career-beggar-feature-4',
			count: 2
		}),
		FactoryLogic.feature.createPerk({
			id: 'career-beggar-feature-5',
			lists: [PerkList.Interpersonal]
		})
	],
	incitingIncidents: {
		options: [
			{
				id: 'career-beggar-ii-1',
				name: 'Захисник',
				description: 'Ви ніколи не були задоволені своєю долею. Коли ще один друг загинув через обставини, яких можна було уникнути, це стало останньою краплею. Ви зібрали все, що мали, й вирушили стати героєм, сповненим рішучості змінити життя тих, про кого суспільство забуло.'
			},
			{
				id: 'career-beggar-ii-2',
				name: 'Нічні жахи',
				description: 'Щось убило інших жебраків. Воно прийшло вночі. Ви ледь його бачили, але те, що побачили, було неприродним. Ви вижили, сховавшись, або ж воно просто омину́ло вас із невідомих причин. Це досі переслідує вас у кошмарах, і ви винищуєте чудовиськ, щоб ніхто більше не пережив таких жахіть.'
			},
			{
				id: 'career-beggar-ii-3',
				name: 'Один добрий вчинок',
				description: 'Ви потрапили в немилість місцевої варти, опинившись не в тому місці й не в той час. Герой, що проходив повз, заступився за вас, присоромивши вартових, а потім дав вам золота, щоб ви піднялися на ноги. Його доброта запалила у вас іскру. Ви взяли золото, купили вживане спорядження й вирушили віддячити за доброту.'
			},
			{
				id: 'career-beggar-ii-4',
				name: 'Дорогоцінність',
				description: 'Як би низько ви не впали, була одна річ, із якою ви ніколи б не розлучилися, хоч би скільки за неї дали. Коли кишеньковий злодій украв її, ви гналися за ним, поки не опинилися в незнайомій частині міста. Раптом ви зрозуміли, що не хочете повертатися на старі місця. Ви пішли далі й не озиралися.'
			},
			{
				id: 'career-beggar-ii-5',
				name: 'Дивна милостиня',
				description: 'Хтось кинув щось у вашу чашу. Порахувавши денний заробіток, ви знайшли серед мідяків чарівну монету. Ви одразу зрозуміли, що вона особлива. Коли інші жебраки — ваші друзі, як ви думали — вирішили вбити вас за неї, ви вбили кількох із них, захищаючись, а потім утекли, залишивши єдину подобу спільноти, яка у вас була.'
			},
			{
				id: 'career-beggar-ii-6',
				name: 'Свідок',
				description: 'Ви побачили те, чого не мали бачити. Інші вбили б вас, якби дізналися, і, можливо, досі шукають. Ви постійно в русі, боїтеся затриматися десь надовго, щоб минуле не наздогнало вас. Можливо, якщо ви здобудете достатню славу, станете недоторканним і зможете розповісти про побачене без страху.'
			}
		],
		selected: null,
		selectedID: null
	}
};
