import { Career } from '@/models/career';
import { FactoryLogic } from '@/logic/factory-logic';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';

export const explorer: Career = {
	id: 'career-explorer',
	name: 'Дослідник',
	description: 'Ви вирушали в незвідані землі й заробляли на життя як картограф, дослідник, шукач ресурсів або мисливець за скарбами.',
	features: [
		FactoryLogic.feature.createSkillChoice({
			id: 'career-explorer-feature-1',
			selected: ['Navigate']
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'career-explorer-feature-2',
			listOptions: [SkillList.Exploration],
			count: 2
		}),
		FactoryLogic.feature.createLanguageChoice({
			id: 'career-explorer-feature-3',
			count: 2
		}),
		FactoryLogic.feature.createPerk({
			id: 'career-explorer-feature-4',
			lists: [PerkList.Exploration]
		})
	],
	incitingIncidents: {
		options: [
			{
				id: 'career-explorer-ii-1',
				name: 'Пробудження',
				description: 'У незвіданій місцевості ви пробудили темний жах. Ви стали героєм, щоб зупинити це зло й захистити інших від прихованих небезпек.'
			},
			{
				id: 'career-explorer-ii-2',
				name: 'Відсутня частина',
				description: 'Ви зробили важливе, але небезпечне відкриття про скарб або стародавній ритуал, що міг призвести до масового знищення. Невдовзі безчесний колега, шпигун чи мисливець за скарбами викрав ваші дослідницькі записи. Тепер ви шукаєте їх і всіх, хто може використати ці знання на зло.'
			},
			{
				id: 'career-explorer-ii-3',
				name: 'Місце не в музеї',
				description: 'Колись ви перетинали моря й гори, збираючи цінні артефакти для культурних установ. Коли люди загинули, намагаючись повернути один із предметів, ви усвідомили істину: ваша робота була частиною проблеми привласнення, і найкраще місце для цих речей — серед їхніх творців. Ви вирушили повертати вкрадене й захищати інших від крадіжок.'
			},
			{
				id: 'career-explorer-ii-4',
				name: 'Самоук',
				description: 'Ви досліджували підземелля й далекі місця, вивчаючи їх у книжках. Ви були дослідником, якому не потрібно було ризикувати, як іншим. Однак ваша теорія про загублений світ зруйнувала вашу репутацію. Це спонукало вас вирушити в пригоди й захищати тих, хто мислить інакше.'
			},
			{
				id: 'career-explorer-ii-5',
				name: 'Тяга до мандрів',
				description: 'Ви вважали себе спостерігачем і дотримувалися кодексу поведінки. Ви поклялися не втручатися в життя груп, не навʼязуючи їм свої технології, знання чи цінності. Зіткнувшись із моральною дилемою, ви або порушили кодекс, або залишилися осторонь — і зазнали наслідків. Під час цієї пригоди ви втратили журнал спостережень, але стали героєм, який не дозволяє злу залишатися безкарним.'
			},
			{
				id: 'career-explorer-ii-6',
				name: 'Вітер у вітрилах',
				description: 'Як морський дослідник, ви прокладали невідомі маршрути. Хоча подорожі морем були сповнені небезпек, винагородою ставали багатства, знання чи щось інше важливе для вас. Удача зрадила, коли ваш корабель знищили пірати чи вороги. Тепер ви захищаєте тих, хто шукає безпечний шлях, і прагнете помститися за екіпаж.'
			}
		],
		selected: null,
		selectedID: null
	}
};
