import { Career } from '@/models/career';
import { FactoryLogic } from '@/logic/factory-logic';
import { FeatureField } from '@/enums/feature-field';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';

export const performer: Career = {
	id: 'career-performer',
	name: 'Артист',
	description: 'Ви співаєте, граєте або танцюєте настільки добре, що люди навіть платять, щоб побачити це. Уявіть собі!',
	features: [
		FactoryLogic.feature.createSkillChoice({
			id: 'performer-feature-1',
			options: [ 'Music', 'Perform' ]
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'performer-feature-2',
			listOptions: [ SkillList.Interpersonal ],
			count: 2
		}),
		FactoryLogic.feature.createBonus({
			id: 'performer-feature-3',
			field: FeatureField.Renown,
			value: 2
		}),
		FactoryLogic.feature.createPerk({
			id: 'performer-feature-4',
			lists: [ PerkList.Interpersonal ]
		})
	],
	incitingIncidents: {
		options: [
			{
				id: 'career-performer-ii-1',
				name: 'Проклята публіка',
				description: 'Під час виступу ви з жахом спостерігали, як на глядачів раптово впало прокляття, і вони розсипалися на ваших очах. Ви не впевнені, що сталося, але пошуки відповіді швидко привели вас туди, куди наважуються йти лише герої.'
			},
			{
				id: 'career-performer-ii-2',
				name: 'Фальшиві овації',
				description: 'Після невдалого виступу ви знайшли у гримерці сценарій гарної пʼєси. У записці просили, якщо ви поставите цю пʼєсу, вказати автора. Але після блискучого виконання ви заявили, що є і зіркою, і драматургом — і прокляття, заховане на сторінках, активувалося. Частина вашої шкіри почала перетворюватися на плоть нежиті, і єдиний спосіб зцілення — довести, що ви стали безкорисливим.'
			},
			{
				id: 'career-performer-ii-3',
				name: 'Слава і багатство',
				description: 'Ви думали, що стали знаменитим — аж раптом на ваш виступ прийшов герой. Усі погляди звернулися до переможця драконів, а не на сцену, де їм і місце. Глядачі навіть влаштували йому овацію, коли він увійшов. Ви ж отримали лише ввічливі оплески. Що ж, якщо людям так потрібен герой, то ним станете ви.'
			},
			{
				id: 'career-performer-ii-4',
				name: 'Пісні для мертвих',
				description: 'Ваші виступи завжди мали нотку смутку. Під час особливо душевного виконання духи потривожили живу публіку й сіли на їхні місця. Вони благали вас запобігти своїй загибелі, не залишивши інших подробиць, і зникли. Ви вирушили, щоб допомогти своїм найвідданішим шанувальникам.'
			},
			{
				id: 'career-performer-ii-5',
				name: 'Безмовність',
				description: 'Глузливі слова крикуна залишили вас безмовним під час виступу, зачепивши вашу гордість і розбурхавши пиху. Інцидент зіпсував ваш легендарний голос, і ви могли говорити лише пошепки. Крикун виявився фейським хитруном, який викрав ваш голос, пообіцявши повернути його, коли ви зробите справжнє добро у світі.'
			},
			{
				id: 'career-performer-ii-6',
				name: 'Трагічний урок',
				description: 'Коли продюсер, який колись вас обдурив, закричав на вулиці, щоб ви зупинили злодія, що обікрав його, ваша злість на продюсера змусила вас дозволити злодію втекти. Але це рішення призвело до трагедії, коли злодій пізніше скривдив когось із ваших близьких. Відтоді ви взяли на себе відповідальність захищати інших.'
			}
		],
		selected: null,
		selectedID: null
	}
};
