import { Career } from '@/models/career';
import { FactoryLogic } from '@/logic/factory-logic';
import { FeatureField } from '@/enums/feature-field';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';

export const sage: Career = {
	id: 'career-sage',
	name: 'Мудрець',
	description: 'З раннього віку ви присвятили себе навчанню — чи то ділилися знаннями зі світом, чи шукали таємні знання лише для себе.',
	features: [
		FactoryLogic.feature.createSkillChoice({
			id: 'career-sage-feature-1',
			listOptions: [ SkillList.Lore ],
			count: 2
		}),
		FactoryLogic.feature.createLanguageChoice({
			id: 'career-sage-feature-2'
		}),
		FactoryLogic.feature.createBonus({
			id: 'career-sage-feature-3',
			field: FeatureField.ProjectPoints,
			value: 240
		}),
		FactoryLogic.feature.createPerk({
			id: 'career-sage-feature-4',
			lists: [ PerkList.Lore ]
		})
	],
	incitingIncidents: {
		options: [
			{
				id: 'career-sage-ii-1',
				name: 'Книжкові ідеї',
				description: 'Ви завжди були задоволені спокійним життям у бібліотеці, поки не знайшли ту саму книгу — ту, що розповідала про героїв, які врятували часовий простір. Вони не сиділи за столом — вони змінювали світ. Настав час і вам зробити те саме.'
			},
			{
				id: 'career-sage-ii-2',
				name: 'Зцілити прокляття',
				description: 'Ви думали, що знання можуть усе виправити. Ви помилялися. Коли близька людина потрапила під прокляття, засобу зцілення не знайшлося в жодній з ваших книг. Але це вас не зупинило. Відповіді десь там, і ви їх знайдете, навіть якщо доведеться кинути виклик смерті.'
			},
			{
				id: 'career-sage-ii-3',
				name: 'Втрачена бібліотека',
				description: 'Злий маг забрав усі ваші книги, насміхаючись із вашої безпорадності, коли грабував полиці. Тепер ви вирушаєте шукати стародавні руїни й таємні бібліотеки, щоб відновити свою колекцію рідкісних томів — і знайти мага, який вас обікрав.'
			},
			{
				id: 'career-sage-ii-4',
				name: 'Паперова провина',
				description: 'Під час переписування стародавніх текстів ви з іншим писарем знайшли полицю давно забутих книг. За вашою порадою товариш узявся за одну з них і зник разом із томом. Почуття провини змусило вас шукати друга й не дати іншим потрапити в подібну небезпеку.'
			},
			{
				id: 'career-sage-ii-5',
				name: 'Непередбачені майбуття',
				description: 'У пошуках стародавніх знань ви відкрили пророцтво, яке ще не здійснилося. І це пророцтво стосується когось, хто може бути… вами. Відтоді вас переслідують дивні сни, що спонукають шукати свою долю.'
			},
			{
				id: 'career-sage-ii-6',
				name: 'Зникнення',
				description: 'Спочатку ви думали, що це уява, й не звертали уваги на зникнення випадкових речень у хроніках. Але коли книги перетворилися на порожні сторінки, і особливо коли зникали давні чи важливі тексти, це стало важко ігнорувати. Бажання зберегти знання стало вашою метою — відновити й повернути зникаючі тексти, поки вони не зникли назавжди.'
			}
		],
		selected: null,
		selectedID: null
	}
};
