import { Career } from '@/models/career';
import { FactoryLogic } from '@/logic/factory-logic';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';

export const sailor: Career = {
	id: 'career-sailor',
	name: 'Моряк',
	description: 'Ви працювали на кораблі, що міг бути торговим когом, найманським чи військовим судном або піратським кораблем. Ви могли бути матросом, помічником чи навіть капітаном.',
	features: [
		FactoryLogic.feature.createSkillChoice({
			id: 'career-sailor-feature-1',
			selected: [ 'Swim' ]
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'career-sailor-feature-2',
			listOptions: [ SkillList.Exploration ],
			count: 2
		}),
		FactoryLogic.feature.createLanguageChoice({
			id: 'career-sailor-feature-3',
			count: 2
		}),
		FactoryLogic.feature.createPerk({
			id: 'career-sailor-feature-4',
			lists: [ PerkList.Exploration ]
		})
	],
	incitingIncidents: {
		options: [
			{
				id: 'career-sailor-ii-1',
				name: 'Наодинці',
				description: 'Ви вирушили в плавання з найкращим другом, братом чи іншою близькою людиною — здійсненням мрії про спільні морські пригоди. Коли вони загинули, ви втратили смак до морського життя. Ви залишили корабель при першій нагоді й відтоді не озиралися.'
			},
			{
				id: 'career-sailor-ii-2',
				name: 'Дезертир',
				description: 'Під час піратського нападу (чи ви були нападником, чи жертвою) ви зрозуміли, що більше не прагнете життя моряка. Ви скористалися хаосом, щоб непомітно втекти. Тепер ви працюєте героєм, намагаючись або покласти край піратству, або спокутувати минулі гріхи, але боїтеся дня, коли стара команда знайде вас і покарає за дезертирство.'
			},
			{
				id: 'career-sailor-ii-3',
				name: 'Забутий',
				description: 'Ви прокинулися на кораблі, не памʼятаючи, хто ви. Інші моряки стверджували, що знають вас, але ви їх не впізнавали. Наступного разу, коли ви зійшли на берег, вирішили залишитися, щоб дізнатися, хто ви насправді.'
			},
			{
				id: 'career-sailor-ii-4',
				name: 'Заздрість',
				description: 'Ви мали прихильність капітана, що принесло вам багато суперників на кораблі. Однієї ночі товариші витягли вас із ліжка й викинули за борт. Дивом вас підібрало інше судно. Ви відпрацювали борг і почали нове життя без дрібʼязковості.'
			},
			{
				id: 'career-sailor-ii-5',
				name: 'Залишений',
				description: 'Під час бунту ви опинилися на боці переможених. Вас залишили на острові, але ви врятувалися, коли торговий корабель, збитий зі шляху бурею, знайшов вас. Серед моряків ваша репутація зруйнована, тож ви шукаєте пригоди в інших місцях.'
			},
			{
				id: 'career-sailor-ii-6',
				name: 'Страх води',
				description: 'Під час плавання вас застала катастрофічна буря, яка знищила корабель і залишила вас єдиним уцілілим. Коли ви одужали, спробували найнятися на інший корабель, але думка про відкриту воду паралізувала вас. Тож ви стали мандрівним героєм, щоб заробити на життя.'
			}
		],
		selected: null,
		selectedID: null
	}
};
