import { Career } from '@/models/career';
import { FactoryLogic } from '@/logic/factory-logic';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';

export const watchOfficer: Career = {
	id: 'career-watch-officer',
	name: 'Офіцер варти',
	description: 'Ви служили охоронцем порядку при місцевій владі. Ви могли бути одним із багатьох у міській варті або єдиним констеблем, що патрулював маленьке село.',
	features: [
		FactoryLogic.feature.createSkillChoice({
			id: 'career-watch-officer-feature-1',
			selected: [ 'Alertness' ]
		}),
		FactoryLogic.feature.createSkillChoice({
			id: 'career-watch-officer-feature-2',
			listOptions: [ SkillList.Intrigue ],
			count: 2
		}),
		FactoryLogic.feature.createLanguageChoice({
			id: 'career-watch-officer-feature-3',
			count: 2
		}),
		FactoryLogic.feature.createPerk({
			id: 'career-watch-officer-feature-4',
			lists: [ PerkList.Exploration ]
		})
	],
	incitingIncidents: {
		options: [
			{
				id: 'career-watch-officer-ii-1',
				name: 'Великі риби',
				description: 'Вам набридло ганятися за дрібними злодіями й саджати за ґрати тих, хто просто намагається вижити. У світі є загрози й серйозніші. Ви знайдете зло, де б воно не ховалося, і саме ви його зупините.'
			},
			{
				id: 'career-watch-officer-ii-2',
				name: 'Корупція всередині',
				description: 'Ви приєдналися до варти, щоб допомагати беззахисним і відновлювати справедливість. Ви не були готові до тотальної корупції, що сягала верхівки організації. Ви відмовилися покривати колег і отримали чітку вимогу залишити місто або зіткнутися з наслідками. Тепер ви мандруєте як герой, захищаючи людей так, як завжди мріяли.'
			},
			{
				id: 'career-watch-officer-ii-3',
				name: 'Підстава',
				description: 'Вашого напарника вбили — це незаперечно. Але це зробили не ви, попри докази. Коли стало ясно, що вас зроблять цапом-відбувайлом, ви втекли, залишивши все. Не бажаючи ховатися в тіні, ви вирішили стати шукачем пригод під новим імʼям, поки працюєте над очищенням власного.'
			},
			{
				id: 'career-watch-officer-ii-4',
				name: 'Зниклий наставник',
				description: 'Усьому, що знаєте про роботу, вас навчив хтось, ким ви захоплювалися, навіть у корумпованій організації. Однієї ночі він надіслав вам загадкове повідомлення, що відкрив «щось велике», але до того, як ви дізналися подробиці, зник. Більше не знаючи, кому довіряти, ви зникли й почали нове життя. Тепер ви робите добро, як можете, і шукаєте правду.'
			},
			{
				id: 'career-watch-officer-ii-5',
				name: 'Той, хто вислизнув',
				description: 'Особливо жорстокий чи розбещений злочинець почав переслідувати вас — можливо, вкрав щось особисте чи скривдив когось із близьких — після того, як вислизнув із ваших рук. Ви залишили службу, щоб вистежити злочинця, але слід охолов… принаймні поки що. Тим часом можна допомогти іншим.'
			},
			{
				id: 'career-watch-officer-ii-6',
				name: 'Могутні вороги',
				description: 'Ви взяли на себе відповідальність викрити й знищити головне злочинне угруповання регіону. Вони надіслали головорізів, які спалили ваш дім і залишили вас стікати кровʼю на вулиці, позбавивши всього, крім життя. Відтоді ви стали героєм, щоб здобути силу й вплив, необхідні для остаточної перемоги над синдикатом.'
			}
		],
		selected: null,
		selectedID: null
	}
};
