import { EnvironmentData, OrganizationData, UpbringingData } from '@/data/culture-data';
import { Ancestry } from '@/models/ancestry';
import { ConditionType } from '@/enums/condition-type';
import { CultureType } from '@/enums/culture-type';
import { FactoryLogic } from '@/logic/factory-logic';

export const hakaan: Ancestry = {
	id: 'ancestry-hakaan',
	name: 'Хакаан',
	description: 'Попри їхню дружню, відкриту натуру, рідкісна присутність хакаана в людському суспільстві вважається провісником — ознакою темних часів. Походячи від племені велетнів у верхньому Ванігарі, оригінальне плем’я Хака’ан уклало угоду з Холкатжею, ванігарським богом-шахраєм. Вони обміняли частину свого гігантського розміру та сили на здатність бачити майбутнє.',
	features: [
		FactoryLogic.feature.createSize({
			id: 'hakaan-feature-1',
			name: 'Великий!',
			sizeValue: 1,
			sizeMod: 'L'
		}),
		FactoryLogic.feature.createChoice({
			id: 'hakaan-feature-2',
			name: 'Риси Хакаана',
			options: [
				{
					feature: FactoryLogic.feature.create({
						id: 'hakaan-feature-2-1',
						name: 'Все — пір’їнка',
						description: 'Ви надзвичайно сильні. Ви отримуєте перевагу на випробуваннях, зроблених для підняття та перенесення важких предметів.'
					}),
					value: 1
				},
				{
					feature: FactoryLogic.feature.create({
						id: 'hakaan-feature-2-2',
						name: 'Сильний',
						description: 'Коли ви змушуєте рухатися істоту або об’єкт, відстань примусового переміщення отримує бонус +1.'
					}),
					value: 1
				},
				{
					feature: FactoryLogic.feature.create({
						id: 'hakaan-feature-2-3',
						name: 'Стояти міцно',
						description: 'Ваше тіло створене для витримування ударів ворогів. Ваш показник Сили вважається на 1 вищим для опору потужностям, і ви отримуєте перевагу на випробуваннях Сили, коли це потрібно для опору впливу навколишнього середовища або рис чи здібностей істоти.'
					}),
					value: 1
				},
				{
					feature: FactoryLogic.feature.createConditionImmunity({
						id: 'hakaan-feature-2-4',
						name: 'Велика витривалість',
						description: 'Ваш міцний організм запобігає втраті сили.',
						conditions: [ConditionType.Weakened]
					}),
					value: 2
				},
				{
					feature: FactoryLogic.feature.create({
						id: 'hakaan-feature-2-5',
						name: 'Погляд приреченості',
						description: `
Працюючи з вашим Директором, ви можете заздалегідь визначити зустріч, у якій ви загинете. Коли ця зустріч починається, ви стаєте приреченим. Поки ви приречені, ви автоматично отримуєте результат рівня 3 на випробуваннях і кидках здібностей, і ви не помираєте, незалежно від того, наскільки низько падає ваша Витривалість. Ви потім негайно помираєте наприкінці зустрічі й не можете бути повернуті до життя жодним чином.

Якщо ви не визначаєте заздалегідь свою зустріч смерті, ви можете вибрати стати приреченим, поки ви вмираєте, за згодою Директора (жодна дія не потрібна). Це слід залишити для зустрічей, у яких ви вмираєте внаслідок відповідного героїзму, наприклад, роблячи останній опір проти боса або рятуючи цивільних, або коли наслідки ваших дій нарешті наздогнали вас — не тому, що ви граєте одноразову гру й вам нічого втрачати, Хакарле.

Крім того, коли ваша Витривалість досягає негативного значення вашого захеканого значення, і ви не приречені, ви перетворюєтеся на уламки замість того, щоб переживати смерть. У цьому стані ви не усвідомлюєте свого оточення, і ви не можете відновити Витривалість або скасувати цей ефект будь-яким чином. Через 12 годин ви відновлюєте Витривалість, рівну вашому значенню Відновлення.`
					}),
					value: 2
				}
			],
			count: 'ancestry'
		})
	],
	ancestryPoints: 3,
	culture: FactoryLogic.createCulture('Хакаан', 'Сільський, комунальний, праця.', CultureType.Ancestral, EnvironmentData.rural, OrganizationData.communal, UpbringingData.labor, 'Ворик')
};
