import { FactoryLogic } from '@/logic/factory-logic';
import { FeatureType } from '@/enums/feature-type';
import { Perk } from '@/models/perk';
import { PerkList } from '@/enums/perk-list';

export class LorePerkData {
	static butIKnowWhoDoes: Perk = {
		id: 'perk-but-i-know-who-does',
		name: 'Але я знаю, хто знає',
		description: 'Кожного разу, коли ви провалюєте тест, щоб пригадати знання, використовуючи навичку з групи знань, ви інстинктивно згадуєте найближче місце, де можна знайти потрібну інформацію. Це може бути вежа місцевого мудреця, бібліотека в сусідньому місті, щось глибоко в підземеллі чи будь-яке інше місце на розсуд Директора. Директор може вирішити, що певні знання не можна відкрити таким способом.',
		type: FeatureType.Text,
		data: null,
		list: PerkList.Lore
	};

	static eideticMemory: Perk = {
		id: 'perk-eidetic-memory',
		name: 'Ейдетична памʼять',
		description: 'Ваш розум - це енциклопедія, хай і не завжди зручна для впорядкування. Коли ви завершуєте перепочинок, оберіть одну навичку з групи знань, якої у вас немає. Ви маєте цю навичку до завершення наступного перепочинку. Додатково, якщо ви витратите 1 безперервну хвилину або більше на читання будь-якої сторінки тексту, то можете запамʼятати її вміст, а маючи достатньо часу - й цілі книжки.',
		type: FeatureType.Text,
		data: null,
		list: PerkList.Lore
	};

	static expertSage: Perk = {
		id: 'perk-expert-sage',
		name: 'Досвідчений мудрець',
		description: 'Кожного разу, коли ви робите тест як частину ремісничого або дослідницького проєкту, використовуючи навичку з групи знань, ви можете зробити кидок сили двічі й використати будь-який із результатів.',
		type: FeatureType.Text,
		data: null,
		list: PerkList.Lore
	};

	static iveReadAboutThisPlace: Perk = {
		id: 'perk-ive-read-about-this-place',
		name: 'Я читав про це місце',
		description: `
Щоразу, коли ви входите до поселення, у якому ніколи раніше не були, ви можете поставити Директору одне з таких запитань:

* Хто є найвпливовішою публічною постаттю в цьому поселенні?
* Хто в цьому поселенні зараз був би до нас найприязнішим?
* Чого це поселення найбільше потребує від чужинців?

Якщо в Директора немає відповіді на поставлене вами запитання або він не хоче відповідати, ви можете натомість поставити інше запитання.`,
		type: FeatureType.Text,
		data: null,
		list: PerkList.Lore
	};

	static linguist: Perk = {
		id: 'perk-linguist',
		name: 'Лінгвіст',
		description: 'У вас добрий слух до мов. Ви автоматично вивчаєте дві нові мови, якщо раніше регулярно чули їх у мовленні або бачили в письмі.',
		type: FeatureType.Multiple,
		data: {
			features: [
				FactoryLogic.feature.create({
					id: 'perk-linguist-1',
					name: 'Лінгвіст',
					description: 'Якщо ви проводите 7 днів або більше в місці, де регулярно чуєте або читаєте мову, якої не знаєте, то можете вловити її достатньо, щоб підтримувати розмову або розуміти базову письмову інформацію. Опісля, коли ви вже підхопили мову таким чином, ви можете вивчити її через дослідницький проєкт «Вивчити нову мову» за половину звичайної вартості цілі проєкту.'
				}),
				FactoryLogic.feature.createLanguageChoice({
					id: 'perk-linguist-2',
					count: 2
				})
			]
		},
		list: PerkList.Lore
	};

	static polymath: Perk = {
		id: 'perk-polymath',
		name: 'Полімат',
		description: 'Кожного разу, коли ви робите тест, щоб пригадати знання, і не маєте навички, що підходить до цього тесту, ви отримуєте +1 бонус до кидка сили.',
		type: FeatureType.Text,
		data: null,
		list: PerkList.Lore
	};

	static specialist: Perk = {
		id: 'perk-specialist',
		name: 'Спеціаліст',
		description: 'Ви є провідним фахівцем у певній темі. Оберіть одну навичку з групи знань, яку ви маєте. Ви завжди маєте подвійну перевагу на тести, щоб пригадати знання, використовуючи цю навичку. Додатково, ваша спеціалізована обізнаність дає вам репутацію в галузях, повʼязаних із цією навичкою. Ви вважаєте свій Renown на 1 вищим під час переговорів із NPC, який знає вашу славу, або на 2 вищим, якщо він має ту саму навичку, яку ви обрали для цієї переваги.',
		type: FeatureType.Text,
		data: null,
		list: PerkList.Lore
	};

	static travellingSage: Perk = {
		id: 'perk-travelling-sage',
		name: 'Мандрівний мудрець',
		description: 'У будь-який день, коли ви не берете перепочинок, ви можете витратити 1 безперервну годину на роботу над дослідницьким проєктом, використовуючи навичку з групи знань, яку маєте. Якщо зробите це, ви отримаєте 1d10 очок проєкту для цього проєкту.',
		type: FeatureType.Text,
		data: null,
		list: PerkList.Lore
	};
}
