import { AttitudeType } from '@/enums/attitude-type';
import { NegotiationTrait } from '@/enums/negotiation-trait';

export class NegotiationLogic {
	static getInterest = (attitude: AttitudeType) => {
		switch (attitude) {
			case AttitudeType.Hostile:
				return 1;
			case AttitudeType.Suspicious:
				return 2;
			case AttitudeType.Neutral:
				return 2;
			case AttitudeType.Open:
				return 3;
			case AttitudeType.Friendly:
				return 3;
			case AttitudeType.Trusting:
				return 3;
		}

		return 0;
	};

	static getPatience = (attitude: AttitudeType) => {
		switch (attitude) {
			case AttitudeType.Hostile:
				return 2;
			case AttitudeType.Suspicious:
				return 2;
			case AttitudeType.Neutral:
				return 3;
			case AttitudeType.Open:
				return 3;
			case AttitudeType.Friendly:
				return 4;
			case AttitudeType.Trusting:
				return 5;
		}

		return 0;
	};

	static getAttitudeName = (attitude: AttitudeType) => {
		switch (attitude) {
			case AttitudeType.Hostile:
				return 'Вороже';
			case AttitudeType.Suspicious:
				return 'Підозріле';
			case AttitudeType.Neutral:
				return 'Нейтральне';
			case AttitudeType.Open:
				return 'Відкрите';
			case AttitudeType.Friendly:
				return 'Приязне';
			case AttitudeType.Trusting:
				return 'Довірливе';
		}

		return '';
	};

	static getAttitudeDescription = (attitude: AttitudeType) => {
		switch (attitude) {
			case AttitudeType.Hostile:
				return 'Відкрито налаштоване проти героїв. Ледве готове слухати.';
			case AttitudeType.Suspicious:
				return 'Сумнівається в мотивах героїв, але готове вислухати.';
			case AttitudeType.Neutral:
				return 'Не відчуває нічого ні в один, ні в інший бік. Воліло б бути деінде, але не хоче грубити.';
			case AttitudeType.Open:
				return 'Готове вислухати й допомогти, якщо герої не просять забагато.';
			case AttitudeType.Friendly:
				return 'Герої здаються NPC своїми людьми. NPC готовий дати їм кредит довіри.';
			case AttitudeType.Trusting:
				return 'NPC має підстави вірити героям на слово і допоможе, якщо персонажі самі все не зіпсують.';
		}

		return '';
	};

	static getTraitName = (trait: NegotiationTrait) => {
		switch (trait) {
			case NegotiationTrait.Benevolence:
				return 'Милосердя';
			case NegotiationTrait.Discovery:
				return 'Пізнання';
			case NegotiationTrait.Freedom:
				return 'Свобода';
			case NegotiationTrait.Greed:
				return 'Жадібність';
			case NegotiationTrait.HigherAuthority:
				return 'Вища влада';
			case NegotiationTrait.Justice:
				return 'Справедливість';
			case NegotiationTrait.Legacy:
				return 'Спадщина';
			case NegotiationTrait.Peace:
				return 'Мир';
			case NegotiationTrait.Power:
				return 'Влада';
			case NegotiationTrait.Protection:
				return 'Захист';
			case NegotiationTrait.Revelry:
				return 'Розваги';
			case NegotiationTrait.Vengeance:
				return 'Помста';
		}

		return '';
	};

	static getMotivationDescription = (trait: NegotiationTrait) => {
		switch (trait) {
			case NegotiationTrait.Benevolence:
				return 'NPC із мотивацією милосердя вірить у те, що потрібно ділитися тим, що має, з іншими. Водночас NPC, залучений до переговорів, має бути обмежений у своєму милосерді, щоб не просто віддати героям усе, що їм потрібно.';
			case NegotiationTrait.Discovery:
				return 'NPC із мотивацією пізнання прагне вивчати нові знання, досліджувати забуті місця, проводити новаторські експерименти або відкривати артефакти, загублені часом. Його цікавість і жага знань можуть бути зумовлені конкретною метою, наприклад пошуком ліків від рідкісної хвороби чи порталу до далекого світу. Або ж це просто допитлива натура, яка хоче зрозуміти якомога більше про Таймскейп.';
			case NegotiationTrait.Freedom:
				return 'NPC із мотивацією свободи не хоче мати над собою влади й не прагне владарювати над іншими. Він може вже мати особисту свободу й бажати зберегти цей статус-кво, а може прагнути звільнити себе чи інших від чужої влади.';
			case NegotiationTrait.Greed:
				return 'NPC із мотивацією жадібності понад усе прагне багатства й ресурсів. Деякі з них - скнари, подібні до зміїв, що накопичують монети й самоцвіти, але ніколи не витрачають і не жертвують їх. Інші ж виставляють своє багатство напоказ, вважаючи його ознакою свого становища в житті.';
			case NegotiationTrait.HigherAuthority:
				return 'NPC із мотивацією вищої влади непохитно відданий особі або силі, яку вважає важливішою за себе. Такою вищою владою може бути організація, божество чи істота великої сили, офіційний правитель на кшталт шляхтича або монарха, містична присутність чи сила, яку NPC може й не до кінця розуміти, або людина, яку NPC сприймає як неформальний авторитет, наприклад старший брат, особистий герой тощо.';
			case NegotiationTrait.Justice:
				return 'NPC із мотивацією справедливості прагне бачити праведних винагородженими, а лихих покараними, хоч його уявлення про добро і зло можуть бути дуже субʼєктивними. Жрець, що вшановує бога природи, може вважати праведними всіх, хто захищає рослини й тварин, а тих, хто видобуває природні ресурси, як-от шахтарів чи лісорубів, - гідними смерті. Мотивація справедливості не обовʼязково робить NPC добрим чи милосердним.';
			case NegotiationTrait.Legacy:
				return 'NPC із мотивацією спадщини прагне слави за життя й визнання, що триватиме довго після смерті. Він сподівається, що інші знатимуть і памʼятатимуть його вчинки, великі чи жахливі. Дехто з таких NPC може навіть шукати безсмертя через обожнення чи нежиття, щоб втрата смертної оболонки не завадила й надалі творити історію.';
			case NegotiationTrait.Peace:
				return 'NPC із мотивацією миру прагне спокою у своєму житті. За звичайних обставин він хоче, щоб його залишили в спокої керувати своєю справою, фермою, королівством, злочинною імперією чи будь-яким іншим клаптиком Таймскейпу, що належить йому. Дехто з таких NPC миру не має й потребує допомоги, щоб його здобути, а інші хочуть лише зберегти свій мирний статус-кво.';
			case NegotiationTrait.Power:
				return 'NPC із мотивацією влади зазіхає на владу інших. Він прагне посилити свій вплив, яким би великим той уже не був, і зберегти своє володіння. Він може шукати силу через завоювання, збирання артефактів або надприродні ритуали - хоча навіщо обирати щось одне, коли найкращий результат дають усі три разом? Серед таких NPC трапляються тирани, що мандрують світами, але й дрібні управителі сільських організацій чи святинь можуть жадати влади не менш люто.';
			case NegotiationTrait.Protection:
				return 'NPC із мотивацією захисту має землю, людей, інформацію, предмети чи організацію, які прагне захистити понад усе. Берегти те, що йому доручено, - святий для нього обовʼязок, а допомога в цьому захисті здобуває його прихильність. Більшість людей хоче захистити друзів і родину, але NPC із цією мотивацією ставить це понад усе.';
			case NegotiationTrait.Revelry:
				return 'NPC із мотивацією розваг просто хоче добре провести час. Йому до вподоби спілкування на вечірках, пошук гострих відчуттів та інші гедоністичні заняття. Для такого NPC найважливіше - насолоджуватися життям поруч із тими, хто йому подобається.';
			case NegotiationTrait.Vengeance:
				return 'NPC із мотивацією помсти прагне скривдити того, хто завдав йому болю. Бажання помсти може відповідати заподіяній шкоді, а може вимагати повернення болю з відсотками. Іноді таку помсту можна вгамувати лише смертю ворога, але NPC може захотіти відплатити інакше: приниженням, крахом карʼєри чи іншим, менш остаточним стражданням.';
		}
	};

	static getPitfallDescription = (trait: NegotiationTrait) => {
		switch (trait) {
			case NegotiationTrait.Benevolence:
				return 'NPC із вадою милосердя цинічно дивиться на світ і вважає, що жодна істота не має права ні на що лише тому, що вона жива. Думка про те, що іншим треба допомагати просто тому, що це правильно, здається йому безглуздою, дитячою або наївною - таку ідею варто висміяти або придушити.';
			case NegotiationTrait.Discovery:
				return 'NPC із вадою пізнання не цікавиться новими місцями, народами чи ідеями. Можливо, невідоме лякає його або так сильно вибиває з рівноваги, що він воліє залишатися в невіданні. Або ж попередні пошуки відкриттів закінчилися для нього погано.';
			case NegotiationTrait.Freedom:
				return 'NPC із вадою свободи вірить, що світ без влади - це світ смути й хаосу. Він навіть може вважати, що саме він є правильною особою для правління, а його ідеали повинні стати законом землі.';
			case NegotiationTrait.Greed:
				return 'NPC, керовані жадібністю, можуть ділитися своїм багатством з обраним колом улюблених людей, як-от шляхетний лорд, що потурає кожній забаганці своїх дітей. Дехто жадібний не до грошей, а до інших ресурсів, як-от демон, що хоче збирати й пожирати душі, або троль-володар, який без кінця жадає плоті інших.';
			case NegotiationTrait.HigherAuthority:
				return 'NPC із вадою вищої влади глузує з самої ідеї служіння комусь іншому. Він може й не вірити, що всі люди мають бути вільними, але твердо переконаний, що особисто він точно не повинен нікому звітувати.';
			case NegotiationTrait.Justice:
				return 'NPC із вадою справедливості не вірить, що Таймскейп за своєю природою є справедливим місцем, і не має жодного бажання робити його таким. Світ - це вічний конфлікт, ніякої справедливості не існує, а кожен, хто думає інакше, є наївним дурнем.';
			case NegotiationTrait.Legacy:
				return 'NPC із вадою спадщини зовсім не дбає про те, щоб залишити по собі особистий слід у світі. Для нього такі марнославні думки - лише марна трата часу.';
			case NegotiationTrait.Peace:
				return 'NPC із вадою миру ненавидить нудьгу. Йому потрібні хвилювання, драма й небезпека. Для нього немає нічого гіршого за статус-кво.';
			case NegotiationTrait.Power:
				return 'NPC із вадою влади не цікавиться особистою владою. Він може поважати владу інших, але ненавидить саму думку про панування над людьми і рішуче відкидає будь-який натяк на таке.';
			case NegotiationTrait.Protection:
				return 'NPC із вадою захисту охоче залишає інших напризволяще. Він не вважає своїм обовʼязком захищати когось, крім себе, і може навіть відчувати відразу від самої думки ризикувати собою або своїм майном заради інших.';
			case NegotiationTrait.Revelry:
				return 'NPC із вадою розваг вважає світські зустрічі й гедонізм марною тратою часу. Він знаходить задоволення лише в праці або в розвитку власних навичок і характеру. Ті, хто пропонує незрілу розпусту, не варті його часу.';
			case NegotiationTrait.Vengeance:
				return 'NPC із вадою помсти вважає, що помста нічого не вирішує. Можливо, він дійшов цього висновку з власного досвіду, а можливо, просто не має амбіцій мститися - і через це зневажливо ставиться до тих, хто має такі прагнення.';
		}
	};
}
