import { AbilityKeyword } from '@/enums/ability-keyword';
import { FactoryLogic } from '@/logic/factory-logic';
import { Item } from '@/models/item';
import { ItemType } from '@/enums/item-type';
import { KitWeapon } from '@/enums/kit-weapon';

export class ArtifactData {
	static bladeOfAThousandYears: Item = FactoryLogic.createItem({
		id: 'item-blade-of-a-thousand-years',
		name: 'Клинок тисячі років',
		description: 'Цей легендарний меч має руківʼя з мерехтливого зоряного світла, з якого простягається сяйливе металеве лезо.',
		type: ItemType.Artifact,
		keywords: [AbilityKeyword.Magic, KitWeapon.Light, KitWeapon.Medium, KitWeapon.Heavy],
		effect: `
Байдуже, чи його витягли з каменя, чи подарував дух озера, чи викував бог, чи ним убили бога, існує меч поза часом і простором. Він завжди опиняється там, де потрібен, рівно тоді, коли потрібен, а щойно потреба минає, зникає в одну мить. Меч зображають у мистецтві, піснях і легендах багатьох живих культур, а ще частіше серед давно похованих культур, нерідко після того, як він вирішив долю битви. Ним володіли численні герої легенд і ще більше тих, хто щез у забутих тінях історії.

Хоча про його розмір і форму часто сперечаються, меч незмінно описують як такий, що має руківʼя з чистого зоряного світла. Коли ним володіють, із цього руківʼя виривається блискуче металеве лезо, що відповідає смаку власника щодо зброї. Кожного, хто торкається леза, сповнює наснага й сила героїв, які тримали його раніше.`,
		featuresByLevel: [
			{
				level: 1,
				features: [
					FactoryLogic.feature.create({
						id: 'item-blade-of-a-thousand-years-1',
						name: 'Створений для перемоги',
						description: 'Цей меч набуває того розміру, форми й вигляду, які володар бажає йому надати. Він може бути легкою, середньою або важкою зброєю, і ви можете змінювати його тип та вигляд безкоштовним маневром. Будь-яка збройна здібність, що завдає шкоди кидком, використовуючи Клинок тисячі років, завжди завдає священної шкоди. Будь-яка істота з вразливістю до священної шкоди, яка отримує шкоду від цієї зброї, також стає зляканою й ослабленою до кінця свого наступного ходу.'
					}),
					FactoryLogic.feature.createAbilityDamage({
						id: 'item-blade-of-a-thousand-years-1a',
						name: '',
						keywords: [AbilityKeyword.Weapon, AbilityKeyword.Melee],
						value: 5
					}),
					FactoryLogic.feature.create({
						id: 'item-blade-of-a-thousand-years-2',
						name: 'Згуртувати праведних',
						description: 'Це лезо сповнює все довкола надією і відвагою. Кожен союзник у межах 1 милі від зброї отримує перевагу на збройні та магічні здібності й має імунітет до шкоди 5. Крім того, максимум Витривалості кожної такої істоти збільшується на 15, і вона отримує бонус +15 до Витривалості, коли ця здібність уперше на неї впливає.'
					}),
					FactoryLogic.feature.create({
						id: 'item-blade-of-a-thousand-years-3',
						name: 'Переломити хід битви',
						description: 'Кожен ворожий міньйон у межах 1 милі від меча приголомшений. Будь-який ворожий лідер або одиночна істота в цій зоні отримує шкоду на кидки здібностей.'
					}),
					FactoryLogic.feature.create({
						id: 'item-blade-of-a-thousand-years-4',
						name: 'Запорука перемоги',
						description: 'Ця зброя завжди зʼявляється напередодні того, що згодом назвуть історичною битвою. Вона зникає через 24 години або коли битву виграно, залежно від того, що станеться раніше. Взявши лезо, володар мимоволі укладає з ним пакт. Якщо до зникнення меча він не здобуде перемоги попри неймовірні шанси або над великим ворогом, меч затягує його в себе, не залишаючи жодного шансу на воскресіння, і назавжди прирікає віддавати свою силу героям інших епох.'
					}),
					FactoryLogic.feature.create({
						id: 'item-blade-of-a-thousand-years-5',
						name: 'Душа мученика',
						description: 'Якщо володар помирає, тримаючи це лезо, його душу втягує в зоряне руківʼя, де вона залишається до кінця часів, не залишаючи жодного шансу на воскресіння. Меч зникає, але відчуття надії, яке він розсіює, не минає. Протягом наступної години ефекти Згуртувати праведних посилюються: вони дають подвійну перевагу на збройні та магічні здібності, імунітет до шкоди 10, збільшення максимуму Витривалості на 30 і бонус +30 до Витривалості.'
					})
				]
			}
		]
	});

	static encepter: Item = FactoryLogic.createItem({
		id: 'item-encepter',
		name: 'Енцептер',
		description: 'Оздоблений коштовностями скіпетр зі спіральним порцеляновим руківʼям підтримує над своєю короною сферу світла.',
		type: ItemType.Artifact,
		keywords: [AbilityKeyword.Magic],
		effect: `
Цей скіпетр чекає високо в небі, спочиваючи в осерді нескінченно лютого циклону. Він чекає на того, хто обʼєднає всіх людей під його світлом. Він чекає на свого чемпіона.

Кажуть, Енцептер уперше зʼявився в юному світі, приреченому на апокаліпсис, якщо лише кожен мешканець того світу не стане пліч-о-пліч. Кажуть, скіпетр несе або владу, або знищення над будь-якою загрозою, яку оточує його світло. Сьогодні його найчастіше вважають лихою ознакою, і якщо Енцептер являє себе, люди знають: світ балансує на межі знищення. Чи правдиві ці історії, сказати важко, адже єдині живі очі, що бачили Енцептер, належать драконам у глибокому сні.`,
		featuresByLevel: [
			{
				level: 1,
				features: [
					FactoryLogic.feature.create({
						id: 'item-encepter-1',
						name: 'Сяйна присутність',
						description: 'Той, хто володіє Енцептером, завжди оповитий яскравим сяйвом. Будь-який кидок сили, який володар робить із Присутністю, автоматично отримує результат 3-го рівня, хоча володар усе ще може кидати, намагаючись здобути критичний успіх або критичне влучання.'
					}),
					FactoryLogic.feature.create({
						id: 'item-encepter-2',
						name: 'Ласо чемпіона',
						description: 'Безкоштовним маневром володар скіпетра може провести сяйну лінію світла, що повторює його шлях під час руху, або прибрати цю сяйну лінію. Якщо володар перетинає цю лінію, кожна істота й обʼєкт за вибором володаря, замкнені всередині лінії та в межах 2 клітинок над нею або під нею, вважаються впійманими ласо Енцептера. Істоти залишаються впійманими, доки ласо не буде відпущене або доки не буде проведено нову лінію.'
					}),
					FactoryLogic.feature.create({
						id: 'item-encepter-3',
						name: 'Панування',
						description: 'Кожна істота, впіймана ласо Енцептера, є скутою і не може телепортуватися. Істота, захоплена в повітрі ласо, залишається на місці замість того, щоб упасти.'
					}),
					FactoryLogic.feature.create({
						id: 'item-encepter-4',
						name: 'Знищення',
						description: 'Основною дією володар підносить Енцептер до неба. Кожна ціль, впіймана ласо Енцептера, вибухає призматичним сплеском світла, отримуючи 10 психічної шкоди за кожну клітинку, горизонтально охоплену ласо. Після цього ласо негайно відпускається.'
					}),
					FactoryLogic.feature.create({
						id: 'item-encepter-5',
						name: 'На краю світу',
						description: 'Якщо Енцептер забрали з його циклонічного місця спочинку не з метою подолати жахливу небезпеку, то протягом 3 днів після того, як скіпетр буде взято, зʼявиться жахлива загроза світові.'
					})
				]
			}
		]
	});

	static mortalCoil: Item = FactoryLogic.createItem({
		id: 'item-mortal-coil',
		name: 'Смертний виток',
		description: 'Ця ширяюча спіраль із золотого металу обертається дедалі швидше, щойно активується, потріскуючи багряними іскрами.',
		type: ItemType.Artifact,
		keywords: [AbilityKeyword.Psionic],
		effect: `
Зміна є рушієм буття. Сталість породжує застій. Коли минуле відмовляється поступитися владою, майбутньому слід прокласти шлях. Живлений мерехтінням розумів і душ, що проходять крізь порожнечу, Смертний виток звертається до ентропійного потенціалу, притаманного кожній живій істоті, щоби відкинути тінь, здатну скинути навіть богів. Адже справжній дар життя - це смерть, а дари призначені для того, щоб їх дарували.

Лише той, кому судилася смерть, може вмістити силу Смертного витка. Смертна істота, що носить цей артефакт, стає його носієм, отримує додаткову основну дію на кожному своєму ході, старіє вдесятеро швидше за звичне й більше не може відновлювати Витривалість. Носій без природної межі життя щороку назавжди зменшує свій максимум Витривалості на 10.

Коли Смертний виток лишається без нагляду або перебуває у володінні істоти, яка не є смертною, він активується і не може бути деактивований, доки смертна істота знову не стане його носієм. Поки активний, артефакт простягає півтінь впливу на 10 миль у кожному напрямку. Кожна істота в цій півтіні підпадає під наведені нижче ефекти.`,
		featuresByLevel: [
			{
				level: 1,
				features: [
					FactoryLogic.feature.create({
						id: 'item-mortal-coil-1',
						name: 'Однією ногою в могилі',
						description: 'Кожна істота в півтіні має вразливість до шкоди 2 і не може відновлювати Витривалість.'
					}),
					FactoryLogic.feature.create({
						id: 'item-mortal-coil-2',
						name: 'Пора вмирати',
						description: 'Кожна істота в півтіні старіє в 10 разів швидше за звичне, а хвороби й отрути, що впливають на істот у півтіні, минають у 10 разів швидше за звичайне. Істота без природної межі життя щороку назавжди зменшує свій максимум Витривалості на 10. Кожна істота може виконувати на одну додаткову дію перепочинку під час кожного перепочинку.'
					}),
					FactoryLogic.feature.create({
						id: 'item-mortal-coil-3',
						name: 'Якщо зустрінеш бога на шляху, вбий його',
						description: 'Кожна несмертна сутність у півтіні отримує дар смертності. Раніше безсмертних або невразливих сутностей, від планарних істот до самих богів, можна вбити, перебуваючи в півтіні, хоч і не обовʼязково легко. Будь-яка істота або сутність, що помирає в півтіні Смертного витка, зазнає досконалої смерті. Вона мертва назавжди, безповоротно, і жодна магія, псіоніка чи технологія не можуть повернути її до життя.'
					}),
					FactoryLogic.feature.create({
						id: 'item-mortal-coil-4',
						name: 'Вічний рух',
						description: 'Якщо в півтіні Смертного витка колись не залишиться жодної істоти чи сутності, радіус півтіні подвоюється.'
					}),
					FactoryLogic.feature.create({
						id: 'item-mortal-coil-5',
						name: 'Негідний зневаги',
						description: 'Божества та їхні слуги завжди не помічають Смертний виток і його носія, або не здатні його побачити, або не вважають його загрозою. Якщо артефакт якимось чином знищено чи розвіяно божественною силою, він забирає по року життя в кожного гуманоїда в маніфолді, де його знищили, а потім переформовується у схованому місці.'
					})
				]
			}
		]
	});
}
