import { AbilityDistanceType } from '@/enums/ability-distance-type';
import { AbilityKeyword } from '@/enums/ability-keyword';
import { Characteristic } from '@/enums/characteristic';
import { FactoryLogic } from '@/logic/factory-logic';
import { FeatureField } from '@/enums/feature-field';
import { FollowerType } from '@/enums/follower-type';
import { HeroClass } from '@/models/class';
import { KitArmor } from '@/enums/kit-armor';
import { KitWeapon } from '@/enums/kit-weapon';
import { PerkList } from '@/enums/perk-list';
import { SkillList } from '@/enums/skill-list';
import { circleOfBlight } from '@/data/classes/summoner/blight';
import { circleOfGraves } from '@/data/classes/summoner/graves';
import { circleOfSpring } from '@/data/classes/summoner/spring';
import { circleofStorms } from '@/data/classes/summoner/storms';

export const summoner: HeroClass = {
	id: 'class-summoner',
	name: 'Призивач',
	description: `
Ви і є армада. Королі минулого віддали б цілі армії за ваші здібності. Ви опанували традицію, що викликає невичерпний запас воїнів. Ви - призивач, маг, який бере свої мрії й робить їх явними.

Ви призиваєте міньйонів, щоб вони безстрашно йшли в гущу бою й надавали підтримку, стримуючи ворога, поки ви та ваші товариші-герої готуєте контрнаступ. Ваші міньйони служать без вагань, без промаху, до своєї смерті або до вашої.

Ви також можете скористатися могутньою магією, щоб посилювати союзників, виснажувати ворогів або поповнювати свої ряди полеглими. А коли справа доходить до крайнощів, ви можете покликати свого чемпіона, щоб завершити бій.`,
	type: 'master',
	subclassName: 'Коло',
	subclassCount: 1,
	primaryCharacteristicsOptions: [
		[Characteristic.Reason]
	],
	primaryCharacteristics: [],
	featuresByLevel: [
		{
			level: 1,
			features: [
				FactoryLogic.feature.createBonus({
					id: 'summoner-stamina',
					field: FeatureField.Stamina,
					value: 15,
					valuePerLevel: 6
				}),
				FactoryLogic.feature.createBonus({
					id: 'summoner-recoveries',
					field: FeatureField.Recoveries,
					value: 8
				}),
				FactoryLogic.feature.createHeroicResource({
					id: 'summoner-resource',
					name: 'Есенція',
					gains: [
						{
							tag: 'start',
							trigger: 'На початку вашого ходу',
							value: '2'
						},
						{
							tag: 'minion-death',
							trigger: 'Вперше за раунд, коли будь-який міньйон гине не з власної волі в межах дальності призивача',
							value: '1'
						}
					],
					details: 'Щоразу, коли ви використовуєте героїчну здібність або призиваєте міньйона, що коштує Есенції, ви можете добровільно пожертвувати одним чи кількома міньйонами в межах дальності призивача, щоб зменшити вартість на 1. Ви не можете вбивати міньйонів у такий спосіб, якщо вони цього ходу вже використали основну дію або маневр. Ви можете пожертвувати більше міньйонів, ніж потрібно для зменшення вартості.'
				}),
				FactoryLogic.feature.createSkillChoice({
					id: 'summoner-1-1',
					count: 2,
					selected: ['Магія', 'Стратегія']
				}),
				FactoryLogic.feature.createSkillChoice({
					id: 'summoner-1-1c',
					listOptions: [SkillList.Intrigue, SkillList.Lore],
					count: 2
				}),
				FactoryLogic.feature.createPackage({
					id: 'summoner-1-2',
					name: 'Міньйони',
					description: `
Істоти, якими ви керуєте, називаються **міньйонами**. Ви можете призвати й підтримувати максимум 8 міньйонів. Ваші міньйони вважаються союзниками вашого рівня.

Ви можете керувати максимум двома **загонами** міньйонів. Щойно призваних міньйонів можна або оформити в новий загін, або розподілити до інших загонів під вашим контролем. Загін не може містити більше восьми міньйонів, і всі міньйони в загоні повинні мати однакову назву.

Максимальна відстань, на якій ви можете призивати міньйонів і використовувати певні здібності призову, називається **дальністю призивача**. Вона дорівнює 5 + ваш показник Розуму. Ви мусите мати лінію ефекту, щоб призивати міньйонів і віддавати накази міньйонам у межах дальності призивача. Наказ міньйону виконати основну дію або маневр, поки ви приховані, розкриває вас.

Також у вашому розпорядженні є особливі міньйони, що називаються **сигнатурними міньйонами** - недорогі істоти, яких ви звикли призивати найчастіше.

### Міньйони в бою

**Початок бою**: На початку бойової зустрічі або іншої напруженої ситуації, що відстежується бойовими раундами (на розсуд Режисера), ви можете безкоштовно призвати до двох своїх сигнатурних міньйонів у незайняті простори в межах дальності призивача (без дії).

**Початок ходу**: На початку кожного свого ходу під час бою ви можете безкоштовно призвати до трьох своїх сигнатурних міньйонів у незайняті простори в межах дальності призивача (без дії).

**Призов**: Кожен міньйон призивається на землю, якщо тільки він не вміє літати або зависати. Якщо здібність не вказує інакше, ви не можете призивати нових міньйонів понад свій максимум, доки така сама кількість наявних міньйонів не буде відпущена або знищена.

**Витривалість**: Міньйони в загоні обʼєднують свою Витривалість в один пул. Щоразу, коли міньйон у загоні отримує шкоду, пул Витривалості загону зменшується на таку саму величину. Кожного разу, коли пул зменшується на кількість, рівну Витривалості одного члена загону, один міньйон гине (спершу той, хто отримав шкоду, а потім найближчий наступний). Якщо після загибелі всіх міньйонів у загоні залишається надлишкова шкода, ви отримуєте шкоду, рівну 2 + ваш рівень. Міньйони не можуть стати захеканими, не можуть відновлювати Витривалість і не можуть отримувати тимчасову Витривалість.

**Ефекти по зоні**: Шкода від ефекту по зоні, завдана пулу Витривалості загону, може вбити не більше міньйонів, ніж перебувало в цій зоні. Будь-яка надлишкова шкода ігнорується.

**Удари з кількома цілями**: Пул Витривалості загону отримує лише найбільший окремий примірник шкоди від удару, що націлюється на двох або більше міньйонів цього загону. Усі додаткові ефекти все одно впливають на міньйонів, по яких було націлено удар.

**Стани**: Ви виконуєте будь-які рятівні кидки проти станів, що впливають на одного чи більше ваших міньйонів. Вважайте, що маєте по одному примірнику кожного стану.

**Імунітет і вразливість**: Якщо будь-який міньйон у загоні має імунітет до певного типу шкоди або вразливість до нього, застосовуйте цей ефект до всього загону лише один раз, незалежно від того, скільки міньйонів мають цю рису.

**Дії**: Міньйони в загоні діють разом у ваш хід у будь-якому порядку - до, між або після ваших дій. Вони можуть або виконати дію руху й основну дію (крім «Лікування» та «Оборони»), або дію руху й маневр, або дві дії руху. Окремі міньйони також можуть робити атаки можливості.

**Вільні удари**: Якщо не вказано інакше, вільний удар міньйона має дальність Ближня 1 або Дальня 5 і завдає значення шкоди, вказане в блоці характеристик. Міньйон може обрати безтипну шкоду або тип шкоди, зазначений поруч зі значенням шкоди.

**Шкода**: Коли кілька міньйонів одночасно бʼють одну й ту саму ціль, шкода додається й розглядається як один удар. Якщо міньйони в загоні націлюють сигнатурну здібність на ту саму ціль, сигнатурна здібність застосовується лише один раз, а кожен додатковий міньйон збільшує шкоду на число, рівне значенню його вільного удару.

**Сплески**: Ваші міньйони користуються вашим пулом сплесків і можуть застосовувати їх до своїх ударів. Щоразу, коли один або більше ваших міньйонів мали б отримати сплеск протягом ходу, натомість цей сплеск отримуєте ви.

**Маневри**: Якщо не вказано інакше в блоці характеристик міньйонів, загін виконує свій маневр разом як єдине ціле. Якщо маневр націлюється на одну істоту, усі міньйони загону націлюються на ту саму істоту. Якщо маневр потребує кидка сили, результат дорівнює 8 + характеристика міньйонів + кількість членів загону в межах дальності маневру.

**Індивідуальні маневри**: Окремий міньйон може використати маневр, щоб полегшити власне становище, наприклад підвестися, якщо лежить, або втекти з захвату. Якщо він так робить, то не може брати участі в основній дії або маневрі свого загону.

**Характеристики**: Ваші міньйони мають власні характеристики для опору потужностям, маневрам і для виконання тестів. Ви використовуєте власні характеристики там, де блок характеристик міньйона посилається на Р або використовує потужність (наприклад, С < [слабкий]).

**Непритомність**: Якщо ви непритомні або не можете діяти у свій хід, ви не можете призивати нових міньйонів. Крім того, ваші міньйони, що залишилися, не можуть завдавати шкоди; вони можуть діяти лише для того, щоб відвести вас у безпеку.

**Кінець бою**: Наприкінці бою ваші міньйони завершують свої завдання (наприклад, несуть когось у безпечне місце), а потім відпускаються.

### Міньйони поза боєм

Поза боєм ви можете мати до 4 призваних міньйонів, не витрачаючи Есенцію. Ви можете вільно призивати таким чином своїх сигнатурних міньйонів. Для інших міньйонів: якщо у вас є кількість Перемог, не менша за вартість міньйона в Есенції, ви можете призвати до вказаної в його блоці характеристик кількості міньйонів.

Кожному з ваших міньйонів можна дати просте завдання і пункт призначення, який ви вже відвідували, і вони виконають це настільки добре, наскільки зможуть. Приклади таких завдань: доставка повідомлень, розвідка й перенесення припасів. Ваші міньйони не є послідовниками й не можуть робити кидки проєктів, доки ви не навчитеся призивати спеціалістів.

Коли починається бій, усі ваші міньйони, яких було призвано поза боєм, завершують свої завдання, а потім відпускаються.`,
					tag: 'minions'
				}),
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'summoner-1-3',
						name: 'Удар призивача',
						description: 'Раптовий сплеск енергії зривається з вашого імплемента й вражає нерви ворогів.',
						type: FactoryLogic.type.createMain({ qualifiers: ['можна використовувати як вільний удар'], freeStrike: true }),
						keywords: [AbilityKeyword.Magic, AbilityKeyword.Melee, AbilityKeyword.Ranged, AbilityKeyword.Strike],
						distance: [
							FactoryLogic.distance.createMelee(),
							FactoryLogic.distance.createRanged(5)
						],
						target: 'Одна істота або предмет',
						sections: [
							FactoryLogic.createAbilitySectionText('Р шкоди. Якщо ціль має Р < [слабкий], вона уповільнена (рят. кидок закінчує).'),
							FactoryLogic.createAbilitySectionField({
								name: 'Особливе',
								effect: 'Ця здібність має ключове слово «Ривок», коли використовується як ближній удар.'
							}),
							FactoryLogic.createAbilitySectionPackage('summoner-strike')
						]
					})
				}),
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'summoner-1-4',
						name: 'Бий за мене',
						description: 'Ваші міньйони б’ються замість вас.',
						type: FactoryLogic.type.createTrigger('Ви використовуєте тригерну дію, щоб завдати вільного удару або використати сигнатурну здібність.', { free: true }),
						keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged],
						distance: [FactoryLogic.distance.createSummoner()],
						target: 'Кожен ваш міньйон',
						sections: [
							FactoryLogic.createAbilitySectionRoll(
								FactoryLogic.createPowerRoll({
									characteristic: Characteristic.Reason,
									tier1: 'До трьох цілей кожна здійснює безкоштовний удар',
									tier2: 'До пʼяти цілей кожна здійснює безкоштовний удар',
									tier3: 'До семи цілей кожна здійснює безкоштовний удар'
								})
							),
							FactoryLogic.createAbilitySectionField({
								name: 'Особливе',
								effect: 'При натуральних 19 або 20 кожна ціль завдає вільного удару.'
							}),
							FactoryLogic.createAbilitySectionText('Ваші міньйони діють замість того, щоб ви завдавали вільного удару або використовували сигнатурну здібність. Якщо тригерна дія була надана вам проти конкретної цілі, ваші міньйони мусять бити ту саму ціль. Якщо тригерна дія надала вам сигнатурну здібність, ви отримуєте перевагу на кидок сили.')
						]
					})
				}),
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'summoner-1-5',
						name: 'Поклич',
						description: 'Моя сила - твоя, а твоя - моя. Закликаю тебе.',
						type: FactoryLogic.type.createMain(),
						keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged],
						distance: [FactoryLogic.distance.createSummoner()],
						target: 'Себе',
						cost: 1,
						repeatable: true,
						sections: [
							FactoryLogic.createAbilitySectionText('Ви призиваєте одного чи кількох міньйонів зі свого портфеля в незайняті простори в межах дальності. Виберіть один із наступних варіантів.'),
							FactoryLogic.createAbilitySectionField({
								name: 'Сигнатурні міньйони',
								effect: 'Ви призиваєте одного сигнатурного міньйона за кожну Есенцію, витрачену на цю здібність.'
							}),
							FactoryLogic.createAbilitySectionField({
								name: 'Усі інші міньйони',
								effect: 'Ви призиваєте вказану в блоці характеристик кількість міньйонів за їхню вартість в Есенції.'
							})
						]
					})
				}),
				FactoryLogic.feature.createAbility({
					ability: FactoryLogic.createAbility({
						id: 'summoner-1-6',
						name: 'Міст із міньйонів',
						description: 'Ваші міньйони роблять усе можливе, щоб утворити для вас безпечний шлях.',
						type: FactoryLogic.type.createManeuver(),
						keywords: [AbilityKeyword.Magic],
						distance: [FactoryLogic.distance.createMelee()],
						target: 'Один ваш міньйон',
						sections: [
							FactoryLogic.createAbilitySectionText(`
Ви зміщуєтеся в клітинку поруч із ціллю, включно по вертикалі.

Ви можете зміщуватися в клітинки, які містять одного з ваших міньйонів, навіть якщо це складна місцевість. Щоразу, коли під час цього маневру ви зміщуєтеся в клітинку, що містить одного з ваших міньйонів, ви можете зміститися ще на одну додаткову клітинку.`),
							FactoryLogic.createAbilitySectionSpend({
								effect: 'Суміжний союзник може зміщуватися разом із вами під час цього переміщення. Він мусить завершити рух у незайнятій клітинці поруч з останнім міньйоном, крізь якого ви пройшли.'
							})
						]
					})
				}),
				FactoryLogic.feature.createChoice({
					id: 'summoner-1-7',
					name: 'Формація',
					description: 'Ви відпрацювали особливу формацію для своїх міньйонів.',
					options: [
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-1-7a',
								name: 'Ордна формація',
								description: 'Ваш максимум міньйонів збільшується на 4, а на початку кожного свого ходу ви призиваєте до чотирьох сигнатурних міньйонів замість трьох.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-1-7b',
								name: 'Взводна формація',
								description: 'Щоразу, коли один із ваших загонів використовує здібність, що завдає шкоди, оберіть одну ціль цієї здібності, щоб вона отримала додаткову шкоду, рівну вашому показнику Розуму.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-1-7c',
								name: 'Елітна формація',
								description: 'Кожен ваш міньйон отримує +3 до Витривалості та +1 до Стійкості.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createMultiple({
								id: 'summoner-1-7d',
								features: [
									FactoryLogic.feature.create({
										id: 'summoner-1-7da',
										name: 'Формація ватажка',
										description: 'На вас не впливає надлишкова шкода після загибелі всіх міньйонів у загоні. Якщо ваш міньйон перебуває в межах дальності призивача, коли отримує шкоду, ви можете обрати отримати цю шкоду замість нього.'
									}),
									FactoryLogic.feature.createProficiency({
										id: 'summoner-1-7db',
										weapons: [KitWeapon.Light],
										armor: [KitArmor.Light]
									})
								]
							}),
							value: 1
						}
					]
				}),
				FactoryLogic.feature.createChoice({
					id: 'summoner-1-8',
					name: 'Тактичний наказ',
					description: 'У вас є особливий наказ, який ви можете віддати своїм міньйонам.',
					options: [
						{
							feature: FactoryLogic.feature.createAbility({
								ability: FactoryLogic.createAbility({
									id: 'summoner-1-8a',
									name: 'Зосередьте вогонь!',
									description: 'Ви дбаєте, щоб ворог не вислизнув від атаки, що насувається.',
									type: FactoryLogic.type.createTrigger('Ціль завдає шкоди іншій істоті.'),
									distance: [FactoryLogic.distance.createSummoner()],
									target: 'На себе або одного союзника',
									sections: [
										FactoryLogic.createAbilitySectionText('Ціль отримує по 1 сплеску за кожного вашого міньйона поруч із нею (максимум 3 сплески), які вона може витратити на тригерну шкоду.'),
										FactoryLogic.createAbilitySectionSpend({
											effect: 'Якщо тригерна шкода завдається здібністю з кидком сили, цей кидок сили отримує перевагу.'
										})
									]
								})
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createAbility({
								ability: FactoryLogic.createAbility({
									id: 'summoner-1-8b',
									name: 'Перешкодь!',
									description: 'Ви наказуєте міньйону стати на заваді.',
									type: FactoryLogic.type.createTrigger('Ціль починає свій хід, рухається або її примусово переміщують.'),
									distance: [FactoryLogic.distance.createSummoner()],
									target: 'Одна істота',
									sections: [
										FactoryLogic.createAbilitySectionText('Ви призиваєте сигнатурного міньйона в незайнятий простір поруч із ціллю. Якщо ціль примусово переміщують у міньйона, ви можете обрати, щоб ціль не отримала шкоди від зіткнення.'),
										FactoryLogic.createAbilitySectionField({
											name: 'Особливе',
											effect: 'Замість призову нового міньйона ви можете наказати одному зі своїх міньйонів у межах дальності зміститися на свою швидкість у бік клітинки поруч із ціллю до того, як відбудуться будь-які додаткові ефекти.'
										})
									]
								})
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createAbility({
								ability: FactoryLogic.createAbility({
									id: 'summoner-1-8c',
									name: 'Ще не час!',
									description: 'Я наказую тобі не помирати.',
									type: FactoryLogic.type.createTrigger('Ціль отримує достатньо шкоди, щоб померти або бути знищеною.'),
									distance: [FactoryLogic.distance.createSummoner()],
									target: 'Один союзник',
									sections: [
										FactoryLogic.createAbilitySectionField({
											name: 'Особливе',
											effect: 'Якщо ціль є міньйоном, він має бути єдиним міньйоном, що залишився в своєму загоні.'
										}),
										FactoryLogic.createAbilitySectionText('Шкода, яку отримує ціль, зменшується настільки, щоб залишити її живою з 1 пунктом Витривалості.')
									]
								})
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createAbility({
								ability: FactoryLogic.createAbility({
									id: 'summoner-1-8d',
									name: 'Прийми удар!',
									description: 'Ви кличете міньйона використати своє тіло, щоб послабити удар.',
									type: FactoryLogic.type.createTrigger('Ціль стає ціллю удару.'),
									distance: [FactoryLogic.distance.createSummoner()],
									target: 'На себе або одного союзника',
									sections: [
										FactoryLogic.createAbilitySectionText('Якщо один із ваших міньйонів суміжний із ціллю та перебуває в межах дальності удару, він стає новою ціллю цього удару.'),
										FactoryLogic.createAbilitySectionSpend({
											effect: 'Замість того щоб наказувати наявному міньйону, ви призиваєте сигнатурного міньйона в незайнятий простір поруч із ціллю, щоб він прийняв удар.'
										})
									]
								})
							}),
							value: 1
						}
					]
				}),
				FactoryLogic.feature.createClassAbilityChoice({
					id: 'summoner-1-9',
					cost: 5
				})
			]
		},
		{
			level: 2,
			features: [
				FactoryLogic.feature.createPerk({
					id: 'summoner-2-1',
					name: 'Перк',
					lists: [PerkList.Intrigue, PerkList.Lore, PerkList.Supernatural]
				}),
				FactoryLogic.feature.create({
					id: 'summoner-2-2',
					name: 'Панування',
					description: `
Раз за зустріч ви можете використати маневр, щоб призвати прояв із рідного маніфолду чи місця походження ваших міньйонів у незайнятий простір на землі в межах дальності призивача. Ви можете витратити 1 Есенцію, щоб перемістити цей прояв як безкоштовний маневр у свій хід. Прояв лишається до кінця зустрічі, доки його Витривалість не зведуть до 0 або доки ви не почнете вмирати.

Ваш прояв отримує додаткові риси на 5-му й 9-му рівнях.`
				})
			]
		},
		{
			level: 3,
			features: [
				FactoryLogic.feature.createPackageContent({
					id: 'summoner-3-1',
					name: 'Комплект призивача',
					description: `
Ви чаклунством створюєте собі комплект. Цей комплект містить імплемент, наприклад жезл або батон, і надає вам такі переваги:

* Шкода вашої здібності «Удар призивача» збільшується до подвоєного показника вашого Розуму.
* Потужність вашої здібності «Удар призивача» зростає до Р < [середній].
* Дальність вашої здібності «Удар призивача» тепер дорівнює дальності призивача.`,
					tag: 'summoner-strike'
				}),
				FactoryLogic.feature.createChoice({
					id: 'summoner-3-2',
					name: 'Оберіг',
					options: [
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2a',
								name: 'Призваний оберіг',
								description: 'Вас вкривають природні захисти вашого портфеля (кістки, фейське дерево, камінь, звивиста плоть). Ви отримуєте +3 до Витривалості, і цей бонус зростає ще на 3 на 4-му, 7-му та 10-му рівнях.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2b',
								name: 'Надзвичайний оберіг',
								description: 'Вперше за раунд, коли ви отримуєте шкоду, ви можете після завершення тригерного ефекту використати безкоштовну тригерну дію, щоб зміститися на 1 клітинку й призвати сигнатурного міньйона в клітинку, яку ви щойно покинули (якщо там достатньо місця).'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2c',
								name: 'Виючий оберіг',
								description: 'Коли ви вступаєте в бій, навколо вас виникає аура 1 із ріжучої магії. Ворог, який починає свій хід поруч із вами, отримує шкоду, рівну вашому Розуму.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2d',
								name: 'Ловчий оберіг',
								description: 'Щоразу, коли суміжна істота завдає вам шкоди, ви можете використати безкоштовну тригерну дію, щоб притягнути цю істоту до одного зі своїх міньйонів у межах дальності призивача на кількість клітинок, рівну вашому показнику Розуму.'
							}),
							value: 1
						}
					]
				}),
				FactoryLogic.feature.createClassAbilityChoice({
					id: 'summoner-3-3',
					cost: 7
				})
			]
		},
		{
			level: 4,
			features: [
				FactoryLogic.feature.createCharacteristicBonus({
					id: 'summoner-4-1',
					characteristic: Characteristic.Reason,
					value: 1
				}),
				FactoryLogic.feature.createChoice({
					id: 'summoner-4-2',
					options: [
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-4-2a',
								characteristic: Characteristic.Might,
								value: 1
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-4-2b',
								characteristic: Characteristic.Agility,
								value: 1
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-4-2c',
								characteristic: Characteristic.Intuition,
								value: 1
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-4-2d',
								characteristic: Characteristic.Presence,
								value: 1
							}),
							value: 1
						}
					]
				}),
				FactoryLogic.feature.createPackageContent({
					id: 'summoner-4-3',
					name: 'Покращення міньйонів',
					description: `
Ваш максимум міньйонів збільшується на 4.

Ви можете підвищити Витривалість кожного свого міньйона, як показано в таблиці. Крім того, кожен міньйон, що отримує приріст Витривалості, може вважати свої характеристики на 1 вищими для опору потужностям (до максимуму 3).

| Міньйон            | Приріст Витривалості |
|:===================|:=====================|
| Сигнатурний міньйон | Витривалість +1      |
| 3-есенційний міньйон | Витривалість +3      |
| 5-есенційний міньйон | Витривалість +2      |`,
					tag: 'minions'
				}),
				FactoryLogic.feature.create({
					id: 'summoner-4-4',
					name: 'Повернення Есенції',
					description: 'Вперше за бойовий раунд, коли будь-який міньйон гине не з власної волі в межах дальності призивача, ви отримуєте 2 Есенції замість 1.'
				}),
				FactoryLogic.feature.create({
					id: 'summoner-4-5',
					name: 'Ланцюг міньйонів',
					description: `
Щоразу, коли ви використовуєте «Міст із міньйонів» як маневр, кожен ваш міньйон у межах дальності призивача може зміститися на свою швидкість до того, як маневр подіє, за умови, що кожен міньйон, який зміщується, завершує рух поруч з іншим вашим міньйоном.

Крім того, ваші міньйони можуть зчіплюватися між собою, щоб слугувати драбиною або розгойданою мотузкою. Коли ваші міньйони рухаються як частина використання «Мосту з міньйонів», кожен із них може використати цей рух, щоб зміститися в позицію безпосередньо під іншим вашим міньйоном, підіймаючи його та кожного міньйона, якого той тримає, доки вони не утворять ланцюг. Потім ланцюг може впасти через незайнятий простір та/або верхній міньйон може вхопитися за предмет, щоб утримувати ланцюг стійким.

Ланцюг триває до початку вашого наступного ходу або доки перестає бути стійким. Він також може закінчитися, коли міньйон у ланцюгу знищений або коли ви накажете міньйонам розчепитися як безкоштовний маневр. Усі міньйони розміру 1 вважаються однією клітинкою при визначенні довжини ланцюга.`
				}),
				FactoryLogic.feature.createPerk({
					id: 'summoner-4-6'
				}),
				FactoryLogic.feature.createSkillChoice({
					id: 'summoner-4-7'
				})
			]
		},
		{
			level: 5,
			features: []
		},
		{
			level: 6,
			features: [
				FactoryLogic.feature.createPerk({
					id: 'summoner-6-1',
					name: 'Перк',
					lists: [PerkList.Intrigue, PerkList.Lore, PerkList.Supernatural]
				}),
				FactoryLogic.feature.create({
					id: 'summoner-6-2',
					name: 'Повернення до джерела',
					description: `
Ви можете перенести себе й союзників у простір, звідки походять ваші міньйони, ніби виконуєте призов навпаки.

Коли ви починаєте відпочинок, то телепортуєтеся до маніфолду-джерела або місця походження свого кола, як показано в таблиці. Ви можете взяти з собою будь-яких союзників, щоб збирати ресурси або досліджувати відомості про мешканців цього місця. Вас там сприймають як місцевого, але ваших союзників можуть вважати чужинцями.

| Коло      | Маніфолд або місце походження                             |
|:==========|:==========================================================|
| Скверни   | Абісальна пустка                                          |
| Могил     | Некропольні руїни (розташовані в Абісальній пустці)       |
| Весни     | Аркадія                                                   |
| Бур       | Квінтесенція                                              |`
				}),
				FactoryLogic.feature.createMultiple({
					id: 'summoner-6-3',
					features: [
						FactoryLogic.feature.createPackageContent({
							id: 'summoner-6-3a',
							name: 'Міньйонські махінації',
							description: 'Ваш максимальний розмір загону послідовників збільшується на 2.',
							tag: 'minions'
						}),
						FactoryLogic.feature.createFollower({
							id: 'summoner-6-3b',
							follower: FactoryLogic.createFollower(FollowerType.Artisan)
						}),
						FactoryLogic.feature.createFollower({
							id: 'summoner-6-3c',
							follower: FactoryLogic.createFollower(FollowerType.Sage)
						})
					]
				}),
				FactoryLogic.feature.createChoice({
					id: 'summoner-6-4a',
					name: 'Покращення комплекту',
					description: 'Ви можете обрати ще один додатковий оберіг зі свого комплекту призивача.',
					options: [
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2a',
								name: 'Призваний оберіг',
								description: 'Вас вкривають природні захисти вашого портфеля (кістки, фейське дерево, камінь, звивиста плоть). Ви отримуєте +3 до Витривалості, і цей бонус зростає ще на 3 на 4-му, 7-му та 10-му рівнях.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2b',
								name: 'Надзвичайний оберіг',
								description: 'Вперше за раунд, коли ви отримуєте шкоду, ви можете після завершення тригерного ефекту використати безкоштовну тригерну дію, щоб зміститися на 1 клітинку й призвати сигнатурного міньйона в клітинку, яку ви щойно покинули (якщо там достатньо місця).'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2c',
								name: 'Виючий оберіг',
								description: 'Коли ви вступаєте в бій, навколо вас виникає аура 1 із ріжучої магії. Ворог, який починає свій хід поруч із вами, отримує шкоду, рівну вашому Розуму.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2d',
								name: 'Ловчий оберіг',
								description: 'Щоразу, коли суміжна істота завдає вам шкоди, ви можете використати безкоштовну тригерну дію, щоб притягнути цю істоту до одного зі своїх міньйонів у межах дальності призивача на кількість клітинок, рівну вашому показнику Розуму.'
							}),
							value: 1
						}
					]
				}),
				FactoryLogic.feature.createPackageContent({
					id: 'summoner-6-4b',
					name: 'Покращення комплекту',
					description: 'Щоразу, коли ви зводите ворога до 0 Витривалості своєю здібністю «Удар призивача», ви можете використати «Поклич» як безкоштовний маневр. Призвані таким чином міньйони не можуть діяти цього ходу.',
					tag: 'summoner-strike'
				}),
				FactoryLogic.feature.createClassAbilityChoice({
					id: 'summoner-6-5',
					cost: 9
				})
			]
		},
		{
			level: 7,
			features: [
				FactoryLogic.feature.createCharacteristicBonus({
					id: 'summoner-7-1a',
					characteristic: Characteristic.Might,
					value: 1
				}),
				FactoryLogic.feature.createCharacteristicBonus({
					id: 'summoner-7-1b',
					characteristic: Characteristic.Agility,
					value: 1
				}),
				FactoryLogic.feature.createCharacteristicBonus({
					id: 'summoner-7-1c',
					characteristic: Characteristic.Reason,
					value: 1
				}),
				FactoryLogic.feature.createCharacteristicBonus({
					id: 'summoner-7-1d',
					characteristic: Characteristic.Intuition,
					value: 1
				}),
				FactoryLogic.feature.createCharacteristicBonus({
					id: 'summoner-7-1e',
					characteristic: Characteristic.Presence,
					value: 1
				}),
				FactoryLogic.feature.createPackageContent({
					id: 'summoner-7-2',
					name: 'Покращення міньйонів',
					description: `
На початку кожного свого ходу під час бою ви можете безкоштовно призвати ще одного додаткового сигнатурного міньйона в незайнятий простір у межах дальності призивача (без дії).

Крім того, ви можете підвищити Витривалість кожного свого міньйона, як показано в таблиці приросту Витривалості міньйонів 7-го рівня. Також кожен міньйон, який отримує приріст Витривалості, може вважати свої характеристики на 1 вищими для опору потужностям (до максимуму 4).

| Міньйон             | Приріст Витривалості                |
|:====================|:====================================|
| Сигнатурний міньйон | Витривалість +1 (разом +2)          |
| 3-есенційний міньйон | Витривалість +3 (разом +6)          |
| 5-есенційний міньйон | Витривалість +2 (разом +4)          |
| 7-есенційний міньйон | Витривалість +5                     |`,
					tag: 'minions'
				}),
				FactoryLogic.feature.createHeroicResourceGain({
					id: 'summoner-7-3',
					name: 'Джерело творення',
					tag: 'start 2',
					trigger: 'На початку вашого ходу',
					value: '3',
					replacesTags: ['start']
				}),
				FactoryLogic.feature.create({
					id: 'summoner-7-4',
					name: 'Їхнє життя за моє',
					description: `
Якщо ви або союзник у межах дальності призивача мали б померти від ефекту, не повʼязаного зі старістю, ви жертвуєте всіх своїх активних міньйонів (мінімум 1) і витрачаєте всю свою Есенцію (мінімум 1) як безкоштовну тригерну дію, щоб повернути ціль до життя, відновлюючи пошкоджені частини її тіла призваною матерією, повʼязаною з вашим портфелем. Ціль повертається з 0 Витривалості плюс 1 Витривалістю за кожного міньйона й кожну Есенцію, витрачених на ефект. Для роботи ефекту ви мусите мати принаймні один уламок решток істоти, а її душа має бажати повернутися до життя.

Ви не можете використати цю рису знову, доки не отримаєте новий рівень або доки не витратите 3 Ейдосу, щоб скористатися нею.`
				}),
				FactoryLogic.feature.createSkillChoice({
					id: 'summoner-7-5'
				})
			]
		},
		{
			level: 8,
			features: [
				FactoryLogic.feature.createPerk({
					id: 'summoner-8-1'
				}),
				FactoryLogic.feature.create({
					id: 'summoner-8-2',
					name: 'Чемпіон портфеля',
					description: `
Ваше коло тепер дозволяє додати чемпіона до вашого портфеля. Чемпіони дотримуються тих самих правил, що й інші ваші міньйони, за такими винятками:

* Ви можете призвати й наказувати лише одному примірнику свого чемпіона.
* Ваш чемпіон перебуває у власному загоні, який не рахується до вашого максимального числа загонів.
* Ваш чемпіон може відновлювати Витривалість і отримувати тимчасову Витривалість.
* Ваш чемпіон використовує ваші Відновлення, щоб відновлювати Витривалість.
* Ваш чемпіон може виконувати дії «Лікування» та «Оборона».
* Ваш чемпіон використовує звичайні правила для маневрів.
* Ви маєте перевагу щоразу, коли використовуєте здібність із ключовим словом «Чемпіон» із простору свого чемпіона.
* Ваш чемпіон відмовляється, щоб його називали міньйоном.

Після призову чемпіона ви не можете призвати його знову, доки не здобудете Перемогу.

Ваш чемпіон отримує додаткові риси на 10-му рівні. Серед них є особлива здібність «Дія чемпіона», на використання якої витрачається Ейдос. Цю здібність можна активувати раз за зустріч наприкінці ходу будь-якої іншої істоти.`
				})
			]
		},
		{
			level: 9,
			features: [
				FactoryLogic.feature.createPackageContent({
					id: 'summoner-9-1a',
					name: 'Покращення комплекту',
					description: 'Потужність вашої здібності «Удар призивача» зростає до Р < [сильний].',
					tag: 'summoner-strike'
				}),
				FactoryLogic.feature.createChoice({
					id: 'summoner-10-1b',
					name: 'Покращення комплекту',
					description: 'Ви можете обрати ще один додатковий оберіг зі свого комплекту призивача.',
					options: [
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2a',
								name: 'Призваний оберіг',
								description: 'Вас вкривають природні захисти вашого портфеля (кістки, фейське дерево, камінь, звивиста плоть). Ви отримуєте +3 до Витривалості, і цей бонус зростає ще на 3 на 4-му, 7-му та 10-му рівнях.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2b',
								name: 'Надзвичайний оберіг',
								description: 'Вперше за раунд, коли ви отримуєте шкоду, ви можете після завершення тригерного ефекту використати безкоштовну тригерну дію, щоб зміститися на 1 клітинку й призвати сигнатурного міньйона в клітинку, яку ви щойно покинули (якщо там достатньо місця).'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2c',
								name: 'Виючий оберіг',
								description: 'Коли ви вступаєте в бій, навколо вас виникає аура 1 із ріжучої магії. Ворог, який починає свій хід поруч із вами, отримує шкоду, рівну вашому Розуму.'
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.create({
								id: 'summoner-3-2d',
								name: 'Ловчий оберіг',
								description: 'Щоразу, коли суміжна істота завдає вам шкоди, ви можете використати безкоштовну тригерну дію, щоб притягнути цю істоту до одного зі своїх міньйонів у межах дальності призивача на кількість клітинок, рівну вашому показнику Розуму.'
							}),
							value: 1
						}
					]
				}),
				FactoryLogic.feature.create({
					id: 'summoner-9-1c',
					name: 'Покращення комплекту',
					description: 'Ви маєте подвійну перевагу на тести, щоб відрадити або залякати ворожих міньйонів чи поплічників.'
				}),
				FactoryLogic.feature.create({
					id: 'summoner-9-2',
					name: 'Управитель двох світів',
					description: 'Ваш одяг і спорядження прикрашаються виразними й вишуканими регаліями, що вирізняють вас серед власної армії: масивними наплічниками з грудної клітки, шоломом із гребенем із зубів або розлогим полум’яним плащем.'
				}),
				FactoryLogic.feature.createClassAbilityChoice({
					id: 'summoner-9-3',
					cost: 11
				})
			]
		},
		{
			level: 10,
			features: [
				FactoryLogic.feature.createCharacteristicBonus({
					id: 'summoner-10-1',
					characteristic: Characteristic.Reason,
					value: 1
				}),
				FactoryLogic.feature.createChoice({
					id: 'summoner-10-2',
					options: [
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-10-2a',
								characteristic: Characteristic.Might,
								value: 1
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-10-2b',
								characteristic: Characteristic.Agility,
								value: 1
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-10-2c',
								characteristic: Characteristic.Intuition,
								value: 1
							}),
							value: 1
						},
						{
							feature: FactoryLogic.feature.createCharacteristicBonus({
								id: 'summoner-10-2d',
								characteristic: Characteristic.Presence,
								value: 1
							}),
							value: 1
						}
					]
				}),
				FactoryLogic.feature.createPackageContent({
					id: 'summoner-10-3',
					name: 'Покращення міньйонів',
					description: `
Тепер на початку зустрічей і ситуацій, що відстежуються раундами, ви призиваєте до двох додаткових міньйонів за кожні дві ваші Перемоги (на додачу до двох, яких зазвичай призиваєте).

Витривалість кожного вашого міньйона покращується, як показано в таблиці. Крім того, кожен міньйон, який отримує приріст Витривалості, може вважати свої характеристики на 1 вищими для опору потужностям (до максимуму 5).

| Міньйон             | Приріст Витривалості                |
|:====================|:====================================|
| Сигнатурний міньйон | Витривалість +1 (разом +3)          |
| 3-есенційний міньйон | Витривалість +3 (разом +9)          |
| 5-есенційний міньйон | Витривалість +2 (разом +6)          |
| 7-есенційний міньйон | Витривалість +5 (разом +10)         |`,
					tag: 'minions'
				}),
				FactoryLogic.feature.createHeroicResource({
					id: 'summoner-10-4',
					name: 'Ейдос',
					type: 'epic',
					gains: [
						{
							tag: '',
							trigger: 'Завершення відпочинку',
							value: 'Отримання досвіду'
						}
					],
					description: `
Ви отримуєте епічний ресурс, що називається ейдосом. Коли ви завершуєте відпочинок, ви отримуєте стільки Ейдосу, скільки XP здобули. Ви можете витрачати Ейдос як Есенцію на своїх міньйонів і здібності. Коли ви робите це, ви призиваєте до двох бонусних сигнатурних міньйонів у незайняті простори в межах дальності призивача.

Ви й ваш чемпіон також отримуєте доступ до здібностей, які використовуються за Ейдос (див. «Їхнє життя за моє» і «Чемпіон портфеля»).

Ейдос зберігається, доки ви його не витратите.`
				}),
				FactoryLogic.feature.create({
					id: 'summoner-10-5',
					name: 'Будь-якою ціною',
					description: 'Щоразу, коли ви жертвуєте міньйонами, тепер ви зменшуєте вартість героїчної здібності або міньйона на таку саму величину (до мінімуму 1), а не лише на 1.'
				}),
				FactoryLogic.feature.create({
					id: 'summoner-10-6',
					name: 'У наших лавах',
					description: 'Як діяльність під час відпочинку ви призиваєте охочого й не скованого неігрового персонажа або союзника-гравця, щоб той приєднався до вашої групи, незалежно від відстані чи маніфолду. Ціль лишається з вами до початку вашого наступного відпочинку або до своєї загибелі, після чого її негайно відправляє назад у місце, звідки її було призвано. Ви не можете мати більше одного персонажа, призваного таким способом.'
				}),
				FactoryLogic.feature.createPerk({
					id: 'summoner-10-7',
					name: 'Перк',
					lists: [PerkList.Intrigue, PerkList.Interpersonal, PerkList.Supernatural]
				}),
				FactoryLogic.feature.createSkillChoice({
					id: 'summoner-10-8',
					name: 'Навичка'
				})
			]
		}
	],
	abilities: [
		FactoryLogic.createAbility({
			id: 'summoner-ability-1',
			name: 'Перенесення Есенції',
			description: 'Ви пронизуєте ворога й переробляєте частину тієї «тканини його буття», якою він однаково не користувався.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Magic, AbilityKeyword.Melee, AbilityKeyword.Strike],
			distance: [FactoryLogic.distance.createMelee()],
			target: 'Одна істота',
			cost: 5,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: '5 + Р шкоди від скверни; 2 заряди (див. нижче)',
						tier2: '8 + Р шкоди від скверни; 3 заряди',
						tier3: '11 + Р шкоди від скверни; 4 заряди'
					})
				),
				FactoryLogic.createAbilitySectionText(`
Ви можете витрачати заряди, щоб активувати один із наведених ефектів. Можна активувати той самий ефект кілька разів. Усі заряди зникають після використання цієї здібності.

* **1 заряд**: Ви або союзник у межах дальності призивача можете витратити Відновлення.
* **1 заряд**: Ви або союзник у межах дальності призивача отримуєте 1 сплеск.
* **2 заряди**: Ви призиваєте сигнатурного міньйона в незайнятий простір у межах дальності призивача.`)
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-2',
			name: 'Вибуховий парад',
			description: 'Ваші міньйони розбухають від енергії, доки більше не можуть існувати в цьому світі.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged],
			distance: [FactoryLogic.distance.createSummoner()],
			target: 'Особливе',
			cost: 5,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: 'Ви призиваєте чотирьох сигнатурних міньйонів',
						tier2: 'Ви призиваєте п’ятьох сигнатурних міньйонів',
						tier3: 'Ви призиваєте шістьох сигнатурних міньйонів'
					})
				),
				FactoryLogic.createAbilitySectionText(`
Міньйони призиваються в межах дальності незалежно від вашого максимуму міньйонів і без формування загонів. Кожен щойно призваний міньйон негайно рухається на свою швидкість до істоти або предмета.

Якщо він доходить суміжно до цілі, стає ціллю атаки можливості або припиняє рух, то вибухає, завдаючи 2 шкоди одній суміжній істоті чи предмету й відштовхуючи її на 1 клітинку. Якщо ціль зазнає вибухів двох або більше міньйонів, ефекти накопичуються. Ці міньйони не активують жодних ефектів смерті, а ви не отримуєте Есенції від їхньої загибелі.`),
				FactoryLogic.createAbilitySectionField({
					name: 'Особливе',
					effect: 'Крім міньйонів, призваних як частина цієї здібності, ви можете обрати наказати будь-якій кількості своїх міньйонів у межах дальності, за умови що вони цього ходу ще не використовували основну дію або маневр.'
				})
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-3',
			name: 'Тактика відволікання',
			description: 'Ваші міньйони беруть на себе працю, щоб відтягнути увагу від союзників.',
			type: FactoryLogic.type.createManeuver({ free: true }),
			keywords: [AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.createSelf()],
			target: 'Особливе',
			cost: 5,
			sections: [
				FactoryLogic.createAbilitySectionText('До кінця зустрічі або доки ви не почнете вмирати кожен міньйон під вашим контролем під час цієї зустрічі стає ціллю такого ефекту: удари цілі можуть накладати на ворогів І < [слабкий], спровокований (до кінця ходу). Потужність зростає на 1 за кожного міньйона, який приєднався до удару.')
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-4',
			name: 'Закличний крик',
			description: '«Покажіть їм, з чого ви зроблені!»',
			type: FactoryLogic.type.createManeuver(),
			keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Burst, value: 3 })],
			target: 'Усі союзники',
			cost: 5,
			sections: [
				FactoryLogic.createAbilitySectionText('Кожна ціль обирає між отриманням 2 сплесків або додатковою шкодою, рівною вашому показнику Розуму, на своєму наступному ударі.')
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-5',
			name: 'Колиска призивача',
			description: 'Ви кличете захисні сили, щоб уберегти всіх вас від шкоди.',
			type: FactoryLogic.type.createManeuver(),
			keywords: [AbilityKeyword.Magic, AbilityKeyword.Ranged],
			distance: [FactoryLogic.distance.createSummoner()],
			target: 'Особливе',
			cost: 5,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: '3 істоти',
						tier2: '4 істоти',
						tier3: '5 істот'
					})
				),
				FactoryLogic.createAbilitySectionText('До кінця зустрічі кожна ціль може використати безкоштовну тригерну дію, коли отримує шкоду, щоб зменшити вхідну шкоду вдвічі, після чого втрачає цей ефект.')
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-6',
			name: 'Меч призивача',
			description: 'Ви черпаєте силу з армії, якою оточуєте себе, і призиваєте палахкий клинок енергії та запалу.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Magic, AbilityKeyword.Melee, AbilityKeyword.Strike],
			distance: [FactoryLogic.distance.createMelee(3)],
			target: 'Одна істота або предмет',
			cost: 5,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: 'Р шкоди',
						tier2: '2 + Р шкоди',
						tier3: '4 + Р шкоди'
					})
				),
				FactoryLogic.createAbilitySectionText('Цей удар завдає додаткові 2 шкоди за кожного союзника поруч із вами.')
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-7',
			name: 'Бліц-тактика',
			description: 'Вперед на них! РОЗЧАВІТЬ ЇХ!',
			type: FactoryLogic.type.createManeuver({ free: true }),
			keywords: [AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.createSelf()],
			target: 'Особливе',
			cost: 7,
			sections: [
				FactoryLogic.createAbilitySectionText('До кінця зустрічі або доки ви не почнете вмирати кожен міньйон під вашим контролем під час цієї зустрічі стає ціллю такого ефекту. Вперше за хід, коли ціль проходить крізь простір ворога, цей ворог може обрати зміститися на 1 клітинку або зробити С < [слабкий] (або С < [середній], якщо ціль більша за ворога), інакше падає лежачи. Потужність зростає на 1 за кожну наступну ціль, що проходить крізь простір ворога під час тієї самої дії руху.')
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-8',
			name: 'Поклик кавалерії',
			description: 'Одинокий загін з’являється, щоб зірвати плани ворога й відтягнути його сили одну за одною.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.createSummoner()],
			target: 'Особливе',
			cost: 7,
			sections: [
				FactoryLogic.createAbilitySectionText(`
Ви призиваєте тимчасовий загін із 6 своїх сигнатурних міньйонів у межах дальності незалежно від свого максимуму міньйонів. Щоразу, коли один із цих міньйонів завдає ворогові шкоди, ворог робить Р < [середній], інакше змушений переміститися на 5 клітинок у бік джерела шкоди (провокуючи атаки можливості). Потужність зростає на 1 для ворогів, по яких націлилися двоє або більше таких міньйонів.

Ці міньйони гинуть наприкінці вашого ходу, не активують жодних ефектів смерті, а ви не отримуєте Есенції від їхньої загибелі.`)
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-9',
			name: 'Воронка Есенції',
			description: 'Ви швидко призиваєте й жертвуєте міньйонами, щоб підживити нищівний магічний вибух.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Line, value: 10, value2: 1, within: 1 })],
			target: 'Усі вороги й предмети',
			cost: 7,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: '5 шкоди; відштовхнути на 2',
						tier2: '9 шкоди; відштовхнути на 4',
						tier3: '12 шкоди; відштовхнути на 6'
					})
				),
				FactoryLogic.createAbilitySectionField({
					name: 'Особливе',
					effect: 'Як частину цієї здібності ви можете обрати вбити будь-яку кількість своїх міньйонів у межах дальності призивача, за умови що вони цього ходу ще не використовували основну дію або маневр. Кожна ціль отримує додатково 1 шкоди плюс 1 шкоду за кожного міньйона, вбитого таким способом. Ці міньйони не активують жодних ефектів смерті, а ви не отримуєте Есенції від їхньої загибелі.'
				})
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-10',
			name: 'Веди прикладом',
			description: 'Ваші міньйони дивляться, як ваш імплемент іскриться силою, готовою вгатити неймовірним ударом у ворога.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Magic, AbilityKeyword.Melee, AbilityKeyword.Ranged, AbilityKeyword.Strike],
			distance: [
				FactoryLogic.distance.createMelee(),
				FactoryLogic.distance.createSummoner()
			],
			target: 'Один ворог або предмет',
			cost: 7,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: '8 + Р шкоди; Р < [слабкий], приголомшений (рят. кидок закінчує)',
						tier2: '12 + Р шкоди; Р < [середній], приголомшений (рят. кидок закінчує)',
						tier3: '16 + Р шкоди; Р < [сильний], приголомшений (рят. кидок закінчує)'
					})
				)
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-11',
			name: 'Клич чемпіона',
			description: 'Ваш чемпіон випускає рев, що пробирає вас до кісток.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Champion, AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Burst, value: 3 })],
			target: 'Усі вороги',
			cost: 9,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: '2 психічної або звукової шкоди; І < [слабкий], зляканий вами (рят. кидок закінчує)',
						tier2: '5 психічної або звукової шкоди; І < [середній], зляканий вами і всіма союзниками (до кінця ходу)',
						tier3: '7 психічної або звукової шкоди; І < [сильний], зляканий вами і всіма союзниками (рят. кидок закінчує)'
					})
				),
				FactoryLogic.createAbilitySectionText('Ви можете використовувати цю здібність так, ніби перебуваєте в просторі одного зі своїх міньйонів у межах дальності призивача.')
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-12',
			name: 'Ідол армії',
			description: 'Поява вашого чемпіона зачаровує вас і ваших союзників.',
			type: FactoryLogic.type.createManeuver(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Champion, AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Burst, value: 3 })],
			target: 'Себе та всіх союзників',
			cost: 9,
			sections: [
				FactoryLogic.createAbilitySectionText(`
Ви можете використовувати цю здібність так, ніби перебуваєте в просторі одного зі своїх міньйонів у межах дальності призивача.

До кінця зустрічі або доки ви не почнете вмирати кожна ціль отримує +2 до рятівних кидків.

Кожна ціль може негайно виконати всі свої рятівні кидки та підвестися, якщо лежить.`)
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-13',
			name: 'Чемпіон трощить землю',
			description: 'Ваш чемпіон обрушує свій гнів на тих, кому не пощастило опинитися на його шляху.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Champion, AbilityKeyword.Magic, AbilityKeyword.Weapon],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Cube, value: 4, within: 1 })],
			target: 'Усі вороги й предмети',
			cost: 9,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: '5 шкоди; С < [слабкий] розпластаний і не може встати (рят. кидок закінчує)',
						tier2: '8 шкоди; С < [середній] розпластаний і не може встати (рят. кидок закінчує)',
						tier3: '11 шкоди; С < [сильний] розпластаний і не може встати (рят. кидок закінчує)'
					})
				),
				FactoryLogic.createAbilitySectionText('Ви можете використовувати цю здібність так, ніби перебуваєте в просторі одного зі своїх міньйонів у межах дальності призивача.'),
				FactoryLogic.createAbilitySectionField({
					name: 'Особливе',
					effect: 'Ви можете змінити тип шкоди на той, який чемпіон завдає у своєму блоці характеристик.'
				})
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-14',
			name: 'Їхній саван огортає всіх',
			description: 'Ваш чемпіон наповнює місцевість густим серпанком, що ховає друга від ворога.',
			type: FactoryLogic.type.createManeuver(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Champion, AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Burst, value: 4 })],
			target: 'Усі вороги',
			cost: 9,
			sections: [
				FactoryLogic.createAbilitySectionText(`
Ви можете використовувати цю здібність так, ніби перебуваєте в просторі одного зі своїх міньйонів у межах дальності призивача.

Ціль робить Р < [середній], інакше стає ослабленою (рят. кидок закінчує).

До кінця зустрічі щоразу, коли ціль отримує результат рівня 1 на ударі, вона завдає половинної шкоди. Якщо ціль завдавала удару істоті поруч з одним зі своїх союзників, натомість вона націлюється на цього союзника.`)
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-15',
			name: '1 000 000 міньйонів',
			description: 'Битва тепер стала війною. Уся ваша армія накриває поле бою.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.createSpecial('Особливе')],
			target: 'Особливе',
			cost: 11,
			sections: [
				FactoryLogic.createAbilitySectionText(`
До кінця зустрічі або доки ви не почнете вмирати кожна клітинка на землі вважається заповненою міньйонами. Ворог, який завершує свій хід у такій клітинці, отримує 5 шкоди. Цю шкоду неможливо зменшити.

Крім того, ви можете використовувати «Міст із міньйонів», вважаючи кожну уражену клітинку придатним міньйоном (максимум 10 додаткових клітинок).`)
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-16',
			name: 'Тактика охоронців',
			description: 'Ви оточуєте союзників майже безмежним потоком призовів, що стають на шляху будь-яких ударів.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Burst, value: 5 })],
			target: 'Себе та кожного союзника, що не є міньйоном',
			cost: 11,
			sections: [
				FactoryLogic.createAbilitySectionText('До кінця зустрічі або доки ви не почнете вмирати кожна ціль має імунітет до шкоди 5 і раз за хід може використати безкоштовну тригерну дію, коли її примусово переміщують, щоб зменшити цю відстань удвічі.')
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-17',
			name: 'Я відкликаю тебе!',
			description: 'Киньте тих, хто не прив’язаний до цього маніфолду, в порожнечу міньйонського буття.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Magic],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Burst, value: 3 })],
			target: 'Усі вороги',
			cost: 11,
			sections: [
				FactoryLogic.createAbilitySectionText(`
Кожен ворожий міньйон у зоні назавжди прибирається з мапи зустрічі. До трьох ворогів у зоні, що не є ватажками чи соло-істотами, вилучаються зі зустрічі на 1 раунд.

Ватажок або соло-ворог у зоні, який має Р, І або П < [середній], стає ослабленим і уповільненим (рят. кидок закінчує), бо його частково висмикує з маніфолду. Ви можете підвищити потужність на 1 за кожного свого міньйона, суміжного з ціллю, яким ви вирішите пожертвувати під час використання цієї здібності.`)
			]
		}),
		FactoryLogic.createAbility({
			id: 'summoner-ability-18',
			name: 'Гнів чемпіона',
			description: 'Ваш чемпіон з’являється й кидається в шаленство, розчищаючи шлях вашим міньйонам.',
			type: FactoryLogic.type.createMain(),
			keywords: [AbilityKeyword.Area, AbilityKeyword.Champion, AbilityKeyword.Magic, AbilityKeyword.Weapon],
			distance: [FactoryLogic.distance.create({ type: AbilityDistanceType.Burst, value: 4 })],
			target: 'Усі вороги',
			cost: 11,
			sections: [
				FactoryLogic.createAbilitySectionRoll(
					FactoryLogic.createPowerRoll({
						characteristic: Characteristic.Reason,
						tier1: '6 шкоди; відштовхнути на 4; С < [слабкий], це відштовхування стає вертикальним',
						tier2: '10 шкоди; відштовхнути на 5; С < [середній], це відштовхування стає вертикальним',
						tier3: '14 шкоди; відштовхнути на 6; С < [сильний], це відштовхування стає вертикальним'
					})
				),
				FactoryLogic.createAbilitySectionText(`
Ви можете використовувати цю здібність так, ніби перебуваєте в просторі одного зі своїх міньйонів у межах дальності призивача.

Ви можете змінити тип шкоди на той, який чемпіон завдає у своєму блоці характеристик (див. «Чемпіон портфеля»). За кожного ворога, якого ця здібність зводить до 0 Витривалості, союзник у межах дальності може рухатися на свою швидкість.`)
			]
		})
	],
	subclasses: [
		circleOfBlight,
		circleOfGraves,
		circleOfSpring,
		circleofStorms
	],
	level: 1,
	characteristics: []
};
