export class ConditionData {
	static bleeding = `
Поки істота стікає кровʼю, щоразу коли вона використовує основну дію, тригерну дію або виконує випробування чи кидок здібності на Силу чи Ловкість, вона втрачає Витривалість, рівну 1d6 + її рівень після завершення дії, тригерної дії або кидка сили. Цю втрату Витривалості не можна запобігти жодним чином, і вона відбувається лише раз за дію.

Ви отримуєте шкоду від цього стану, коли використовуєте основну дію не у свій хід. Наприклад, фірмова здібність, використана як безкоштовна тригерна дія за допомогою здібності «Удар зараз» тактика, спричиняє шкоду від стану кровотечі.`;

	static dazed = `
Істота з цим станом може виконати лише одну дію за хід: основну дію, маневр або дію переміщення. Також така істота не може використовувати тригерні дії, безкоштовні тригерні дії чи безкоштовні маневри.`;

	static frightened = `
Коли істота налякана, будь-який кидок здібності проти джерела страху отримує шкоду. Якщо джерело — інша істота, її кидки проти наляканої істоти отримують перевагу. Налякана істота не може свідомо наближатися до джерела страху, якщо знає його місцезнаходження. Якщо істота отримує цей стан від нового джерела, попередній стан страху замінюється новим.`;

	static grabbed = `
Істота, яку схопили, має швидкість 0, не може бути примусово переміщена, окрім як істотою, обʼєктом чи ефектом, що її схопив, не може використовувати маневр «Відштовхування» й отримує шкоду на здібності, які не спрямовані на того, хто її схопив. Якщо істоту схопила інша істота й рухається, вона тягне схоплену істоту за собою. Якщо розмір істоти дорівнює або менший за розмір тієї, кого вона схопила, її швидкість удвічі менша, поки вона тримає цю істоту.

Істота, що схопила іншу, може використати маневр, щоб перемістити схоплену істоту на вільну клітинку поруч із собою.

Істота може відпустити схоплену істоту будь-коли (без дії). Схоплена істота може спробувати вирватися за допомогою маневру «Вирватися». Якщо схоплена істота телепортується або якщо будь-хто з пари перестає бути сусідом, стан закінчується.

Істота може схопити лише істот свого розміру або менших. Якщо її Сила 2 або більше, вона може схопити істоту більшого розміру, якщо її розмір не перевищує значення Сили.

Якщо не зазначено інше, істота може схопити лише одну істоту одночасно.`;

	static prone = `
Поки істота лежить, вона знаходиться на землі, будь-який її удар отримує шкоду, а здібності ближнього бою проти неї отримують перевагу. Щоб рухатися, істота має повзти, витрачаючи на кожну клітинку на 1 більше руху. Вона не може лазити, стрибати, плавати чи літати, поки лежить. Якщо істота лежить під час лазіння, польоту чи стрибка, вона падає.

Якщо не зазначено інше, істота може підвестися за допомогою маневру «Підвестися». Істота поруч із добровільною лежачою істотою також може використати цей маневр, щоб підняти її.`;

	static restrained = `
Істота зі станом сковування має швидкість 0, не може підвестися й не може бути примусово переміщена. Вона отримує шкоду на кидки здібностей і випробування Сили та Ловкості, а здібності проти неї отримують перевагу.

Якщо істота телепортується, стан сковування закінчується.`;

	static slowed = `
Істота з цим станом має швидкість 2, якщо її швидкість не нижча, і не може зміщуватися.`;

	static taunted = `
Істота з цим станом отримує подвійну шкоду на кидки здібностей для будь-якої здібності, що не спрямована на того, хто її насміхнув, якщо є пряма видимість. Якщо істота отримує цей стан від нового джерела, попередній стан насмішки замінюється новим.`;

	static weakened = `
Істота з цим станом отримує шкоду на кидки сили.`;
}
