import { CultureType } from '@/enums/culture-type';
import { FactoryLogic } from '@/logic/factory-logic';
import { SkillList } from '@/enums/skill-list';

export class EnvironmentData {
	static nomadic = FactoryLogic.feature.createSkillChoice({
		id: 'env-nomadic',
		name: 'Кочова',
		description: 'Кочова культура пересувається з місця на місце, щоб вижити. Її представники можуть слідувати за міграціями тварин чи погодою, подорожувати для продажу товарів або послуг, або ж просто насолоджуватися неспокійним способом життя, сповненим нових вражень і знайомств. Ті, хто виріс у кочових культурах, вчаться орієнтуватися в дикій природі та тісно співпрацювати з іншими заради виживання.',
		listOptions: [
			SkillList.Exploration,
			SkillList.Interpersonal
		]
	});

	static rural = FactoryLogic.feature.createSkillChoice({
		id: 'env-rural',
		name: 'Сільська',
		description: 'Сільська культура розташована в містечку, селі або невеликому поселенні. Люди тут часто обробляють землю, торгують товарами чи послугами з мандрівниками, ловлять рибу або видобувають метали й дорогоцінне каміння. Живучи серед невеликої спільноти, більшість мешканців села опановують ремесло й отримують важливі знання, необхідні для виживання громади. Наприклад, якщо у селі лише один коваль, важливо, щоб учень почав навчатися задовго до того, як коваль постаріє. Якщо єдиний священник захворіє, громада хоче мати аколіта, готового виконати обов’язки у разі потреби.',
		listOptions: [
			SkillList.Crafting,
			SkillList.Lore
		]
	});

	static secluded = FactoryLogic.feature.createSkillChoice({
		id: 'env-secluded',
		name: 'Відокремлена',
		description: 'Відокремлена культура базується в одній споруді або комплексі — будівлі, печері тощо — і рідко взаємодіє з іншими культурами. Це можуть бути монастирі, замки чи в’язниці. Люди у відокремленій культурі майже не мають причин залишати дім чи спілкуватися з іншими, але можуть знати про зовнішній світ. Життя в тісному колі вчить ладнати з іншими, а також сприяє навчанню й саморефлексії, адже в ізоляції не так багато інших занять.',
		listOptions: [
			SkillList.Interpersonal,
			SkillList.Lore
		]
	});

	static urban = FactoryLogic.feature.createSkillChoice({
		id: 'env-urban',
		name: 'Міська',
		description: 'Міська культура завжди зосереджена в місті. Вона може виникнути у стінах великого мегаполіса, у мережі печер підземного міста чи будь-де, де велика кількість людей живе поруч. Люди міських культур часто вчаться майстерно обходити інших, щоб орієнтуватися у натовпі та політичних інтригах, які супроводжують міське життя.',
		listOptions: [
			SkillList.Interpersonal,
			SkillList.Intrigue
		]
	});

	static wilderness = FactoryLogic.feature.createSkillChoice({
		id: 'env-wilderness',
		name: 'Дика місцевість',
		description: 'Культура дикої місцевості не намагається підкорити природу, в якій живе — це може бути пустеля, ліс, болото, тундра, океан чи інші екзотичні місця. Люди такої культури процвітають серед природи, отримуючи їжу й притулок від землі. Це може бути коло друїдів, що охороняють віддалений гай, банда розбійників у печерах пустелі чи табір орків-найманців у горах. Люди дикої культури вчаться використовувати землю для всього необхідного, зазвичай виготовляючи власні інструменти, одяг тощо.',
		listOptions: [
			SkillList.Crafting,
			SkillList.Exploration
		]
	});

	static getEnvironments = () => {
		return [
			this.nomadic,
			this.rural,
			this.secluded,
			this.urban,
			this.wilderness
		];
	};
}

export class OrganizationData {
	static bureaucratic = FactoryLogic.feature.createSkillChoice({
		id: 'org-bureaucratic',
		name: 'Бюрократична',
		description: 'Бюрократичні культури пронизані офіційним керівництвом і формально записаними законами. Члени такої культури часто мають ранг згідно з цими законами, а влада належить невеликій групі людей за правом народження, голосуванням чи іншим офіційним критерієм. У багатьох бюрократичних спільнотах є одна особа на вершині, хоча інші можуть керуватися радою. Торгова гільдія з гільдмайстром, скарбником, секретарем і статутом; феодал, що керує лицарями, які, у свою чергу, керують селянами; і мілітаристське суспільство з чіткими рангами та правилами — усе це приклади бюрократичних культур. Ті, хто процвітає в бюрократичних культурах, не просто дотримуються правил, а вміють використовувати їх на свою користь, змінюючи чи тлумачачи політику для власної вигоди. Вміння спілкуватися з тими, хто створює закони, часто є ключем до успіху. Інші ж спеціалізуються на тому, щоб діяти поза суворими правилами, не потрапляючи під покарання.',
		listOptions: [
			SkillList.Interpersonal,
			SkillList.Intrigue
		]
	});

	static communal = FactoryLogic.feature.createSkillChoice({
		id: 'org-communal',
		name: 'Комунальна',
		description: 'Комунальна культура — це місце, де всі члени спільноти вважаються рівними. Громада разом приймає важливі рішення, що впливають на більшість, і обирає лідерів для організації спільних зусиль. Кожен має відносно рівне право голосу, і всі допомагають громаді виживати й процвітати. Люди часто ділять між собою тягарі управління, фізичної праці, догляду за дітьми та інші обов’язки. Колектив фермерів, що разом обробляють землю без пана, місто піратів, де кожен робить, що хоче, або мандрівна театральна трупа, де всі голосують щодо рішень — це приклади комунальних культур. Багато таких культур існують поза межами поселень: у дикій природі, окремих районах міст, каналізаціях, руїнах чи інших ізольованих місцях. Навіть якщо ці культури безпечні, їхні члени знають, що чужинці можуть спробувати нав’язати їм свої правила, тому вони прагнуть захищати себе й уникати небезпеки від інших груп.',
		listOptions: [
			SkillList.Crafting,
			SkillList.Exploration
		]
	});

	static getOrganizations = () => {
		return [
			this.bureaucratic,
			this.communal
		];
	};
}

export class UpbringingData {
	static academic = FactoryLogic.feature.createSkillChoice({
		id: 'up-academic',
		name: 'Академічна',
		description: 'Ваш герой виріс серед людей, які збирають, вивчають і поширюють книги та інші записи. Деякі академіки зосереджуються на одній галузі, наприклад, коледж для магів чи церква, що навчає слову певного божества. Люди в академічній культурі вчаться користуватися силою знань.',
		listOptions: [
			SkillList.Lore
		]
	});

	static creative = FactoryLogic.feature.createSkillChoice({
		id: 'up-creative',
		name: 'Творча',
		description: 'Герой із творчим вихованням виріс серед людей, які створюють мистецтво чи інші цінні для обміну речі. Творча культура може виробляти витончене мистецтво — танець, музику, скульптуру — або практичні речі: вози, зброю, інструменти, будівлі. Люди в таких культурах цінують якісну майстерність і увагу до деталей.',
		options: [
			'Музика',
			'Виступ'
		],
		listOptions: [
			SkillList.Crafting
		]
	});

	static lawless = FactoryLogic.feature.createSkillChoice({
		id: 'up-lawless',
		name: 'Беззаконна',
		description: 'Ваш герой виріс серед людей, які займалися тим, що інші — як у межах, так і поза межами їхньої культури — вважали незаконним. Банда піратів, гільдія вбивць чи організація шпигунів — усі вони порушують закон заради грошей. А за тиранії навіть повстанці вважаються беззаконними. Люди, виховані в такій культурі, зазвичай не бояться порушувати правила, якщо це їм вигідно, і добре приховують свої дії.',
		listOptions: [
			SkillList.Intrigue
		]
	});

	static labor = FactoryLogic.feature.createSkillChoice({
		id: 'up-labor',
		name: 'Праці',
		description: 'Ваш герой виріс у культурі, де люди заробляють на життя працею. Це могли бути землероби, що вирощують врожай чи худобу, або ті, хто добуває природні ресурси — полюванням, риболовлею, лісозаготівлею чи шахтарством. Або ж це могли бути майстри ручної праці, пов’язаної з будівництвом, перевезенням, навантаженням тощо. Люди з таким вихованням цінують важку працю.',
		options: [
			'Ковальство',
			'Догляд за тваринами'
		],
		listOptions: [
			SkillList.Exploration
		]
	});

	static martial = FactoryLogic.feature.createSkillChoice({
		id: 'up-martial',
		name: 'Військова',
		description: 'Герой із військовим вихованням виріс серед воїнів. Це могли бути солдати регулярної армії, загін найманців, гільдія мисливців на чудовиськ чи будь-хто, чиє життя пов’язане з боєм. Такі герої завжди готові до сутички — і знають, як її завершити.',
		options: [
			'Ковальство',
			'Стрільництво',
			'Лазіння',
			'Витривалість',
			'Верхова їзда',
			'Залякування',
			'Пильність',
			'Відстеження',
			'Монстри',
			'Стратегія'
		]
	});

	static noble = FactoryLogic.feature.createSkillChoice({
		id: 'up-noble',
		name: 'Шляхетна',
		description: 'Ваш герой виріс серед лідерів, які керують іншими й ведуть політичні ігри для збереження влади. Багато родин є шляхетними за народженням, але в деяких культурах титули здобувають за заслуги чи популярність. Як би там не було, герої з таким минулим розуміють, чому шепіт у потрібне вухо іноді сильніший за будь-яку армію.',
		listOptions: [
			SkillList.Interpersonal
		]
	});

	static getUpbringings = () => {
		return [
			this.academic,
			this.creative,
			this.lawless,
			this.labor,
			this.martial,
			this.noble
		];
	};
}

export class CultureData {
	static bespoke = FactoryLogic.createCulture('Авторська культура', 'Обирайте будь-яке середовище, організацію та виховання.', CultureType.Bespoke);
}
