import { EncounterObjective } from '@/models/encounter';

export class EncounterObjectiveData {
	static diminishNumbers: EncounterObjective = {
		id: 'diminish-numbers',
		name: 'Зменшити чисельність',
		description: 'Найпростіша мета бойової сутички звучить так: «переможіть їх, поки вони не перемогли вас». Хоч героям і не обовʼязково вбивати всіх до останнього ворога в сутичці на зменшення чисельності, вони все одно мають вивести супротивників із бою, щоб перемогти, тобто довести їх до втечі або капітуляції.',
		difficultyModifier: 'Ця ціль не змінює складність сутички.',
		successCondition: `
Виберіть одну з наведених умов успіху:
* Сутичка, що містить щонайменше дві групи міньйонів, завершується, коли в героїв не лишається жодного ворога, який не є міньйоном.
* Сутичка, у якій переважають істоти-ватаги, завершується, коли герої чисельно переважають ворогів.
* Сутичка, у якій переважають істоти-взводи, завершується, коли герої переважають ворогів у співвідношенні два до одного.
* Сутичка завершується, коли в героїв лишається вдвічі менше ворогів, ніж було на початку, або ще менше.
* У битві проти соло-істоти вона тікає або здається, коли її Витривалість падає до чверті максимуму або нижче і вона вже використала всі свої дії лиходія.`,
		failureCondition: 'Герої не отримують Перемог, якщо їх убито, захоплено, вони тікають або іншим чином не можуть перемогти ворогів.',
		victories: 'Якщо герої досягають успіху, вони отримують 1 Перемогу за легку або стандартну сутичку чи 2 Перемоги за складну або екстремальну сутичку.'
	};

	static defeatFoe: EncounterObjective = {
		id: 'defeat-foe',
		name: 'Перемогти конкретного ворога',
		description: 'Сутичка з метою перемогти конкретного ворога містить одного чи кількох супротивників героїв, які керують рештою, наприклад гобґоблінського крововладу, що веде загін найманців, або одного чи кількох особливо сильних ворогів серед слабших, як-от пару ікластих демонів у ватазі ґнолів. Оскільки саме ці вороги є головними фігурами сутички, коли вони вибувають із бою, а лишаються тільки слабкі противники, бій втрачає напругу і його логічно завершити. Цілком природно, що такі слабші вороги тікають або здаються, коли падає їхня головна перевага.',
		difficultyModifier: 'Якщо істота або істоти, яких треба перемогти, щоб завершити сутичку, становлять третину або менше від загального EV ворожого боку, сутичка стає на один щабель легшою за складністю, наприклад зі складної до стандартної.',
		successCondition: 'Герої перемагають, коли визначена істота або істоти зведені до 0 Витривалості.',
		failureCondition: 'Герої не отримують Перемог, якщо не переможуть усіх визначених істот. Зверніть увагу: ці істоти можуть утекти, якщо всі їхні союзники почнуть гинути.',
		victories: 'Герої отримують Перемоги відповідно до складності сутички після коригування цією ціллю. Вони отримують 1 Перемогу за легку або стандартну сутичку чи 2 Перемоги за складну сутичку.'
	};

	static getThing: EncounterObjective = {
		id: 'get-thing',
		name: 'Дістаньте штуку!',
		description: `
Класичне героїчне фентезі сповнене важливих предметів, які героям доводиться захищати від сил зла: магічні персні, королівські свідоцтва про народження, драконячі яйця тощо. Герої часто вступають у запеклий конфлікт із ворогами, коли поспішають забрати цінний чи важливий предмет із храму або замку під охороною, або коли їм треба викрасти річ у ворогів, які вже нею володіють. Цілі з цієї категорії добре поєднуються з іншими цілями, наприклад із перемогою над конкретним ворогом. Скажімо, героям треба вкрасти реєстр із записами про злочинну діяльність у верховного розуму та її поплічників. Однак навіть якщо їм вдасться заволодіти книгою, бій не завершиться, доки вони не переможуть і саму верховну розумницю, яка не віддасть її без бою.

### ШТУКА

Штука, яку герої мають дістати, зазвичай є обʼєктом розміру 1T. Якщо ж це істота або громіздкий обʼєкт, який треба пронести повз ворогів, така сутичка, імовірно, радше належить до супроводу. Більшість або навіть усі шляхи до штуки охороняють вороги, а сам предмет часто стереже пастка або особливо потужне чудовисько.

Штука може бути крихкою, як документ, або майже незнищенною, як магічна зброя, але в будь-якому разі вороги зазвичай не прагнуть її пошкодити. Утім, у деяких випадках вона все ж може постраждати випадково.

Additionally, a thing can have one of the following extra defenses:

* **Прихована**: Щоб знайти штуку, героям може знадобитися один або кілька успішних тестів, або ж вона може бути за дверима чи кришкою, які спершу треба відчинити. Іноді вона навіть ховається просто на видноті. Непримітний меч у руці нерухомого обладунка може виявитися саме тим магічним клинком, який вони шукають.
* **Утримувана**: Штука перебуває у володінні ворога. Можливо, вона в нього в кишені, або, якщо це зброя чи implements, ворог може нею користуватися.`,
		difficultyModifier: 'Якщо штуку безпосередньо не охороняє потужне чудовисько, тобто таке, що становить щонайменше третину загального EV сутички, або пастка, сутичка стає на один щабель легшою. Якщо штука прихована або утримувана, сутичка стає на один щабель складнішою.',
		successCondition: 'Герої перемагають, коли всі герої залишають мапу сутички разом зі штукою.',
		failureCondition: 'Герої не отримують Перемог, якщо штуку знищено або вона лишається в руках ворогів.',
		victories: 'Герої отримують 1 Перемогу, якщо залишають мапу разом зі штукою, а сутичка після коригування цією ціллю є легкою, стандартною або складною. Натомість вони отримують 2 Перемоги, якщо виконують умову успіху, а сутичка має екстремальну складність або жоден із героїв не отримує шкоди під час сутички.'
	};

	static destroyThing: EncounterObjective = {
		id: 'destroy-thing',
		name: 'Знищте штуку!',
		description: `
Бій не завжди має зводитися до знищення ворогів. Іноді треба знищити їхні речі. Спалити корабель піратського капітана, закрити портал до Безодньої Пустки, поки звідти не хлинула армія демонів, або вивести з ладу величезну кобольдську пастку з обертовими лезами - усе це може настільки підірвати сили ворогів героїв, що після такого удару битися далі вже не матиме сенсу.

Іноді штука насправді складається з кількох речей, і знищити треба їх усі.

### ШТУКА

Типова штука - це обʼєкт із Витривалістю, що дорівнює рівню героїв, помноженому на 20. Більшість обʼєктів мають імунітет до отруйної та психічної шкоди. Крім того, штука може мати імунітет або вразливість до одного чи кількох типів шкоди. Наприклад, магічна статуя може бути несприйнятливою до вогняної шкоди, але вразливою до грому.

Additionally, a thing can have one or more of the following extra defenses:

* **Прихована**: Щоб знайти штуку, героям може знадобитися один або кілька успішних тестів, або ж вона може бути за дверима чи кришкою, які треба відчинити. Вона навіть може бути схована просто на виду.
* **Утримувана**: Штука перебуває у володінні ворога. Штука не може бути одночасно і прихованою, і утримуваною.
* **Міцна**: Витривалість штуки подвоюється.
* **Кілька**: Є кілька штук, і знищити треба всі. Розділіть Витривалість штуки між ними.`,
		difficultyModifier: 'Якщо штука не має жодного додаткового захисту, сутичка стає на один щабель легшою. Якщо штука має щонайменше два додаткові захисти, сутичка стає на один щабель складнішою.',
		successCondition: 'Герої перемагають, коли знищують штуку.',
		failureCondition: 'Герої не отримують Перемог, якщо штуку не знищено і вона лишається в руках ворогів.',
		victories: 'Герої отримують Перемоги відповідно до складності сутички після коригування цією ціллю. Вони отримують 1 Перемогу за легку або стандартну сутичку чи 2 Перемоги за складну.'
	};

	static saveAnother: EncounterObjective = {
		id: 'save-another',
		name: 'Урятуйте іншого',
		description: `
Ніхто не заслуговує звання героя, не врятувавши бодай кілька життів. Іноді сенс сутички не в убивстві, а в тому, щоб урятувати якомога більше людей.

Якщо герої рятують у бою могутніх союзників із лап ворогів, додаткова сила цих союзників може зробити решту сутички майже незначною. Коли ви з товаришами визволяєте грифона з рук браконьєрів, мисливці самі стають... ну, ви зрозуміли.

### СОЮЗНИКИ ТА МОЖЛИВІ СОЮЗНИКИ

У деяких сутичках на порятунок є охочі союзники - істоти, здатні й готові битися пліч-о-пліч із героями, а в деяких - можливі союзники, які не можуть або не хочуть приєднатися до героїв одразу, але можуть зробити це пізніше під час бою. У бою охочими союзниками можуть керувати герої, і для них можна використовувати блоки характеристик почту, тоді як можливими союзниками керує Директор.

Під час сутички можливих союзників треба переконати й визволити з полону, перш ніж вони стануть справжніми союзниками. Для цього потрібен успіх на **складному тесті Присутності**, виконаному як маневр. Інакше у свій хід можливі союзники тікають до найближчого виходу.`,
		difficultyModifier: 'За кожного охочого союзника рівня героїв або вищого, якого вони можуть урятувати, додайте одного героя до групи для цілей побудови сутички.',
		successCondition: 'Щойно всіх союзників визволено й вони або приєдналися до бою, або відступили за межі мапи сутички, а щонайменше половина союзників пережила сутичку, герої перемагають.',
		failureCondition: 'Герої не отримують Перемог, якщо половина або більше союзників мертві чи захоплені.',
		victories: 'Герої отримують 1 Перемогу, якщо виконано умову успіху, а сутичка після коригування модифікатором складності цієї цілі є легкою або стандартною. Герої отримують 2 Перемоги, якщо умову успіху виконано, а бойова сутичка була складною або екстремальною, або якщо всіх союзників урятовано й вони вижили.'
	};

	static escort: EncounterObjective = {
		id: 'escort',
		name: 'Супровід',
		description: `
Як би дивно це не звучало, інколи доля місії взагалі не лежить на плечах героїв. Інколи вона лежить на плечах того, хто стоїть поруч із ними. Завдання героїв - уберегти цю важливу особу, поки вона дістається визначеного місця.

Не кожна сутичка супроводу стосується мудрого чи могутнього союзника. Іноді героям доручають захистити безпорадну або навіть відверто проблемну істоту, наприклад невдатного шляхтича чи неслухняну дитину. Можливо, їм доведеться охороняти навіть громіздкий або незручний неживий обʼєкт. Як би там не було, вороги напирають доти, доки герої не доставлять свій обʼєкт супроводу до місця призначення.

### ПІДОПІЧНИЙ

Істота або обʼєкт, якого треба захистити, називається підопічним. На початку кожного раунду оберіть героя. Підопічний рухається у хід цього героя, і ним керує саме він. Більшість підопічних можуть у свій хід виконати або дію руху, або маневр, але не обидва одразу. Характеристики та швидкість підопічного визначає Директор. Більшість гуманоїдних підопічних мають швидкість 5.

Міцний підопічний, наприклад здоровий містянин, зазвичай має Витривалість, що дорівнює 10, помноженим на рівень героїв. Крихкий підопічний, як-от літній дипломат або важливий обʼєкт, зазвичай має Витривалість, що дорівнює 5, помноженим на рівень героїв.

### ПРИЗНАЧЕННЯ

Кожна сутичка супроводу має місце призначення - безпечну точку, далі якої вороги не підуть.

Зазвичай на початку сутички підопічний перебуває на відстані щонайменше потрійної власної швидкості від місця призначення, хоча може стартувати й ближче, якщо маршрут ускладнюють важкопрохідна місцевість або інші перешкоди. Ворогів героїв можна розмістити будь-де на мапі сутички, зокрема між підопічним і місцем призначення, але не в межах 5 клітинок від нього.

### ПІДКРІПЛЕННЯ

На початку кожного раунду кожного міньйона, убитого в попередньому раунді, замінює підкріплення. Його позицію обирає Директор, але вона не може бути в межах 5 клітинок від підопічного, місця призначення або будь-якого героя.`,
		difficultyModifier: 'Бойова сутичка з крихким підопічним стає на один щабель складнішою.',
		successCondition: 'Герої перемагають, коли підопічний досягає місця призначення.',
		failureCondition: 'Якщо Витривалість підопічного зведено до 0 або йому не дають досягти місця призначення, герої не отримують Перемог.',
		victories: 'Герої отримують 1 Перемогу, якщо виконано умову успіху. Вони отримують 2 Перемоги, якщо умову успіху виконано, а бойова сутичка після коригування цією ціллю має екстремальну складність або якщо підопічний і всі герої досягають місця призначення менш ніж за 3 раунди.'
	};

	static holdThemOff: EncounterObjective = {
		id: 'hold-them-off',
		name: 'Стримайте їх',
		description: `
Іноді героям просто потрібно виграти час. Вони можуть стримувати армію тирана-завойовника, щоб дати невинним селянам нагоду втекти. Або ж муситимуть тримати оборону проти хвилі за хвилею зомбі, поки група жерців завершує ритуал, що остаточно упокоїть нежить. Щоб досягти цієї цілі, герої мають вижити й утримувати певну позицію протягом кількості раундів, визначеної Директором.

### ОБОРОННА ПОЗИЦІЯ

Директор, а інколи й самі герої, обирає оборонну позицію - ділянку, яку герої мають утримувати й контролювати. Чим менше ворогів героїв прорветься повз цю позицію, тим вищі їхні шанси на успіх. Ділянка може мати будь-який розмір. Оборонна позиція перекриває шлях до вразливої зони, яку герої захищають.

Часто оборонна позиція надає переваги тим, хто її тримає. Підхід до неї може бути вузьким, пролягати через важкопрохідну місцевість або вимагати лазіння, а ті, хто стоїть усередині, можуть мати перевагу висоти над тими, хто зовні.

### ТРИВАЛІСТЬ СУТИЧКИ

Директор визначає тривалість сутички - кількість раундів, упродовж яких героям треба боронити цю ділянку, щоб досягти успіху. Типова тривалість такої сутички - 3 раунди.

### ПІДКРІПЛЕННЯ

Наприкінці кожного раунду Директор додає на мапу нових ворогів. Нова група повинна мати EV, що дорівнює сумарному EV усіх ворогів, убитих у цьому раунді, плюс EV одного героя. Якщо Директор не витрачає весь доступний EV за раунд, залишок можна додати до наступного раунду.

Підкріплення зʼявляються щонайменше за 10 клітинок від оборонної позиції.`,
		difficultyModifier: 'Складність сутички на стримування визначається істотами, присутніми на полі бою на початку першого раунду бою. Не враховуйте підкріплення при визначенні складності. Сутичка стає на один щабель складнішою, якщо її тривалість становить 5 раундів або більше.',
		successCondition: 'Герої перемагають, якщо переживають усю тривалість сутички й пропускають через оборонну позицію менше істот, ніж кількість самих героїв.',
		failureCondition: 'Герої не отримують Перемог, якщо через оборонну позицію проривається кількість істот, що дорівнює або перевищує кількість героїв.',
		victories: 'Герої отримують 1 Перемогу, якщо виконано умову успіху. Вони отримують 2 Перемоги, якщо умову успіху виконано, а бойова сутичка має екстремальну складність або герої стримують ворога протягом 5 раундів чи довше.'
	};

	static assaultDefenses: EncounterObjective = {
		id: 'assault-defenses',
		name: 'Штурмуйте оборону',
		description: `
Ворог утримує стратегічно важливу позицію, і герої хочуть заволодіти нею. Це дзеркальне відображення сутички на стримування: тепер герої мають захопити оборонну позицію ворога. Сутичка завершується, коли герої закріплюються на ній. І ті вороги навряд чи кинуться відбивати її навмання, адже щойно самі тримали цю позицію.

Іноді штурм оборони є частиною комбінованої цілі. Спочатку треба взяти позицію штурмом, а потім вистояти проти контратаки.

### ОБОРОННА ПОЗИЦІЯ

Директор обирає оборонну позицію - ділянку, яку герої мають захопити. Вона може бути будь-якого розміру. Не всі вороги героїв обовʼязково перебувають на цій позиції; частина з них може бути зовні й намагатися зупинити героїв ще до наближення.

Часто оборонна позиція дає своїм захисникам бонуси. Підхід до неї може бути вузьким, пролягати через важкопрохідну місцевість або вимагати лазіння, а ті, хто стоїть усередині, можуть мати перевагу висоти над тими, хто зовні.`,
		difficultyModifier: 'Сутичка на штурм оборони стає на один щабель складнішою, якщо оборонна позиція дає своїм захисникам два або більше бонусів.',
		successCondition: 'Герої перемагають, коли щонайменше один герой і жоден ворог не перебувають на оборонній позиції протягом чотирьох послідовних ходів.',
		failureCondition: 'Герої зазнають поразки лише тоді, коли не можуть виконати умову успіху.',
		victories: 'Герої отримують 1 Перемогу, якщо виконано умову успіху, або 2 Перемоги, якщо умову успіху виконано, а сутичка після коригування цією ціллю має складну або екстремальну складність.'
	};

	static stopAction: EncounterObjective = {
		id: 'stop-action',
		name: 'Зупиніть дію',
		description: `
Іноді бій ускладнюється тим, що героям треба зупинити лиходійські дії ворогів. Просто перемогти воїнів культу недостатньо - треба ще й зірвати ритуал виклику архідиявола. Або героям потрібно перервати весілля й не дозволити злому магу одружитися зі спадкоємцем трону. Попри бій, маг силує церемонію тривати далі. Цілі з цієї категорії часто мають таймер. Якщо герої не досягають мети за певну кількість раундів, умови бою нерідко змінюються. Наприклад, якщо культисти все ж викликають архідиявола, перемога над ним раптом стає новою метою героїв.

### ТРИВАЛІСТЬ СУТИЧКИ

Директор визначає тривалість сутички - кількість раундів до того, як лиходії завершать свій задум. Типова тривалість такої сутички - 3 раунди. Іноді події можуть її змінити. Успіх на складному тесті Розуму, що ставить під сумнів законність весілля, збільшує тривалість на 1, а якщо дозволити фанатикам принести невинну істоту в жертву в межах ритуалу, вона зменшується на 1.

### ЗУПИНКА ДІЇ

Лиходійський задум має певні вимоги, і якщо їх не виконано, дію зупинено, а герої перемагають. Наприклад, щоб завершити ритуал, у кожному раунді бодай один фанатичний жрець має витрачати дію на його просування. Весілля ж не може відбутися, якщо когось із учасників чи того, хто проводить церемонію, убито або захоплено.

### НАСЛІДКИ ПРОВАЛУ

Якщо задум лиходіїв вдається, у межах сутички можуть настати додаткові наслідки. Наприклад, якщо фанатики викличуть демона або якщо щойно коронований злий маг скористається новою королівською владою, щоб покликати варту, герої можуть зіткнутися з додатковими ворогами. Таке можливе підкріплення не враховується в складності сутички, бо воно зʼявляється лише після провалу героїв. Після цього починається вже зовсім інша битва.`,
		difficultyModifier: 'Сутичка на зупинку дії стає на один щабель складнішою, якщо її тривалість дорівнює 2 раундам або менше, і на один щабель легшою, якщо дію можна зупинити, убивши або усунувши будь-яку одну істоту.',
		successCondition: 'Герої перемагають, якщо зупиняють дію до завершення тривалості сутички.',
		failureCondition: 'Герої не отримують Перемог, якщо не встигають зупинити дію до кінця тривалості сутички. Вони все ще можуть отримати Перемоги за будь-які нові сутички, що виникають як наслідок провалу.',
		victories: 'Герої отримують 1 Перемогу, якщо виконано умову успіху, або 2 Перемоги, якщо умову успіху виконано, а бойова сутичка має екстремальну складність або герої зупиняють дію до останнього раунду її тривалості.'
	};

	static completeAction: EncounterObjective = {
		id: 'complete-action',
		name: 'Завершіть дію',
		description: `
Це протилежність сутичці на зупинку дії: тут персонажі самі мають ініціювати подію, провести ритуал тощо. Наприклад, якщо герої намагаються запустити повітряний корабель, одночасно відбиваючись від абордажної групи часових рейдерів, сутичка може завершитися в ту мить, коли героям вдасться активувати судно й злетіти, навіть якщо на борту залишиться лише кілька ворогів.

### ТРИВАЛІСТЬ СУТИЧКИ

Директор визначає тривалість сутички - кількість раундів, перш ніж герої зможуть завершити свій задум. Типова тривалість такої сутички - 3 раунди.

### ЗАВДАННЯ ТА ПРОВАЛИ

У кожному раунді щонайменше половина героїв повинна витратити маневр на виконання завдання, яке просуває їхній задум. Щоразу Директор вирішує, які саме завдання доступні та де їх треба виконувати. Наприклад, щоб підняти в повітря корабель, одному герою може знадобитися відчепити якір на палубі, а іншому - розгорнути вітрило нагорі щогли. Перелік доступних завдань може змінюватися щораунду.

Якщо наприкінці раунду герої не виконали потрібну кількість завдань, група накопичує один провал.

У складніших сутичках виконання завдання може вимагати успішного тесту.`,
		difficultyModifier: 'Сутичка на завершення дії стає на один щабель складнішою, якщо її тривалість становить 5 раундів або більше, або якщо виконання завдань потребує успішного тесту. Вона стає на один щабель легшою, якщо її тривалість становить 2 раунди або менше.',
		successCondition: 'Герої перемагають, якщо доживають до кінця тривалості сутички з 1 або 0 провалами.',
		failureCondition: 'Герої не отримують Перемог і не можуть завершити дію, якщо накопичують 2 або більше провалів протягом тривалості сутички.',
		victories: 'Герої отримують 1 Перемогу, якщо виконано умову успіху, або 2 Перемоги, якщо умову успіху виконано, а бойова сутичка після коригування цією ціллю має екстремальну складність або герої доходять до кінця її тривалості без жодного провалу.'
	};
}
