import { Characteristic } from '@/enums/characteristic';
import { FactoryLogic } from '@/logic/factory-logic';

export class ProjectData {
    static buildAirship = FactoryLogic.createProject({
        id: 'project-build-airship',
        name: 'Побудувати повітряний корабель',
        description: `
Коли ви починаєте цей проєкт, ви наймаєте команду теслярів, магів і корабельників, які працюють у місцевості, де ведеться проєкт, і будують для вас корабель. Ви можете робити кидок проєкту щоразу, коли наглядаєте за проєктом; за допомогою магії або псіоніки, можливо, навіть віддалено.

Коли проєкт завершено, ви отримуєте повітряний корабель. Ви та будь-які істоти, яких ви призначите, можете керувати кораблем, торкаючись його штурвала. Під час бою істота, яка торкається штурвала, може використати маневр, щоб перемістити корабель на відстань до 10 клітинок. Корабель можна перемістити лише раз за раунд. Поза боєм швидкість корабля становить 130 миль на день.

Повітряний корабель є обʼєктом, а отже має імунітет до отруйної та психічної шкоди, і може витримати 200 шкоди, перш ніж буде знищений. Якщо ушкодження корабля не надто серйозні (на розсуд Директора), то за наявності матеріалів для ремонту ви можете відновити його до первісного стану як дію перепочинку.`,
        prerequisites: 'Вітряний кристал Квінтесенції',
        source: 'Тексти або знання мовою Низький Ривіан (Low Rhyvian)',
        characteristic: [Characteristic.Might, Characteristic.Reason, Characteristic.Presence],
        goal: 3000
    });

    static buildRoad = FactoryLogic.createProject({
        id: 'project-build-road',
        name: 'Побудувати або відремонтувати дорогу',
        description: `
Коли ви починаєте цей проєкт, ви наймаєте бригаду каменярів, інженерів і охоронців, які беруться до роботи там, де починається проєкт, і будують або ремонтують для вас дорогу. Ви можете робити кидок проєкту щоразу, коли наглядаєте за проєктом, особисто чи віддалено за допомогою магії або псіоніки.

Кількість очок проєкту, потрібних для завершення роботи над дорогою, дорівнює 10 × довжині дороги в милях. Мета зменшується вдвічі, якщо ви ремонтуєте наявну дорогу або якщо хтось інший починає роботу над другим дорожнім проєктом, який сполучається з вашим.

Коли ви завершуєте проєкт, ви здобуваєте Відомість серед людей у місцевості, де прокладено дорогу, залежно від її довжини.

| Проєкт            | Отримана Відомість |
|:------------------|:-------------------|
| 50 миль або менше | 1                  |
| 51-100 миль       | 2                  |
| Понад 100 миль    | 3                  |

Час подорожі між локаціями цією дорогою скорочується вдвічі. Доступ до ресурсів і знань у місцях уздовж дороги покращується, даючи вам і вашим союзникам перевагу на кидки проєкту для дослідження знань, поки ви перебуваєте в цих місцевостях.`,
        prerequisites: 'Три грамоти схвалення: від гільдії інженерів, гільдії каменярів і гільдії охоронців',
        source: 'Тексти або знання мовою Келіан (Caelian)',
        characteristic: [Characteristic.Might, Characteristic.Reason, Characteristic.Presence]
    });

    static craftTeleportationPlatform = FactoryLogic.createProject({
        id: 'project-craft-teleportation-platform',
        name: 'Створити платформу телепортації',
        description: `
Коли ви завершуєте цей проєкт, ви отримуєте платформу телепортації розміром 3 на 3 клітинки, що активується надприродним паролем. Платформа назавжди закріплена в землі в місці, де ви її створили. Будь-яка істота, яка знає пароль, може використати платформу телепортації, щоб миттєво перемістити будь-яких істот або обʼєкти на платформі в знайоме їй місце, зокрема на іншу платформу телепортації, надприродний пароль якої їй відомий. Ви та будь-яка істота, яку ви призначите після завершення діяльності, можете змінити пароль як дію перепочинку.

Щоразу, коли платформа телепортації використовується, імовірність її збою та перенесення істот або обʼєктів на ній до випадкової платформи зростає на 1 відсоток (до максимуму 50 відсотків). Ви можете відновити платформу до первісного стану й скинути цю ймовірність збою як дію перепочинку.`,
        prerequisites: 'Один просторовий навігатор',
        source: 'Тексти або знання мовою Волл (Voll)',
        characteristic: [Characteristic.Reason],
        goal: 1500
    });

    static findCure = FactoryLogic.createProject({
        id: 'project-find-cure',
        name: 'Знайти ліки',
        description: `
Ви досліджуєте ліки від хвороби, прокляття або надприродного ураження, у тексті якого сказано, що його можна завершити через проєкт відпочинку «Знайти ліки». Якщо ураження спричинене вродженою рисою істоти, вам потрібні рештки цієї істоти або іншої істоти того самого виду як передумова-предмет для виготовлення ліків. Наприклад, ви можете дослідити лікування ураження від укусу перевертня Accursed Bite, вивчаючи труп будь-якого перевертня, а не лише того, який завдав укусу.

Кількість очок проєкту, потрібна для завершення цього проєкту, дорівнює 50, помноженим на рівень істоти, що спричинила ураження. Якщо ураження створене природним або надприродним ефектом, цей ефект указує передумову-предмет і кількість очок проєкту, потрібних для завершення цього проєкту.

Коли ви завершуєте цей проєкт, ви виготовляєте одну дозу алхімічних ліків від ураження. Після завершення проєкту ви можете виготовляти наступні дози для того самого ураження за половину кількості очок проєкту, потрібної для початкового проєкту.`,
        prerequisites: 'Залежить від обставин (див. опис)',
        characteristic: [Characteristic.Reason, Characteristic.Intuition]
    });

    static discoverLore = FactoryLogic.createProject({
        id: 'project-discover-lore',
        name: 'Дослідити знання',
        description: `
Якщо ви хочете вистежити місцезнаходження загубленого скарбу, розшифрувати ритуал або простежити родовід королівської родини, щоб знайти наступного спадкоємця трону, ви можете розпочати проєкт відпочинку, щоб заглибитися в таємниці, які прагнете розкрити. Ви можете почати цей проєкт, бо потрібну інформацію неможливо здобути одним випробуванням, або тому, що ви провалили випробування на пригадування інформації й тепер хочете вивчити її через дослідження.

Коли ви починаєте проєкт відпочинку «Дослідити знання», ви обираєте знання, яке хочете дослідити, і запитання, на які бажаєте отримати відповіді. Директор повідомляє, чи належить знання, яке ви шукаєте, до загальновідомого, маловідомого, втраченого чи забороненого. Що більш езотеричними є знання, то більше очок проєкту потрібно, щоб знайти відповіді.

| Проєкт                | Мета |
|:----------------------|:-----|
| Загальновідомі знання | 15   |
| Маловідомі знання     | 45   |
| Втрачені знання       | 120  |
| Заборонені знання     | 240  |

**Загальновідомі знання**: Загальновідомі знання зазвичай легко відшукати за день або близько того досліджень. Їх не знає кожен перехожий, і на пошук потрібен час, але за наявності численних місцевих джерел вам не доведеться довго шукати. Можливо, вам доведеться розпитати кількох поширювачів чуток, щоб зʼясувати, за ким таємно, хоча й не надто, упадає якийсь дворянин, або провести кілька годин у храмі, щоб знайти конкретний релігійний текст, де божество назване рідковживаним альтернативним іменем.

**Маловідомі знання**: Маловідомі знання відомі лише спеціалізованим мудрецям і зазвичай цікавлять тільки таких дослідників. Через це про маловідомі теми написано дуже мало цінних томів. Щоб знайти потрібного експерта для розмови або найкращу книжку, зазвичай потрібні кілька днів дослідження. Зʼясувати деталі ритуалу, яким відкривають і закривають портал до Моря Зірок, нелегко, але є люди, які знають, як це робити, і записали ці вказівки.

**Втрачені знання**: Втрачені знання настільки езотеричні, що навіть серед найвідданіших учених певної галузі може бути лише одна-дві особи, які копнули достатньо глибоко, щоб їх знати. Такі знання можуть походити з настільки давніх часів, що нині їх зберігає лише один текст мертвою мовою. Пошук таких знань часто займає понад тиждень. Місцезнаходження майстерні легендарного сталевого дварфа, найімовірніше, належить саме до втрачених знань, окрім випадку з однією картою, схованою в приватній колекції.

**Заборонені знання**: Заборонені знання - це відомості, які впливова особа чи організація намагається приховати. Ті, хто знає ці таємниці, говорять про них пошепки шифрованими кодами після обміну паролями й пишуть тексти шифром. Полювання за зачіпками та їх розшифрування зазвичай займають тижні. Місцезнаходження кинджала, яким перерізали горло богу смерті, сховане за шарами закодованого тексту та записане мертвою мовою, відомою лише найвідданішим послідовникам цього бога.`,
        source: 'Тексти або знання, повʼязані з темою, яку ви хочете дослідити',
        characteristic: [Characteristic.Reason]
    });

    static goUndercover = FactoryLogic.createProject({
        id: 'project-go-undercover',
        name: 'Працювати під прикриттям',
        description: `
Працювати під прикриттям, щоб шпигувати за групою людей, - дешевий і простий спосіб отримати потрібну інформацію. Коли ви беретеся за цю діяльність, оберіть організацію. Завершення цього проєкту надає вам доступ до мап, знань про діяльність організації або іншого знання, яке вважалося б загальновідомим чи маловідомим (див. проєкт «Дослідити знання»).

На розсуд Директора для початку цього проєкту вам може знадобитися маскування, печатка-перстень, особливе татуювання або інша ознака належності до організації. Крім того, Директор може вирішити, що знання, які ви шукаєте, неможливо здобути через цей проєкт і їх доведеться шукати, проникаючи в організацію як частину пригоди.

**Ускладнення**: Цей проєкт має власні особливі ускладнення. Першого разу, коли ви завершуєте цей проєкт для певної організації, у вас є 25-відсотковий шанс бути викритим. Щоразу, коли ви знову завершуєте цей проєкт для тієї самої організації, шанс бути викритим зростає на 25 відсотків, а мета проєкту збільшується на 30. Якщо вас викрито під час роботи під прикриттям, члени організації безжально переслідують вас так, як визначить Директор.

Крім того, поки ви працюєте над завершенням цього проєкту, організація може доручити вам завдання, яке ви не хотіли б виконувати. Невиконання цього завдання призводить до викриття. Ви можете уникнути завдання, втікши з організації, але це завадить завершити проєкт і зробить неможливим повторне проходження цього проєкту з тією самою організацією.`,
        prerequisites: 'Особливе',
        characteristic: [Characteristic.Intuition, Characteristic.Presence],
        goal: 15
    });

    static honeCareerSkills = FactoryLogic.createProject({
        id: 'project-home-career-skills',
        name: 'Відточити карʼєрні навички',
        description: `
Ви повертаєтеся думками до свого колишнього життя, щоб освіжити досвід, який воно вам дало. Коли цей проєкт завершено, ви отримуєте перевагу на випробування, що виконуються з використанням навичок, наданих вашою карʼєрою.

Мета проєкту становить 240, якщо ваша карʼєра дала вам дві навички, або 360, якщо вона дала вам три навички.`,
        characteristic: [Characteristic.Intuition],
        goal: 0
    });

    static learnFromMaster = FactoryLogic.createProject({
        id: 'project-learn-from-a-master',
        name: 'Навчатися у майстра',
        description: `
Коли ви прагнете навчатися у майстра, ви обираєте мету, над якою хочете працювати, а також вигоду, яку хочете отримати. Директор повідомляє, чи здатен майстер або залишені ним матеріали навчити вас того, чого ви хочете.

| Проєкт              | Мета  |
|:--------------------|:------|
| Відточити здібність | 120   |
| Покращити контроль  | 500   |
| Отримати здібність  | 1 000 |

**Отримати здібність**: Ви здобуваєте одну фірмову здібність на свій вибір з класу майстра, а якщо майстер належить до того самого класу, що й ви, то здобуваєте другу фірмову здібність. Якщо майстер є Тактиком, ви можете натомість здобути здібність Strike Now. Ви не можете отримати цю вигоду знову для того самого класу.

**Відточити здібність**: Ви підвищуєте ефективність однієї своєї здібності на вибір. Оберіть одне: додати до здібності бонус шкоди +1/+1/+1 або збільшити дальність дальньої здібності на 2. У такий спосіб здібність можна відточити лише один раз.

**Покращити контроль**: Ви вчитеся ефективніше використовувати одну зі своїх героїчних здібностей, зменшуючи її базову вартість героїчного ресурсу на 1 (мінімум до 1). У такий спосіб здібність можна покращити лише один раз.`,
        source: 'NPC вищого рівня або записи про вчення такого NPC мовою, яку ви знаєте',
        characteristic: [Characteristic.Might, Characteristic.Agility, Characteristic.Reason, Characteristic.Intuition, Characteristic.Presence]
    });

    static learnNewLanguage = FactoryLogic.createProject({
        id: 'project-learn-new-language',
        name: 'Вивчити нову мову',
        description: 'Коли ви починаєте цей проєкт, оберіть мову, якої навчає джерело проєкту. Коли проєкт завершено, ви розумієте цю мову.',
        source: 'Тексти або настанови для вивчення мови, яку ви хочете опанувати',
        characteristic: [Characteristic.Reason, Characteristic.Intuition],
        goal: 120
    });

    static learnNewSkill = FactoryLogic.createProject({
        id: 'project-learn-new-skill',
        name: 'Вивчити нову навичку',
        description: 'Коли ви починаєте цей проєкт, оберіть навичку, якої навчає джерело проєкту. Коли проєкт завершено, ви отримуєте цю навичку.',
        source: 'Тексти або настанови для набуття потрібної вам навички',
        characteristic: [Characteristic.Reason, Characteristic.Intuition],
        goal: 120
    });

    static perfectNewRecipe = FactoryLogic.createProject({
        id: 'project-learn-new-recipe',
        name: 'Удосконалити новий рецепт',
        description: `
Коли ви починаєте цей проєкт, ви обираєте рецепт певного виду страви. Передумовою-предметом для проєкту є потрібні інгредієнти, які залежать від рецепта й можуть бути важкодоступними залежно від рецепта та місця його походження. Ви отримуєте бонус +3 до кидка проєкту, якщо рецепт походить з вашої культури.

Коли ви завершуєте проєкт, ви можете як дію перепочинку приготувати за цим рецептом пʼять порцій їжі, щойно матимете доступ до інгредієнтів. Ви та інші істоти, які беруть перепочинок разом із вами, можете зʼїсти по порції та отримати її переваги (див. нижче).

Істота, яка зʼїдає порцію їжі певного типу рецепта, отримує зазначену перевагу, що триває, доки істота не візьме інший перепочинок.

| Тип рецепта             | Передумови-предмети                                              | Перевага                                                                                                                                      |
|:------------------------|:-----------------------------------------------------------------|:----------------------------------------------------------------------------------------------------------------------------------------------|
| Сучасний                | Звичайні інгредієнти (борошно, морква, яловичина тощо)           | Ситний: Наприкінці перепочинку, під час якого їжу було спожито, істота збільшує свої Відновлення на 1.                                     |
| Старовинний або домашній | Ключові інгредієнти (зореплід, жаронасіння, веслориба тощо)      | Втішний: Коли істота провалює рят. кидок, вона може натомість обрати успіх. Після цього перевага завершується.                             |
| Давній або втрачений    | Рідкісні або вимерлі інгредієнти (медолілії, сталеві яблука тощо) | Надприродна сила: Істота тимчасово збільшує один зі своїх показників характеристики на 1 (до максимуму 6).                                 |`,
        prerequisites: 'Залежить від обставин',
        source: 'Рецепт мовою, яку ви знаєте, або хтось, хто може навчити вас цього рецепта',
        characteristic: [Characteristic.Reason, Characteristic.Intuition],
        goal: 100
    });

    static communityService = FactoryLogic.createProject({
        id: 'project-community-service',
        name: 'Громадська служба',
        description: `
Коли ви починаєте цей проєкт, ви маєте перебувати в поселенні чи іншому місці, де збираються люди, і щоразу, коли робите кидок проєкту для цього проєкту, мусите бути в тому самому місці. Ви можете одночасно виконувати кілька проєктів «Громадська служба», але кожен із них має належати іншій спільноті.

Поки ви виконуєте цей проєкт, ви допомагаєте людям у скруті: беретеся за дрібні доручення, навчаєте життєвих навичок, прибираєте вулиці чи громадські місця, знаходите загублені цінності тощо. Директор визначає характеристику, що застосовується до кидка проєкту, залежно від того, чим саме ви займаєтеся. Коли ви завершуєте цей проєкт, хтось зі спільноти дарує вам випадковий витратний скарб на вибір Директора на знак вдячності за вашу працю.`,
        characteristic: [Characteristic.Might, Characteristic.Agility, Characteristic.Reason, Characteristic.Intuition, Characteristic.Presence],
        goal: 75
    });

    static fishing = FactoryLogic.createProject({
        id: 'project-fishing',
        name: 'Риболовля',
        description: `
Хоч заради прожитку, відпочинку чи права похизуватися, ви йдете рибалити, якщо перебуваєте поруч із водоймою. Кидок проєкту для цього проєкту має такі зміни:

* Очки проєкту, отримані за вашим кидком, відображають відносний розмір риби або іншої рибоподібної істоти, яку ви спіймали.
* Під час кожного перепочинку, коли ви займаєтеся цією діяльністю, ви продовжуєте робити кидки проєкту, доки не отримаєте результат 1-го рівня, що означає, що риба зірвалася і ви не отримуєте очок, або прорив.
* Коли ви отримуєте прорив, Директор кидає на таблиці «Рибальські події» замість того, щоб ви отримали очки за кидок і зробили ще один кидок проєкту.
* Після того як ви зробите останній кидок проєкту на риболовлю під час цього перепочинку, ви можете витратити накопичені очки проєкту на нагороду з таблиці «Снасті». Усі очки, які ви не витратите під час поточного перепочинку, втрачаються.

**Снасті**

| Нагорода                 | Вартість | Ефект                                                                                                                                                                                                                                                                                                                                                                                                        |
|:-------------------------|:---------|:--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Ситна страва (1 порція)  | 50       | Істота, яка зʼїдає порцію страви, приготованої з риби, спійманої під час проєкту, збільшує свої Відновлення на 1 до кінця наступного перепочинку. Істота може одночасно отримувати користь лише від однієї порції цієї страви або іншої подібної до неї, наприклад із проєкту «Удосконалити новий рецепт».                                 |
| Чудова страва (1 порція) | 100      | Істота, яка зʼїдає порцію страви, приготованої з риби, спійманої під час проєкту, збільшує свої Відновлення на 1 до кінця наступного перепочинку, а також отримує 10 тимчасової Витривалості до кінця наступного перепочинку, якщо не втратить її раніше. Істота може одночасно отримувати користь лише від однієї такої страви. |
| Кращі снасті             | 120      | Ви отримуєте титул **Angler**.                                                                                                                                                                                                                                                                                                                                                                                |
| Рибальська подія         | 200      | Ви кидаєте на таблиці «Рибальські події».                                                                                                                                                                                                                                                                                                                                                                     |
| Легендарний рибалка      | 300      | Ви отримуєте титул **Goldenrod**.                                                                                                                                                                                                                                                                                                                                                                             |

**Рибальські події**

| d10  | Подія                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
|:-----|:-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 1    | Під час риболовлі герой витягує балакучу рибу. Риба повідомляє героєві про будь-які події, що сталися в межах 10 клітинок від водойми, де її спіймали, протягом останнього тижня, або надає один фрагмент заборонених знань, як визначить Директор (див. проєкт «Дослідити знання»).                                                                                                                                                                                                                                                                                                                                                             |
| 2    | Під час риболовлі герой витягує записку в пляшці. Записка написана мовою Анжалі (Anjali), і якщо прочитати її вголос, читач укладає угоду з могутнім дияволом. Натомість диявол отримує право власності на душу читача, а читач кидає додатковий d10 на всі майбутні кидки проєкту на риболовлю.                                                                                                                                                                                                                                                                                                                                                |
| 3    | Поки герой рибалить, перехожі повідомляють йому чутку про чарівну вудку, що дозволяє рибалці подвоїти розмір риби, яку той витягує. Директор може вирішити, чи правдива ця чутка, і якщо так, то де можна знайти вудку.                                                                                                                                                                                                                                                                                                                                                                                                                                   |
| 4    | Під час риболовлі герой витягує **Angulotl Daybringer** (див. Draw Steel: Monsters). Ангулотл ображається на те, що його спіймали, і погрожує накликати люті грози та втопити місцевість у повені. Утім, з ним можна вести переговори, і він може пригостити героя однією порцією дивовижної страви, якщо зберегти добрі стосунки. Істота, яка зʼїдає порцію цієї страви, збільшує свої Відновлення на 1 до кінця наступного перепочинку й отримує 25 тимчасової Витривалості до кінця наступного перепочинку, якщо не втратить її раніше. Істота може одночасно отримувати користь лише від однієї такої страви. |
| 5    | Під час риболовлі герой витягує половину таємничого давнього скарбу на вибір Директора. Якщо знайти іншу половину, обидві частини магічно зіллються, відновивши скарб.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
| 6    | Під час риболовлі героя підбадьорюють теплі спогади про прожите життя. Він отримує перевагу на випробування Присутності до кінця наступного перепочинку.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |
| 7    | Герой досягає нової рибальської віхи й отримує титул **Master of Reels**.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        |
| 8    | Під час риболовлі герой занурюється в розслаблювальну медитацію, що дає автоматичний прорив в іншому проєкті, над яким він працює. Або ж він отримує осяяння, яке дає автоматичний прорив у проєкті іншого героя на його вибір.                                                                                                                                                                                                                                                                                                                                                                                                                              |
| 9    | Під час риболовлі героя затягує у воду давня риба, і він мусить пройти складне випробування Сили. У разі успіху герой витягує велетенську рибу вартістю 100 очок. У разі невдачі він завершує поточний перепочинок із на 1 менше Відновлення, ніж зазвичай. У разі успіху з ускладненням герой отримує обидва результати.                                                                                                                                                                                                                                                                                                                             |
| 10   | Під час риболовлі герой помічає щось схоже на підводну печеру. Якщо її дослідити, там виявиться скарб на вибір Директора, який стереже лицар-ревенант, що виконує свій обовʼязок до повернення капітана.                                                                                                                                                                                                                                                                                                                                                                                                                                                       |`,
        characteristic: [Characteristic.Agility, Characteristic.Reason, Characteristic.Intuition]
    });

    static spendTimeWithLovedOnes = FactoryLogic.createProject({
        id: 'project-spend-time-with-loved-ones',
        name: 'Провести час із близькими',
        description: 'Ви відновлюєте дух, проводячи час із людьми, яких любите й яких давно не бачили. Щоб узятися за цей проєкт або робити для нього кидки проєкту, ви маєте бути здатні спілкуватися з цими людьми. Коли ви завершуєте цей проєкт, максимум вашої Витривалості зростає на 12 + ваш рівень до кінця наступного перепочинку, і ви не можете почати ще один проєкт «Провести час із близькими» протягом місяця.',
        characteristic: [Characteristic.Presence],
        goal: 60
    });
}