import { RulesItem } from '@/models/rules-item';

export class RulesData {
	static abilityDistance: RulesItem = {
		label: 'Відстань здібності',
		content: `
У полі «Відстань» здібності вказано, на якій відстані від істоти чи об’єкта ви повинні перебувати, щоб застосувати цю здібність до цієї цілі.

**Ближній бій**: Здібності ближнього бою мають відстань «Ближній бій X» і вимагають, щоб ви контактували з істотою чи об’єктом своїм тілом, зброєю або знаряддям. Число X — це максимальна відстань у клітинках, на якій ви можете фізично контактувати з іншою істотою чи об’єктом, на який спрямована здібність. Наприклад, відстань «Ближній бій 2» можна використовувати для цілей у межах 2 клітинок від вас, тоді як «Ближній бій 1» обмежує вас суміжними цілями (ті, що в межах 1 клітинки).

**Дальній бій**: Здібності дальнього бою мають відстань «Дальній бій X» і можуть використовуватися для цілей, що занадто далеко, щоб ви могли контактувати з ними. Число X — це максимальна відстань у клітинках, на якій істота чи об’єкт може бути ціллю здібності. Наприклад, відстань «Дальній бій 5» можна використовувати для цілей у межах 5 клітинок від вас.

Якщо ви робите дальній удар, коли будь-який ворог знаходиться поруч з вами (в межах 1 клітинки), у вас є прокляття на кидок сили удару.

**Ближній або дальній бій**: Деякі здібності мають відстань як для ближнього, так і для дальнього бою. Коли ви використовуєте таку здібність, ви обираєте, чи використовувати її як здібність ближнього бою, чи як здібність дальнього бою.

Здібність ніколи не має одночасно ключових слів «Ближній бій» і «Дальній бій». Наприклад, якщо у вас є набір «Плащ і кинджал», який дає бонус до шкоди зброї для здібностей ближнього бою та бонус до шкоди зброї для здібностей дальнього бою, одночасно застосовується лише один бонус до здібності з обома ключовими словами.

**Сам**: Якщо здібність має відстань «Сам», ця здібність виходить від вас і часто впливає лише на вас. Опис здібності уточнює, як вона працює.

**Здібності з областю дії**: Здібності з областю дії охоплюють кілька клітинок на полі бою одночасно, створюючи ефект у цій області, що дозволяє вам націлюватися на кілька істот або об’єктів. Коли здібність створює область дії, вона іноді зазначає відстань для ефекту у формі «в межах X». Число X вказує, на скільки клітинок від вас може бути область. Якщо здібність з областю дії не має цієї відстані, вона виходить від вас, і ви перебуваєте в центрі області.

Якщо здібність з областю дії виходить на відстані від вас, тоді одна клітинка області дії повинна бути в межах цієї відстані і також повинна бути в межах вашої лінії ефекту (див. нижче). Ця клітинка називається вихідною клітинкою області дії. Область дії може поширюватися від вихідної клітинки так, як ви обираєте, відповідно до правил для форми та розташування цієї конкретної області.

Ви можете розмістити область дії так, щоб включити одну або кілька клітинок, де у вас немає лінії ефекту, за умови, що у вас є лінія ефекту до вихідної клітинки. Якщо не зазначено інше, здібності з областю дії не проходять через тверді перешкоди, такі як стіни або стелі, і не поширюються за кутами.

Здібність з областю дії може використовувати будь-яку з наступних форм області дії.

* **Aura**: Коли здібність створює ауру, ця область виражається як «X aura». Число X — це радіус аури, яка завжди виходить від вас і рухається разом з вами протягом дії здібності, яка її створила. Істота або об’єкт повинні знаходитися в межах X клітинок від вас, щоб бути ціллю здібності аури.
* **Burst**: Коли здібність створює область вибуху, ця область виражається як «X burst». Число X — це радіус вибуху, який завжди виходить від вас і триває лише стільки, скільки потрібно, щоб вплинути на його цілі. Істота або об’єкт повинні знаходитися в межах X клітинок від вас, щоб бути ціллю здібності вибуху.
* **Cube**: Коли здібність впливає на кубічну область, ця область виражається як «X cube». Число X — це довжина кожної сторони області. Істота або об’єкт повинні знаходитися в межах області, щоб бути ціллю здібності куба.
* **Line**: Коли здібність впливає на лінійну область, ця область виражається як «A × B line». Число A позначає довжину лінії в клітинках, а число B дорівнює ширині та висоті лінії в клітинках. Коли ви створюєте лінійну область дії, клітинки в цій області повинні бути в прямій лінії. Істота або об’єкт повинні знаходитися в межах області, щоб бути ціллю здібності лінії.
* **Wall**: Коли здібність створює стіну, ця область виражається як «X wall». Число X — це кількість клітинок, які використовуються для створення стіни. Коли ви розміщуєте стіну, ви можете будувати її по одній клітинці за раз, але кожна клітинка повинна ділити принаймні одну сторону (не лише кут) з іншою клітинкою стіни. Істота або об’єкт повинні знаходитися в межах області, щоб бути ціллю здібності стіни. Ви можете накладати клітинки одна на одну, щоб зробити стіну вищою. Якщо не зазначено інше, стіну не можна розміщувати в зайнятих клітинках, і стіна блокує лінію ефекту.
* **Special**: Деякі здібності створюють унікальну область дії. Відстань такої здібності вказує, як створюється область.`
	};

	static abilityTarget: RulesItem = {
		label: 'Ціль здібності',
		content: `
У розділі «Ціль» опису здібності вказано кількість істот, об’єктів або й тих, і інших, на яких може діяти ця здібність. Ви завжди можете впливати на меншу кількість цілей, ніж зазначено в цьому розділі.

**Істота**: Якщо здібність націлюється на одну або кілька істот, вона може впливати на істот у межах відстані або області дії здібності. Ви не є допустимою ціллю для своїх власних здібностей, якщо ці здібності також не мають «self» як ціль (див. нижче), або якщо здібність не вказує інше.

**Об’єкт**: Якщо здібність націлюється на один або кілька об’єктів, вона може впливати на будь-який об’єкт у межах відстані або області дії здібності. Якщо не зазначено інше, об’єкти мають імунітет до отрути та психічний імунітет.

Коли здібність може націлюватися на істот і об’єкти, здібність може завдавати шкоди об’єктам. Однак, якщо не зазначено інше (як у випадку з здібністю Minor Telekinesis таланту) або якщо Директор дозволяє, об’єкти мають імунітет до інших ефектів здібності. Якщо здібність змушує об’єкт проходити тест, об’єкт автоматично отримує результат 1 рівня на тесті.

**Ворог**: Якщо здібність націлюється на одного або кількох ворогів, вона може впливати лише на істот, які ворожі до істоти, що використовує здібність. Зазвичай ви вирішуєте, хто вважається ворогом для використання здібностей вашого героя, хоча остаточне рішення залишається за Директором.

**Союзник**: Якщо здібність націлюється на одного або кількох союзників, вона може впливати лише на охочих істот, які дружні до істоти, що використовує здібність. Зазвичай ви та будь-який інший гравець, чий персонаж ви націлюєте здібністю, вирішуєте, хто вважається союзником, хоча остаточне рішення залишається за Директором.

Ви не є допустимою ціллю для своїх власних здібностей, які націлюються на союзників, якщо ці здібності також не мають «self» як ціль, або якщо здібність не вказує інше.

**Self**: Якщо здібність націлюється на «self», вона може впливати лише на істоту, що використовує здібність. Ваші власні здібності можуть впливати на вас лише якщо вони націлюються на «self».

**Кожен [Ціль]**: Якщо здібність області не вказує кількість цілей, а замість цього говорить, що вона застосовується до кожної істоти, об’єкта, ворога або союзника в області, тоді всі допустимі цілі для здібності підпадають під її вплив.`
	};

	static assist: RulesItem = {
		label: 'Допомога під час перевірки',
		content: `
Ви можете спробувати допомогти іншій істоті під час її перевірки, за умови, що у вас є відповідна навичка, ця істота не використовує ту саму навичку під час перевірки, і ви зможете описати, як саме ваш персонаж допомагає, так, щоб це задовольнило Керівника. Іншими словами, ваша спроба допомогти має бути логічною, і ви повинні запропонувати якісь корисні знання. Допомога іншій істоті вкрастися шляхом підбадьорення її голосом не зробить її більш непомітною.

Коли ви намагаєтеся допомогти іншій істоті, зробіть перевірку, використовуючи навичку, яку ви обрали, і характеристику, обрану Керівником на основі дії, яку ви використовуєте для допомоги. Результат цієї перевірки визначає бонус, який застосовується до перевірки, яку ви допомагаєте:

| Roll  | Effect |
|:------|:---------|
| ≤ 11  | Ви заважаєте або погіршуєте ситуацію. Істота отримує негативний ефект на свою перевірку.|
|12–16 | Ваша допомога надає іншій істоті перевагу на її перевірку.|
|17+ | Ваша допомога надає іншій істоті подвійний бонус на її перевірку.|

Наприклад, коли союзник намагається вкрасти щось у вартового, ви можете спробувати допомогти, використовуючи навичку Флірт, щоб відволікти вартового. Керівник приймає це і просить вас зробити перевірку Присутності, використовуючи Флірт. Результат цієї перевірки визначає бонус, який ви надаєте іншому герою на перевірку Спритності, щоб вкрасти щось у вартового — або чи ви провалюєте відволікання і потенційно привертаєте увагу до спроби.`
	};

	static burrowing: RulesItem = {
		label: 'Риття',
		content: `
Істота, у характеристиці швидкості якої вказано «ритися», або яка отримує тимчасову здатність ритися, може горизонтально переміщатися крізь ґрунт і або має можливість дихати під час цього, або не потребує повітря для життя. Такі істоти не можуть переміщатися крізь більш твердий ґрунт, наприклад камінь, якщо інше не вказано в їхньому блоці характеристик або в ефекті, що дозволяє їм ритися. Аналогічно, істота, що риється, не залишає тунель, якщо це не передбачено правилами.

**Маневр Риття**: Риття вертикально через ґрунт вимагає додаткових зусиль порівняно з горизонтальним тунелюванням, що потребує від істоти використання спеціального маневру. Щоб використати маневр Риття, істота повинна мати «ритися» у своїй характеристиці швидкості, її швидкість повинна бути рівною або більшою за її розмір, і вона повинна торкатися ґрунту, через який можна ритися.

Коли істота використовує маневр Риття, вона може переміщатися вертикально на кількість клітинок, рівну її розміру. Якщо риюча істота тримає істоту, яка не непритомна, вона не може свідомо рухатися глибше в ґрунт. Риття з борючимся ворогом у лапах занадто складне.

**Націлення на закопаних істот**: Якщо ви на землі, у вас є лінія ефекту до риючої істоти, якщо ця істота займає 1 або більше клітинок ґрунту, через який можна ритися, і які торкаються землі, і якщо у вас є лінія ефекту до будь-якої з цих клітинок. Риюча істота отримує перевагу укриття від вас.

Якщо ви повністю під землею під час риття, у вас немає лінії ефекту до будь-якої істоти на поверхні, якщо інше не зазначено правилами.

Якщо ви повністю під землею під час риття і перебуваєте поруч з іншою істотою, яка риється, у вас є лінія ефекту до цієї істоти, хоча ви обидва маєте укриття один від одного.

Ви не можете отримати перевагу висоти (див. нижче) проти істот, які повністю під землею під час риття.

**Націлення на закопаних істот**: Якщо ви на землі і перебуваєте поруч з істотою, яка знаходиться під землею під час риття, ви можете використати маневр, щоб витягти цю істоту на 1 клітинку з землі, за умови, що істота згодна.

Якщо істота, яка не може ритися, хоче закопатися в землю, вона може використати наступну здатність, якщо її швидкість становить 2 або більше.

**Рити землю**

**Кидок Сили + Might**:
| Roll  | Effect |
|:------|:---------|
| ≤ 11  | Ви можете переміститися на 1 клітинку в, з або через ґрунт, до якого ви торкаєтеся і який можна ритися, і ви сповільнені та ослаблені (кінець ходу).|
|12–16 | Ви можете використати свою основну дію цього ходу, щоб переміститися на 1 клітинку в, з або через ґрунт, до якого ви торкаєтеся і який можна ритися, і ви сповільнені (кінець ходу).|
|17+ | Ви можете переміститися на 1 клітинку в, з або через ґрунт, до якого ви торкаєтеся і який можна ритися.|

**Примусове переміщення під землею**: Якщо істота, яка повністю під землею під час риття, примусово переміщується рухом, який не є вертикальним, вона не переміщується і отримує 1 шкоду за кожну клітинку, на яку її мали б перемістити. Якщо примусове переміщення вертикальне, істота переміщується через ґрунт, як через повітря.`
	};

	static climbingAndSwimming: RulesItem = {
		label: 'Скелелазіння / Плавання',
		content: `
Істота, у записі швидкості якої вказано «climb» (лазіння), або яка тимчасово отримує здатність автоматично лазити, може рухатися по вертикальних і горизонтальних поверхнях зі своєю повною швидкістю. Аналогічно, істота, у записі швидкості якої вказано «swim» (плавання), або яка тимчасово отримує здатність автоматично плавати, може плавати у рідині з повною швидкістю.

Істоти без цих типів пересування все ще можуть лазити або плавати, якщо правило дозволяє їм рухатися, але кожна клітинка лазіння або плавання рахується як 2 клітинки пересування. Якщо поверхня важко прохідна для лазіння (наприклад, стрімка скеля або крижана стіна) або рідина важко проходиться (бурхлива річка або водоворот), Директор може вимагати тесту «Кидок сили + Сила» (Кидок Сили + Might). У разі провалу істота не може успішно лазити або плавати, але не втрачає пересування, витраченого на спробу. Директор також може накласти інші наслідки провалу, наприклад затягування в течію водовороту.

**Лазіння по інших істотах**: Ви можете намагатися залізти на істоту більшого розміру. Якщо істота згодна, ви можете зробити це без ускладнень. Якщо істота не згодна, виконайте наведений нижче тест:

**Кидок сили + Сила або Ловкість**:

| Результат | Ефект |
|:---------|:------|
| ≤ 11     | Ви не долазите до істоти; вона може зробити безкоштовний ближній удар по вам. |
| 12–16    | Ви не долазите до істоти. |
| 17+      | Ви успішно залазите на істоту. |

Поки ви лазите або перебуваєте на істоті, ви отримуєте перевагу (edge) на ближні здібності, спрямовані проти неї. Істота може використати маневр, щоб намагатися скинути вас, що змусить вас пройти наступний тест:

**Кидок сили + Сила або Ловкість**:

| Результат | Ефект |
|:---------|:------|
| ≤ 11     | Ви падаєте з істоти в суміжну незайняту клітинку за вашим вибором, отримуєте пошкодження від падіння і опиняєтесь у положенні «розпластаний» (prone). |
| 12–16    | Ви зісковзуєте з істоти в суміжну незайняту клітинку за вашим вибором і не опиняєтесь у положенні «розпластаний». |
| 17+      | Ви утримуєтесь і залишаєтеся на істоті. |

Якщо вас збивають у положення «розпластаний» під час лазіння або перебування на істоті, ви падаєте і опиняєтеся у положенні «розпластаний» у суміжній клітинці за вашим вибором, отримуючи звичне пошкодження від падіння.`
	};

	static concealment: RulesItem = {
		label: 'Прихованість',
		content: `
Темрява, туман, магія невидимості та будь-який інший ефект, що повністю заважає бачити істоту чи об'єкт, але не захищає їхню фізичну форму, дає цій істоті або об'єкту прихованість. Навіть якщо у вас є лінія ефекту до такої цілі, вона має прихованість від вас, якщо ви не можете її бачити або інакше спостерігати. Ви можете націлити удар (strike) на істоту або об'єкт з прихованістю, якщо вони не ховаються. Однак удари по таких цілях отримують бане (bane).`
	};

	static cover: RulesItem = {
		label: 'Прикриття',
		content: `
Коли у вас є лінія ефекту до істоти або об'єкта, але ця ціль має принаймні половину своєї форми закритою твердим об'єктом (наприклад, деревом, стіною або перекинутим столом), така ціль має прикриття. Ви отримуєте бане (bane) на здібності, що завдають шкоди, застосовані проти істот або об'єктів, які мають прикриття від вас.`
	};

	static crawling: RulesItem = {
		label: 'Повзання',
		content: `
Якщо ви у положенні «розпластаний» (prone), ви можете залишатися розпластаним і повзати по землі. Повзання коштує вам на 1 клітинку пересування більше за кожну клітинку повзання. Якщо ви навмисне хочете опуститися у положення «розпластаний», ви можете зробити це як безкоштовний маневр. Поки ви добровільно розпластані, ви можете встати як безкоштовний маневр.`
	};

	static criticalHit: RulesItem = {
		label: 'Критичний удар',
		content: `
Коли ви робите кидок здібності як основну дію і результат кидка — натуральна 19 або натуральна 20 (тобто підсумок 19 або 20 до додавання бали характеристики чи інших модифікаторів), ви завдаєте критичний удар. Критичний удар дозволяє вам негайно виконати додаткову основну дію після того, як розв'язано кидок сили, незалежно від того, чи це ваш хід, і навіть якщо ви приголомшені (див. розділ «Стани»).

Ви не можете завдати критичного удару кидком здібності, виконаним як маневр або іншим типом дії, але можете отримати критичний удар, використавши основну дію поза своїм ходом (наприклад, можливість атаки як тригерна дія або сигнатурна здібність як безкоштовна тригерна дія).`
	};

	static damagingTerrain: RulesItem = {
		label: 'Шкідлива місцевість',
		content: `
Площі кислоти, вогню, гострих каменів, лави або будь-якої іншої місцевості, що завдає шкоди істотам у ній, вважаються шкідливою місцевістю. Кількість шкоди, яку завдає шкідлива місцевість, зазначається в описі цієї місцевості або в описі ефекту, що її створює.`
	};

	static damageAndEffect: RulesItem = {
		label: 'Шкода та ефект',
		content: `
Удари (strikes) і здібності з областю дії можуть завдавати шкоди та мати додатковий ефект на ціль. Шкода та сила ефекту визначаються кидком сили (power roll).

Щоб прискорити гру та зробити здібності легшими для читання під час гри, шкоду та ефекти розділяють крапкою з комою в записі рівнів кидка сили, а ефекти за можливості скорочують. Ефект, визначений рівнем кидка сили, завжди застосовується до цілі, якщо не зазначено інше. Наприклад, здібність Brutal Slam має такий запис кидка сили:

**Кидок сили + Сила**:

* **11-**: 3 + С шкоди; штовхнути 1
* **12–16**: 6 + С шкоди; штовхнути 2
* **17+**: 9 + С шкоди; штовхнути 4

Якщо не зазначено інше, будь-які ефекти, визначені результатом рівня кидка сили, відбуваються після того, як шкода від кидка була нанесена всім цілям. Якщо кидок здібності завдає шкоди кільком цілям, але його ефект спрямований на істоту, що використовує здібність, або на Директора (наприклад, Muse of Fire), цей ефект відбувається лише один раз, а не для кожної цілі. Якщо різні рівні результату впливають на кілька цілей, істота, що використовує здібність, вибирає, який рівень ефекту застосувати до себе або до Директора. Якщо здібність створює кілька ефектів, ці ефекти розв'язуються в тому порядку, в якому вони перераховані.`
	};

	static difficultTerrain: RulesItem = {
		label: 'Важкопрохідна місцевість',
		content: `
Площі густого підліску, завалів, павутини або інших перешкод для пересування створюють важкопрохідну місцевість. Вхід у клітинку важкопрохідної місцевості коштує на 1 клітинку пересування більше.`
	};

	static duringTheMove: RulesItem = {
		label: 'Під час руху',
		content: `
Деякі ефекти здібностей дозволяють вам рухатися і впливати на інших істот або об'єкти під час цього руху, наприклад здібність One Hundred Throats у тіні. Для таких здібностей рух починається в клітинці, яку ви перший раз залишаєте при початку руху, і закінчується в останній клітинці, куди ви заходите.`
	};

	static dyingAndDeath: RulesItem = {
		label: 'Вмирання і смерть',
		content: `
Коли ваша Витривалість (Stamina) дорівнює 0 або нижча, ви перебуваєте у стані вмирання. Поки ви вмираєте, ви не можете виконати маневр Catch Breath у бою, ви кровоточите, і цей стан не можна усунути будь-яким способом, доки ви не вийдете з вмирання. Поки ви вмираєте, ваші союзники можуть допомагати вам витрачати Відновлення у бою, а поза боєм ви можете витрачати Відновлення як зазвичай.

Якщо ваша Витривалість опускається нижче 0 і досягає від’ємного значення вашої межі «захеканості» (winded), ви вмираєте. Після смерті вас не можна повернути до життя без використання спеціального потужного предмета, наприклад Scroll of Resurrection.`
	};

	static falling: RulesItem = {
		label: 'Падіння',
		content: `
Коли істота падає на 2 або більше клітинок і приземляється на землю, вона отримує 2 шкоди за кожну клітинку падіння (максимум 50) і опиняється у положенні «розпластаний». Істота, що падає, може зменшити ефективну висоту падіння на кількість клітинок, рівну її показнику Ловкості (до мінімуму 0). Падіння у рідину глибиною 1 або більше клітинок зменшує ефективну висоту падіння на 4 клітинки (до мінімуму 0).

Падіння не вважається примусовим переміщенням, але якщо істота примусово переміщується вниз, це вважається падінням. Рух через падіння не провокує можливих атак.

**Падіння на іншу істоту**: Якщо істота падає і приземляється на іншу істоту, та інша істота отримує ту саму шкоду від падіння. Та істота, що падала, потім опиняється у положенні «розпластаний» у найближчій незайнятій клітинці за її вибором. Якщо розмір істоти, що падає, більший за показник Сили (Might) цілі, ця ціль відкидається в положення «розпластаний».

**Довге падіння**: Коли істота вперше починає падати з великої висоти, вона падає 100 клітинок у перший раунд. У кінці кожного наступного раунду падіння вона падає ще по 100 клітинок.`
	};

	static flanking: RulesItem = {
		label: 'Флангування',
		content: `
Коли ви та один або кілька союзників знаходитеся поруч з одним і тим же ворогом і по різні боки від нього, ви флангуєте цього ворога. Поки ви флангуєте ворога, ви отримуєте перевагу (edge) на ближні удари проти нього.

Якщо ви не впевнені, чи ви і ваш союзник флангуєте ворога, проведіть уявну лінію від центру вашої клітинки до центру клітинки союзника. Якщо ця лінія проходить через протилежні боки або кути простору ворога, ви флангуєте його.

Вам потрібна лінія ефекту до ворога і можливість виконувати тригерні дії, щоб отримати або надати перевагу від флангування.`
	};

	static flying: RulesItem = {
		label: 'Політ',
		content: `
Істота, у записі швидкості якої вказано «fly» (політ), або яка тимчасово отримує здатність літати, може переміщатися по повітрю вертикально або горизонтально зі своєю повною швидкістю і залишатися в повітрі. Якщо літаючу істоту збивають у положення «розпластаний» або її швидкість знижується до 0, вона падає.`
	};

	static forcedMovement: RulesItem = {
		label: 'Примусове переміщення',
		content: `
Деякі дії та маневри дозволяють істоті штовхати, тягнути або ковзати цільову істоту чи об'єкт на певну відстань по полі бою. Сукупно такі типи переміщення називаються примусовим переміщенням:

* **Штовхнути X (Push X)**: Істота переміщує ціль на до X клітинок від себе по прямій лінії, не рухаючи її вертикально. Кожна клітинка переміщення має віддаляти ціль від істоти, що штовхає.
* **Тягнути X (Pull X)**: Істота переміщує ціль на до X клітинок до себе по прямій лінії, не рухаючи її вертикально. Кожна клітинка переміщення має наближати ціль до істоти, що тягне.
* **Зсунути X (Slide X)**: Істота переміщує ціль на до X клітинок у будь-якому напрямку, окрім вертикального. На відміну від штовхання чи тягнення, зсув не обов'язково має бути по прямій.

Коли ви примусово переміщаєте ціль, ви завжди можете перемістити її на меншу кількість клітинок, ніж вказано. Наприклад, якщо результат кидка дає «push 3», ви можете штовхати ціль на будь-яку відстань до 3 клітинок, включно з тим, щоб не переміщати певні цілі.

Примусове переміщення ігнорує важкопрохідну місцевість і ніколи не провокує можливих атак. Коли ви примусово переміщуєте ціль у шкідливу місцевість або в область з ефектом, вона страждає від цього так, ніби перемістилася туди добровільно.

**Вертикальне**: Якщо ефект примусового переміщення містить слово «vertical» (вертикальний), то примусове переміщення може переміщувати ціль вгору або вниз на додаток до горизонтального переміщення. Наприклад, «vertical push 5» дозволяє штовхнути ціль на до 5 клітинок у будь-якому напрямку, якщо переміщення є по прямій.

Якщо істота, що не вміє літати, опиняється в повітрі в кінці вертикального примусового переміщення, вона падає. Примусове переміщення, застосоване до літаючої істоти, завжди вважається вертикальним, навіть якщо це не вказано.

**Розмір**: Коли більша істота змушує рухатися меншу ціль за допомогою здібності ближнього бою, відстань примусового переміщення збільшується на 1. Якщо менша істота примусово переміщає більшу, відстань не змінюється.

**Примусове переміщення в падіння**: Якщо ви не вмієте літати і вас примусово переміщують через відкритий простір, що спричиняє падіння (наприклад, вас штовхають за край обриву), ви спершу завершите переміщення, а потім впадете, якщо місце закінчиться у положенні, що спричиняє падіння.

**Тригери руху**: Деякі здібності та ефекти спрацьовують, коли істота переміщується у певну область. Примусове переміщення ініціює такі тригери, якщо не вказано інше. Якщо примусове переміщення зумовлює зниження істоти до 0 Витривалості, примусове переміщення відбувається перед ефектом, що спрацьовує при смерті.

Деякі здібності можуть примусово переміщувати кілька істот або об'єктів одночасно. Якщо інше не зазначено, істота, що застосовує здібність, визначає порядок примусового переміщення цілей і завершує переміщення однієї цілі перед тим, як перейти до наступної.`

	};

	static hiding: RulesItem = {
		label: 'Сховання',
		content: `
Щоб сховатися від істоти, ви повинні мати прикриття або прихованість від цієї істоти (див. розділ про бій). Істота вважається спостерігаючою, якщо вона знає ваше точне місцезнаходження до того, як ви намагаєтеся сховатися. Іншими словами, якщо ворог може вказати на ваше місце, ваша спроба сховатися може провалитися.

Коли ви використовуєте маневр Hide у бою і маєте прикриття або прихованість від істоти, яка не спостерігає за вами, ви автоматично ховаєтесь від неї, якщо Директор не вирішить інакше. Якщо ви ховаєтесь поза боєм, Директор може попросити зробити перевірку навички Hide, щоб визначити ступінь прихованості.

Поки ви приховані від іншої істоти, ця істота не може націлити вас здібностями, які не мають ключового слова Area. Цей ефект закінчується, як тільки ви перестаєте бути прихованими від цієї істоти.

Крім того, поки ви приховані від істоти, ви отримуєте перевагу (edge) на кидки здібностей проти неї. Цей бонус триває до кінця ходу, в якому ви більше не є прихованими. Це означає, що ви можете бути приховані на початку свого ходу, рухатися з укриття та використати здібність, і все ще отримати перевагу на кидок цієї здібності, якщо використаєте її до кінця ходу.

Ви припиняєте бути прихованими від істоти, якщо втрачаєте прикриття або прихованість від неї. Якщо ви використовуєте здібність, взаємодієте з ворогом, рухаєтесь без крадіжки або інакше видаєте себе, ваша прихованість закінчується після вирішення дії, що вас викриває. Наприклад, якщо ви приховані й робите strike, ви спочатку вирішуєте strike, а потім перестаєте бути прихованими.

**Пошук прихованих істот**: Ви можете шукати прихованих істот у межах 10 клітинок, якщо маєте лінію ефекту до них. Для цього ви використовуєте маневр і робите тест Інтуїції з навичкою Search, а кожна прихована істота у межах 10 клітинок робить протилежний тест Ловкості з навичкою Hide (див. розділ про протилежні кидки). На розсуд Директора для протилежного тесту можуть бути використані інші характеристики або навички.`
	};

	static highGround: RulesItem = {
		label: 'Перевага висоти',
		content: `
Коли істота використовує здібність проти істоти або об'єкта, стоячи на землі у просторі, що повністю розташований вище простору цілі, вона отримує перевагу (edge) на кидок сили проти цієї цілі. Щоб вважатися повністю вище цілі, нижня межа простору істоти має бути вище або дотичною до верхньої межі простору цілі.

Істота може отримати цю перевагу під час лазіння лише якщо в її записі швидкості вказано «climb» або вона може автоматично лазити з повною швидкістю під час руху.`
	};

	static hover: RulesItem = {
		label: 'Зависання',
		content: `
Істота, у записі швидкості якої є «hover» (зависання) або яка тимчасово отримує здатність зависати, може залишатися нерухомою в повітрі. Вона не падає, навіть якщо її збивають у положення «розпластаний» або її швидкість знижується до 0.`
	};

	static invisibility: RulesItem = {
		label: 'Невидимі істоти',
		content: `
Невидимі істоти завжди мають прихованість (concealment) від інших істот. Якщо невидима істота не ховається, її все ще можна націлити здібностями. Перевірка на пошук прихованої невидимої істоти виконується з бане (bane).`
	};

	static jumping: RulesItem = {
		label: 'Стрибки',
		content: `
Коли ефект дозволяє вам рухатися (включаючи використання дії Advance), ви можете автоматично виконати довгий стрибок на кількість клітинок, що не перевищує ваш показник Сили (С) або Ловкості (Л) (на ваш вибір; мінімум 1 клітинка) як частину цього руху. Висота такого стрибка автоматично дорівнює 1 клітинці.

Якщо ви хочете стрибнути далі або вище за базовий стрибок, зробіть тест Сили або Ловкості:

**Кидок сили + Сила або Ловкість**:

| Результат | Ефект |
|:---------|:------|
| ≤ 11     | Ви не стрибаєте далі за базовий стрибок. |
| 12–16    | Ви стрибаєте на 1 клітинку довше й вище за базовий стрибок. |
| 17+      | Ви стрибаєте на 2 клітинки довше й вище за базовий стрибок. |

Ви не можете стрибнути далі або вище за межі ефекту, який дозволяє вам рухатися. Ви не можете стрибнути з важкопрохідної або шкідливої місцевості.`
	};

	static mainAction: RulesItem = {
		label: 'Основна дія',
		content: `
Коли ви використовуєте основну дію, найчастіше ви застосовуєте унікальну здібність, надану вашим класом, набором або скарбом. Такі здібності є найяскравішими та найвпливовішими варіантами використання основної дії.

Ви також можете використати основну дію, щоб допомогти іншій істоті відновити Витривалість, кинутися в атаку, захиститися або виконати безкоштовний ближній удар.

Ви можете перетворити основну дію на маневр або дію руху, що дозволяє виконати дві маневри або дві дії руху під час вашого ходу.`
	};

	static mountedCombat: RulesItem = {
		label: 'Бой верхи',
		content: `
Добровільна істота з роллю Mount може служити вам сідлом, якщо її розмір більший за ваш. Ви можете залізти на сідло без зусиль (див. розділ про лазіння по інших істотах). Ви визначаєте, який простір ви займаєте. Під час верхової їзди ви можете виконати дію Ride, але одне сідло можна використати таким чином лише раз за раунд. І вершник, і сідло кожен мають свій хід у бою.

Якщо істоту, що сидить у сідлі, примусово перемістять, її скидають із сідла, і вона має зробити тест, щоб визначити, як впаде (див. лазіння по інших істотах). Якщо примусово перемістять саме сідло, воно несе вершників з собою. Вершники і сідла телепортуються окремо.

Якщо ваш сідло вмирає, воно падає в положення «розпластаний», і ви також падаєте поруч у найближчу незайняту клітинку за вашим вибором.`
	};

	static movement: RulesItem = {
		label: 'Рух',
		content: `
Під час бою істоти можуть використовувати різні механіки для переміщення полем бою. Найпоширенішими є дії Advance або Disengage (див. дії руху), але здібності від класу, обладунку, походження, титулу або інших опцій можуть надавати додаткові способи руху.

Ваш герой починає з базовою швидкістю, заданою його походженням — зазвичай 5. Це максимальна кількість клітинок, які ви можете пройти під час дії Advance або коли інший ефект дозволяє вам рухатися. Швидкість може збільшуватись комплектом або іншими опціями гри.

Всі сусідні клітинки коштують 1 одиницю пересування. Ні, тут не діє теорема Піфагора — це гра.

Ваш герой може вільно проходити через простір союзника. Ви можете пройти через простір ворога, але такий простір вважається важкопрохідним. Ви не можете зупинитися в просторі іншої істоти, включно з виконанням strike, основної дії або маневру в цьому просторі і продовженням руху, якщо розмір тієї істоти не більший або менший за ваш як мінімум на 2 розміри.

На розсуд Директора вас можуть примусово помістити в той самий простір з іншою істотою, розмір якої відрізняється від вашого не більш ніж на 1, наприклад при падінні вузьким шахтним колодязем. Коли вас здавлюють у такому просторі, ваші кидки здібностей і перевірки виконуються з бане (bane).

**Не перевищуйте швидкість:** Одиночний рух або інший ефект ніколи не дозволяє істоті пройти більше клітинок, ніж її поточна швидкість, якщо в ефекті не вказано інакше.

**Не проходьте крізь кути:** Істота не може рухатися по діагоналі, якщо це вимагає проходження через кут стіни або іншого об’єкта, що повністю заповнює кут між простором істоти і простором, куди вона рухається. Це правило стосується лише проходження повз об’єкти, а не повз інших істот.`
	};

	static naturalRoll: RulesItem = {
		label: 'Натуральний кидок',
		content: `
Підсумок вашого кидка сили до додавання характеристики або інших модифікаторів називається натуральним кидком. Правила часто описують це як «випало натуральне X», де X — сума кидка. Наприклад, якщо ви отримали 20 на кидку сили до додавання характеристики, це — натуральне 20.

Якщо на кидку сили випадає натуральна 19 або 20, це завжди результат рівня 3 незалежно від модифікаторів, а для деяких типів кидків сили це також є критичним ударом (див. розділ «Критичний удар»).`
	};

	static opportunityAttack: RulesItem = {
		label: 'Атака нагоди',
		content: `
Якщо поруч з істотою є ворог, і цей ворог добровільно рухається в простір, який більше не суміжний з істотою, і при цьому не виконує зсув (shift), істота може скористатися рухом і виконати безкоштовний ближній удар як тригерну дію. Це називається атакою нагоди.

Якщо на кидок сили проти ворога застосовано бане або подвійне бане, істота не може виконати атаку нагоди.`
	};

	static rollVsMultipleCreatures: RulesItem = {
		label: 'Кидок проти кількох істот',
		content: `
Коли здібність має кілька цілей (наприклад, strike з кількома цілями або здібність з областю дії), ви робите один кидок сили і застосовуєте його результат до всіх цілей. Якщо проти деяких цілей у вас є переваги (edge) або бане (bane), окремі цілі можуть зазнати іншого рівня результату.

Наприклад, якщо ви націлюєте три істоти і кидок сили дає підсумок 11, кожна ціль піддається результату рівня 1. Якщо ж ви отримали перевагу на удари проти однієї з цілей, що додає +2 до кидка, ваш підсумок проти тієї цілі буде 13 і вона отримає результат рівня 2.`
	};

	static shifting: RulesItem = {
		label: 'Відступ',
		content: `
Відступ — це обережний спосіб пересування, який дозволяє істоті безпечно пройти повз небезпечних ворогів. Деякі здібності, характеристики або правила дозволяють відступити на певну кількість клітинок, іноді до вашої повної швидкості. Під час Відступу істоти не можуть робити атаки нагоди по вам, що тригеряться цим рухом.

Ви не можете відступати перебуваючи у важкопрохідній або шкідливій місцевості. Якщо правило дозволяє Відступ, ви можете натомість переміститися на ту саму кількість клітинок як звичайний рух (наприклад, щоб вийти з важкопрохідної місцевості), але не можна поєднати рух і Відступ в межах одного переміщення.`
	};

	static slammingCreatures: RulesItem = {
		label: 'Удари при штовханні істот',
		content: `
Коли ви примусово переміщуєте істоту в іншу істоту, переміщення закінчується і обидві істоти отримують 1 шкоду за кожну клітинку, що залишилася в примусовому переміщенні першої істоти. Ви також можете примусово перемістити об'єкт в істоту; у такому разі об'єкт зупиняється, а істота отримує 1 шкоду за кожну клітинку, що залишилася в руху об'єкта.

Можна одночасно перемістити в кілька менших істот велику істоту або об'єкт. У цьому випадку більша істота отримує пошкодження лише один раз, а не за кожну меншу істоту, у яку вона врізалась.

Якщо істота вмирає від шкоди, спричиненої здібністю або ефектом, який також її примусово перемістив, інша істота, у яку її вдарили, все одно отримує шкоду, якщо Директор не вирішить інакше.

Ви можете примусово перемістити іншу істоту у свій простір за допомогою pull або slide.`
	};

	static slammingObjects: RulesItem = {
		label: 'Штовхання в об’єкти',
		content: `
Коли істота примусово переміщує ціль у нерухомий об'єкт розміром не менше розміру цілі і цей об'єкт не ламається, переміщення закінчується, а ціль отримує 2 шкоди плюс 1 шкоду за кожну клітинку, що залишилася в її примусовому переміщенні.

Якщо ви примусово перемістите істоту вниз у об'єкт, який не ламається (включно з землею), вона також отримує шкоду від падіння, ніби впала на відстань примусового переміщення, і її показник Ловкості вважається 0.

**Проліт через об’єкти**: Коли ви рухаєте істоту через звичайний об'єкт, об'єкт може зламатися залежно від кількості клітинок, що залишилися у примусовому переміщенні. Вартість знищення об’єкта пов'язана з пошкодженням, яке отримує істота, пробиваючись через нього:

* 1 залишкова клітинка примусового переміщення руйнує 1 клітинку скла; істота отримує 3 шкоди.
* 3 залишкові клітинки руйнують 1 клітинку дерева; істота отримує 5 шкоди.
* 6 залишкових клітинок руйнують 1 клітинку каменю; істота отримує 8 шкоди.
* 9 залишкових клітинок руйнують 1 клітинку металу; істота отримує 11 шкоди.

Якщо після знищення об'єкта залишаються клітинки примусового переміщення, ви можете продовжити переміщувати істоту.`
	};

	static sneaking: RulesItem = {
		label: 'Підкрадання',
		content: `
Поки ви приховані від іншої істоти і не перебуваєте в бою, ви можете намагатися підкрадатися — уникати уваги інших істот під час руху, щоб залишатися прихованим. Під час підкрадання ваша швидкість зменшується вдвічі. Щоб підкрастися, зробіть тест Ловкості з навичкою Sneak з взятою складністю за рішенням Директора. Якщо ви успішні, ви залишаєтесь прихованими під час руху. На розсуд Директора для цього тесту може використовуватись інша характеристика (наприклад, Присутність, щоб злитися з натовпом).`
	};

	static suffocating: RulesItem = {
		label: 'Задихання',
		content: `
Під час бою або в подібних стресових обставинах ви можете затримати подих на кількість раундів, рівну вашому показнику Сили (мінімум 1 раунд). Після цього, в кінці кожного наступного раунду, ви отримуєте 1d6 шкоди за затримання дихання.

Поза боєм ви можете затримати подих на кількість хвилин, рівну вашому показнику Сили. Нездатність дихати після цього часу вважається стресовою ситуацією і призводить до вичерпання повітря як описано вище.`
	};

	static surprise: RulesItem = {
		label: 'Несподіванка',
		content: `
Коли починається битва, Директор визначає, які істоти, якщо такі є, опинилися захопленими зненацька. Кожна істота, що не була готова до бою на початку зустрічі, вважається несподіваною до кінця першого раунду бою. Несподівана істота не може виконувати тригерні дії або безкоштовні тригерні дії, а кидки здібностей, спрямовані проти неї, отримують перевагу (edge).

Наприклад, якщо герої непомітно підкрадуться до табору грабіжників і атакують, кожен грабіжник буде захоплений зненацька. Якщо один із героїв помітить замаскованих нежитей до атаки і не встиг попередити інших, лише той герой не буде несподіваним.`
	};

	static takingATurn: RulesItem = {
		label: 'Порядок ходу',
		content: `
Кожна істота в бою—герой, супротивник або хтось посередині—має під час свого ходу виконати основну дію, маневр і дію руху. Кожен боєць може виконувати маневр і основну дію у будь-якому порядку і може розбивати рух, наданий дією руху, перед, після або між маневром і основною дією. Ви також можете перетворити основну дію на маневр або дію руху, так що ваш хід може складатися з двох дій руху й одного маневру або двох маневрів і однієї дії руху.`
	};

	static teleporting: RulesItem = {
		label: 'Телепортація',
		content: `
Коли істота телепортується, вона миттєво переміщується з одного простору в інший. До телепортації застосовуються такі правила:

* Телепортація не провокує атак нагоди або інших ефектів, що спрацьовують при русі істоти.
* Під час телепортації істота обходить будь-які перешкоди між вихідним і цільовим просторами.
* Істота, яка телепортує себе, має мати лінію ефекту до цільового простору. Істота, що телепортує іншу істоту, має мати лінію ефекту від простору, де перебуває телепортувана істота, до її цільового простору.
* Цільовий простір під час телепортації не може бути зайнятий іншою істотою або об'єктом.
* Ефект, який дозволяє телепортацію, вказує максимальну відстань телепортації; ця відстань може бути більшою за швидкість істоти.
* Якщо істота може телепортуватися в рамках звичайного руху, вона може скористатися дією Advance, щоб телепортуватися на кількість клітинок до своєї звичайної швидкості, незміненої під дією станів.
* Якщо істота телепортується будучи у положенні «розпластаний», вона може опинитися в стоячому положенні у цільовому просторі, якщо це можливо. Якщо лежача істота телепортується іншою істотою, рішення залишити її лежачою або поставити стоячи залишається за тією істотою.
* Якщо істота телепортується під дією станів grabbed або restrained, ці стани припиняються.
* Під час телепортації істота має покинути свій вихідний простір і увійти в новий; неможливо телепортуватися в той самий простір.`
	};

	static underwaterCombat: RulesItem = {
		label: 'Бій під водою',
		content: `
Якщо істота повністю занурена у воду, вона має імунітет до вогню 5 і слабкість до блискавки 5. Якщо в її записі швидкості немає ключового слова «swim», всі її кидки сили виконуються з бане (bane).`
	};

	static wieldingTreasures: RulesItem = {
		label: 'Використання скарбів',
		content: `
Деякі скарби використовуються як зброя або імплементи. Зброя може мати ключові слова «Легка зброя», «Середня зброя» або «Важка зброя», або ключове слово, яке позначає категорію зброї («Лук», «Древкова зброя» тощо). Імплемент може мати ключове слово Implement або інше, що вказує на тип імплементу (Orb, Wand тощо). Броня також вважається скарбом для носіння і може мати ключові слова «Легка броня», «Середня броня», «Важка броня» або «Щит».

Герой може носити стільки зброї, імплементів, комплектів броні або щитів, скільки може фізично тримати або одягнути. Однак одна здібність може використовувати перевагу лише від однієї зброї або одного імплементу одночасно.`
	};
}
